
&НаСервере
Процедура РезультатОбработкаРасшифровкиНаСервере(Сотрудник)
	
	УстановитьПривилегированныйРежим(Истина);	
		
	Настройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
    ПериодОценивания=Настройки.ПараметрыДанных.Элементы.Найти("Период");
		
	ТаблицаДанных = ПоулчитьНаборДанных(НачалоМесяца(ПериодОценивания.Значение), Сотрудник);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("тзНабор", ТаблицаДанных);
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");

	СхемаРасшифровки = ОбъектОтчет.ПолучитьМакет("СхемаРасшифровка");  
	
	НастройкиОСКД = СхемаРасшифровки.НастройкиПоУмолчанию;
		
	КомпоновщикМакетаОСКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Макет = КомпоновщикМакетаОСКД.Выполнить(СхемаРасшифровки, НастройкиОСКД);
	
	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
	
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет,ВнешниеНаборыДанных,,,Ложь);
	
	РезультатРасшифровка.Очистить();
	
	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаОСКД.УстановитьДокумент(РезультатРасшифровка);
	
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);	
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	ПолеРасшифровки = ПолучитьРасшифровкуНаСервере(Расшифровка);
	
	СтандартнаяОбработка = Ложь;
	РезультатОбработкаРасшифровкиНаСервере(ПолеРасшифровки.Ссылка);
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаРасшифровка;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоулчитьНаборДанных(ПериодОценивания, Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭП_РасчетПоказателейФормулыПоказателей.ЦелевоеЗначение КАК ЦелевоеЗначение,
		|	ЭП_РасчетПоказателейФормулыПоказателей.РасчетныйПрофиль КАК РасчетныйПрофиль,
		|	ЭП_РасчетПоказателейФормулыПоказателей.Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТ_ЦелевыеЗначенияПоказателей
		|ИЗ
		|	Документ.ЭП_РасчетПоказателей.ФормулыПоказателей КАК ЭП_РасчетПоказателейФормулыПоказателей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭП_РасчетПоказателей КАК ЭП_РасчетПоказателей
		|		ПО ЭП_РасчетПоказателейФормулыПоказателей.Ссылка = ЭП_РасчетПоказателей.Ссылка
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ЭП_РасчетПоказателей.Дата, МЕСЯЦ) = &ПериодОценивания
		|	И ЭП_РасчетПоказателей.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.Сотрудник КАК Сотрудник,
		|	СУММА(ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.Часы) КАК Часы,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ЭП_ПоказателиЭффективностиСотрудников.ФактическаяВыработкаЧасов) КАК Показатель,
		|	ЭП_СотрудникиРасчетныеПрофили.Профиль КАК Профиль
		|ПОМЕСТИТЬ ВТ_ЧасыПоСотруднику
		|ИЗ
		|	РегистрСведений.ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников КАК ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники.РасчетныеПрофили КАК ЭП_СотрудникиРасчетныеПрофили
		|		ПО ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.Сотрудник = ЭП_СотрудникиРасчетныеПрофили.Ссылка
		|ГДЕ
		|	ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.ВидУчетаВремени = &ВидУчетаВремени
		|	И ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.Сотрудник = &Сотрудник
		|	И ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.ПериодРегистрации = &ПериодОценивания
		|
		|СГРУППИРОВАТЬ ПО
		|	ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.Сотрудник,
		|	ЭП_СотрудникиРасчетныеПрофили.Профиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭП_ЭффективностьСотрудников.ПрофильРасчета КАК ПрофильРасчета,
		|	ЭП_ЭффективностьСотрудников.Показатель КАК Показатель,
		|	ЭП_ЭффективностьСотрудников.Ответственный КАК Ответственный,
		|	ЭП_ЭффективностьСотрудников.Значение КАК ЗначениеПоказателя,
		|	ЭП_ЭффективностьСотрудников.Комментарий КАК Комментарий,
		|	ВТ_ЦелевыеЗначенияПоказателей.ЦелевоеЗначение КАК ЦелевоеЗначение
		|ИЗ
		|	РегистрСведений.ЭП_ЭффективностьСотрудников КАК ЭП_ЭффективностьСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦелевыеЗначенияПоказателей КАК ВТ_ЦелевыеЗначенияПоказателей
		|		ПО ЭП_ЭффективностьСотрудников.ПрофильРасчета = ВТ_ЦелевыеЗначенияПоказателей.РасчетныйПрофиль
		|			И ЭП_ЭффективностьСотрудников.Показатель = ВТ_ЦелевыеЗначенияПоказателей.Показатель
		|ГДЕ
		|	ЭП_ЭффективностьСотрудников.Сотрудник = &Сотрудник
		|	И ЭП_ЭффективностьСотрудников.ПериодОценивания = &ПериодОценивания
		|	И НЕ ЭП_ЭффективностьСотрудников.Значение = 0
		|	И НЕ ВТ_ЦелевыеЗначенияПоказателей.Показатель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ЭП_ПоказателиЭффективностиСотрудников.ФактическаяВыработкаЧасов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЦелевыеЗначенияПоказателей.РасчетныйПрофиль,
		|	ВТ_ЦелевыеЗначенияПоказателей.Показатель,
		|	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка),
		|	ВТ_ЧасыПоСотруднику.Часы,
		|	""Автоматический расчет"",
		|	ВЫРАЗИТЬ(ВТ_ЧасыПоСотруднику.Часы * 0.9 КАК ЧИСЛО(15, 2))
		|ИЗ
		|	ВТ_ЦелевыеЗначенияПоказателей КАК ВТ_ЦелевыеЗначенияПоказателей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЧасыПоСотруднику КАК ВТ_ЧасыПоСотруднику
		|		ПО ВТ_ЦелевыеЗначенияПоказателей.Показатель = ВТ_ЧасыПоСотруднику.Показатель
		|			И ВТ_ЦелевыеЗначенияПоказателей.РасчетныйПрофиль = ВТ_ЧасыПоСотруднику.Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрофильРасчета";
	
	Запрос.УстановитьПараметр("ПериодОценивания", ПериодОценивания);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ВидУчетаВремени", Справочники.ЭП_ВидыУчетаВремени.Явка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();	

КонецФункции

&НаСервере
Функция ПолучитьРасшифровкуНаСервере(Расшифровка)

	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();
	Сотрудник = Данные.Элементы[7].ПолучитьПоля();
	Ссылка = Сотрудник[0].Значение;
	СсылкаСотрудника = Новый Структура;
	СсылкаСотрудника.Вставить("Ссылка", Ссылка);
	Возврат СсылкаСотрудника;
	
КонецФункции
