
//Процедура ПриЗаписи(Отказ)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст  = "ВЫБРАТЬ
//	                |	ЭП_ПрофилиРасчетаРезультативности.Ссылка КАК Ссылка
//	                |ИЗ
//	                |	Справочник.ЭП_ПрофилиРасчетаРезультативности КАК ЭП_ПрофилиРасчетаРезультативности
//	                |ГДЕ
//	                |	НЕ ЭП_ПрофилиРасчетаРезультативности.ПометкаУдаления
//	                |	И НЕ ЭП_ПрофилиРасчетаРезультативности.Ссылка = &Ссылка
//	                |	И ЭП_ПрофилиРасчетаРезультативности.ВидДеятельности = &ВидДеятельности";
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	Запрос.УстановитьПараметр("ВидДеятельности", ВидДеятельности);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Если НЕ РезультатЗапроса.Пустой() Тогда
//	
//		Выборка = РезультатЗапроса.Выбрать(); Выборка.Следующий();
//		
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = "Невозможно записать расчетный профиль с видом деятельности "+ВидДеятельности+". Данный вид деятельности уже установлен у расчетного профиля " + Выборка.Ссылка;        
//		Сообщение.Сообщить();
//	    Отказ = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры
