&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("ЗадачаПроцесса") = Истина Тогда
		Запись.ЗадачаПроцесса = Параметры.ЗадачаПроцесса;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭП_ПлановыЧасыПоЗадачамСрезПоследних.ПлановыеЧасы КАК ПлановыеЧасы
			|ИЗ
			|	РегистрСведений.ЭП_ПлановыЧасыПоЗадачам.СрезПоследних КАК ЭП_ПлановыЧасыПоЗадачамСрезПоследних
			|ГДЕ
			|	ЭП_ПлановыЧасыПоЗадачамСрезПоследних.ЗадачаПроцесса = &ЗадачаПроцесса";
		
		Запрос.УстановитьПараметр("ЗадачаПроцесса",  Параметры.ЗадачаПроцесса);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Запись.ПлановыеЧасы = ВыборкаДетальныеЗаписи.ПлановыеЧасы;			
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)  
	
		Оповестить("ДобавитьИтерациюПроекта", Истина, ЭтаФорма); 
		
КонецПроцедуры
