

#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	ВремяПредставление = Параметры.ВремяПредставление;
	ВремяПредставлениеПолученные = Параметры.ВремяПредставление;
	ПериодРегистрацииДень = Параметры.ПериодРегистрацииДень;
	Сотрудник = Параметры.Сотрудник;
	ВидУчетаВремени = Параметры.ВидУчетаВремени;
	Часы = Параметры.Время;  
	
КонецПроцедуры 

#КонецОбласти


#Область ОбработчикиКомандФормы  

&НаСервере
Процедура ЗаписатьНаСервере() 
	
	Если ВидУчетаВремени = Справочники.ЭП_ВидыУчетаВремени.Явка Тогда
		БуквенныйКод = "Я";
	ИначеЕсли ВидУчетаВремени = Справочники.ЭП_ВидыУчетаВремени.НеЯвка Тогда
		БуквенныйКод = "НЯ";
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_ВидыУчетаВремени.БуквенныйКод КАК БуквенныйКод
		|ИЗ
		|	Справочник.ЭП_ВидыУчетаВремени КАК ЭП_ВидыУчетаВремени
		|ГДЕ
		|	ЭП_ВидыУчетаВремени.Ссылка = &ВидУчетаВремени";
		
		Запрос.УстановитьПараметр("ВидУчетаВремени", ВидУчетаВремени);
		Запрос.УстановитьПараметр("НеЯвка", Справочники.ЭП_ВидыУчетаВремени.НеЯвка);
		Запрос.УстановитьПараметр("Явка", Справочники.ЭП_ВидыУчетаВремени.Явка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
		
		БуквенныйКод = Выборка.БуквенныйКод;  
	КонецЕсли;
	
	ПолеВремяУчета = СтрШаблон("%1; %2", БуквенныйКод, Часы);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();  
		
	//Проверка на наличие исправлений
	Исправление = ?(ВремяПредставлениеПолученные = ПолеВремяУчета, Ложь, Истина);  
		
    СтруктураВозврата = Новый Структура; 
	СтруктураВозврата.Вставить("Сотрудник", Сотрудник);
	СтруктураВозврата.Вставить("ПериодРегистрацииДень", ПериодРегистрацииДень);
	СтруктураВозврата.Вставить("ВидУчетаВремени", ВидУчетаВремени);
	СтруктураВозврата.Вставить("Часы", Часы);
	СтруктураВозврата.Вставить("ВремяПредставление", ПолеВремяУчета);
	СтруктураВозврата.Вставить("Исправление", Исправление);
	ОповеститьОВыборе(СтруктураВозврата);  
КонецПроцедуры   

#КонецОбласти



