
&НаСервере
Процедура УдалитьЗаписьНаСервере(Сотрудник)
	
	НаборЗаписей = РегистрыСведений.ЭП_ОбновлениеГрафиковЗУП.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗапись(Команда)
	
	ТекДанные = Элементы.ДанныеГрафикаЗУП.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	УдалитьЗаписьНаСервере(ТекДанные.Сотрудник);
	Элементы.ДанныеГрафикаЗУП.Обновить();
	
КонецПроцедуры
