
&НаКлиенте
Процедура СформироватьДокументы(Команда)
	
	Если ПроверитьЗаполнение() Тогда
	
		СформироватьДокументыНаСервере();	
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭП_ГруппыРасчетныхПрофилей.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЭП_ГруппыРасчетныхПрофилей КАК ЭП_ГруппыРасчетныхПрофилей";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ТекДок = Документы.ЭП_РасчетПоказателей.СоздатьДокумент();
		ТекДок.Дата = Период;
		ТекДок.ГруппаРасчетныхПрофилей = Выборка.Ссылка;
		ТекДок.ЗаполнитьВсе();                         
		ТекДок.Ответственный = Пользователи.ТекущийПользователь();
		ТекДок.Комментарий = "Документ создан обработкой формирования документов расчета показателей";
		ТекДок.Записать(РежимЗаписиДокумента.Проведение);	
	
	КонецЦикла;
	
КонецПроцедуры
