#Область СтандартныйБлок

Функция СведенияОВнешнейОбработке() Экспорт
	
	// Регистрационные данные
	РегистрационныеДанные = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	РегистрационныеДанные.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	РегистрационныеДанные.Версия = Формат(ТекущаяДата(),"ДФ=yyyy.MM.dd"); // 10 символов
	РегистрационныеДанные.Наименование = ЭтотОбъект.Метаданные().Синоним;
	РегистрационныеДанные.Информация = ?(ПустаяСтрока(ЭтотОбъект.Метаданные().Комментарий),ЭтотОбъект.Метаданные().Синоним,ЭтотОбъект.Метаданные().Комментарий);
	РегистрационныеДанные.БезопасныйРежим = Ложь;

	Возврат РегистрационныеДанные;

КонецФункции

//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	//СтандартнаяОбработка = Ложь;
//	//КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
//	//Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
//	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
//	//ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки);
//	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//	//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
//	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
//    //ДокументРезультат.ПоказатьУровеньГруппировокСтрок(YYYYY); //Здесь указываем УРОВЕНЬ группировки
//	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(1);
//КонецПроцедуры

#КонецОбласти
