
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокДат.Параметры.УстановитьЗначениеПараметра("ДатаУсловногоОформления", НачалоДня(ТекущаяДата()));
		
КонецПроцедуры

&НаКлиенте
Процедура СписокДатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеГрафикаЗУП(Команда)
	ОткрытьФорму("Обработка.ЭП_ОбновлениеГрафиковЗУПУдалитьЗаписи.Форма.Форма");
КонецПроцедуры
