
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Проект = Параметры.Проект;
	Дата = Параметры.Дата;
	Ссылка = Параметры.Ссылка;
	ВидДокумента = Параметры.ВидДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники 

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	НоваяСтрока = ВыбранныеСотрудники.Добавить();
	НоваяСтрока.Сотрудник = Элементы.Сотрудники.ДанныеСтроки(ВыбраннаяСтрока).Сотрудник; 
	
	ОбновитьСписокСотрудников();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыбранныеСотрудники 

&НаКлиенте
Процедура ВыбранныеСотрудникиПриИзменении(Элемент)
	
	ОбновитьСписокСотрудников();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	МассивСотрудников = Новый Массив;
	Для Каждого Строка Из ВыбранныеСотрудники Цикл;
		МассивСотрудников.Добавить(Строка.Сотрудник);
	КонецЦикла;
	ОповеститьОВыборе(Новый Структура("МассивСотрудников", МассивСотрудников));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокСотрудников()

	Если ВидДокумента = Перечисления.ЭП_ВидыДокументаВыплатаПремий.ОбычнаяВыплата Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЭП_УчетПремийОстатки.Пользователь КАК Сотрудник
		|ИЗ
		|	РегистрНакопления.ЭП_УчетПремий.Остатки(
		|			&МоментВрем,
		|			Проект = &Проект
		|				И НЕ Пользователь В (&МассивСотрудников)) КАК ЭП_УчетПремийОстатки";
		
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЭП_УчетПремийПоДокументамОстатки.Пользователь КАК Сотрудник
		|ИЗ
		|	РегистрНакопления.ЭП_УчетПремийПоДокументам.Остатки(
		|			&МоментВрем,
		|			Проект = &Проект
		|				И НЕ Пользователь В (&МассивСотрудников)) КАК ЭП_УчетПремийПоДокументамОстатки";
		
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	МоментВрем = Новый МоментВремени(Дата, Ссылка);
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("МоментВрем", Новый Граница(МоментВрем, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("МассивСотрудников", ВыбранныеСотрудники.Выгрузить(, "Сотрудник"));
		
	РезультатЗапроса = Запрос.Выполнить();
	МассивСотрудники = Новый Массив();
    Сотрудники.Загрузить(РезультатЗапроса.Выгрузить());


КонецПроцедуры 

&НаСервере
Процедура ПриОткрытииНаСервере()
	
    ОбновитьСписокСотрудников();
	
КонецПроцедуры

#КонецОбласти