
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
	
		Возврат;		
	
	КонецЕсли;
	
	Для каждого ЗаписьМенеджера Из ЭтотОбъект Цикл
	
		НовыйГрейд = ЭП_Сотрудники.ОпределитьГрейд(ЗаписьМенеджера.Оклад);
		Если НЕ НовыйГрейд = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьМенеджера.Сотрудник,"ГрейдСотрудника") Тогда
		
			ТекОб = ЗаписьМенеджера.Сотрудник.ПолучитьОбъект();
			ТекОб.ГрейдСотрудника = НовыйГрейд;
			ТекОб.Записать();
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры
