#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ОтборПоПроекту) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Владелец", Параметры.ОтборПоПроекту); 

	Иначе 
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	СправочникЭП_СтатусыЗадач.Ссылка КАК Ссылка,
		               |	СправочникЭП_СтатусыЗадач.ПометкаУдаления КАК ПометкаУдаления,
		               |	СправочникЭП_СтатусыЗадач.Владелец КАК Владелец,
		               |	СправочникЭП_СтатусыЗадач.Код КАК Код,
		               |	СправочникЭП_СтатусыЗадач.Наименование КАК Наименование,
		               |	СправочникЭП_СтатусыЗадач.Предопределенный КАК Предопределенный,
		               |	СправочникЭП_СтатусыЗадач.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		               |ИЗ
		               |	Справочник.ЭП_СтатусыЗадач КАК СправочникЭП_СтатусыЗадач";

		СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		СвойстваСписка.ОсновнаяТаблица = "Справочник.ЭП_СтатусыЗадач";
		СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
		СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
		ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список,
		СвойстваСписка);
	КонецЕсли; 
	
	Если Параметры.НеДобавлятьСтатусВНабор Тогда
		
		КоманднаяПанель.Видимость = Ложь;
		Элементы.Создать.Видимость = Истина;
		ОтборПоВладельцу = Параметры.Отбор.Владелец;
		
	КонецЕсли;

КонецПроцедуры  

#КонецОбласти 

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура Создать(Команда)
	
	ДополнительныеПараметры = Новый Структура("НеДобавлятьСтатусВНабор", Истина); 
	ДополнительныеПараметры.Вставить("Владелец", ОтборПоВладельцу);
	ОткрытьФорму("Справочник.ЭП_СтатусыЗадач.Форма.ФормаЭлемента", ДополнительныеПараметры); 
	
КонецПроцедуры

#КонецОбласти 