
Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_ВиртуальныеЭтапыПроектов.ДатаС КАК ДатаС,
	|	ЭП_ВиртуальныеЭтапыПроектов.ДатаПо КАК ДатаПо
	|ИЗ
	|	РегистрСведений.ЭП_ВиртуальныеЭтапыПроектов КАК ЭП_ВиртуальныеЭтапыПроектов
	|ГДЕ
	|	ЭП_ВиртуальныеЭтапыПроектов.Проект = &Проект
	|	И ЭП_ВиртуальныеЭтапыПроектов.ДатаС <= &ДатаОкончания
	|	И ЭП_ВиртуальныеЭтапыПроектов.ДатаПо >= &ДатаНачала
	|	И ЭП_ВиртуальныеЭтапыПроектов.ВиртуальныйЭтапСсылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Проект", Владелец);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ТекстСообщения = НСтр("ru='Пересечение по датам этапов проекта'");
		ВызватьИсключение(ТекстСообщения);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры


