 
 #Область ОбработчикиСобытий
 
 Процедура ПередЗаписью(Отказ) 
	 
	 Если ОбменДанными.Загрузка Тогда
		 Возврат;
	 КонецЕсли;
	 
	 Если ЭтотОбъект.ЭтоНовый() Тогда
		 
		 Запрос = Новый Запрос;
		 Запрос.УстановитьПараметр("Владелец", ЭтотОбъект.Владелец);
		 Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.Наименование);
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ЭП_Теги.Наименование КАК Наименование
		 |ИЗ
		 |	Справочник.ЭП_Теги КАК ЭП_Теги
		 |ГДЕ
		 |	ЭП_Теги.Владелец = &Владелец
		 |	И ЭП_Теги.Наименование = &Наименование";
		 
		 РезультатЗапроса = Запрос.Выполнить();  
		 
		 Если Не РезультатЗапроса.Пустой() Тогда
			 ТекстСообщения = "Тег с таким наименование уже существует!";
			 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			 Отказ = Истина;
			 Возврат;
		 КонецЕсли;
		 
	 КонецЕсли;
	 
 КонецПроцедуры

 Процедура ПриЗаписи(Отказ)
	 // Вставить содержимое обработчика.
 КонецПроцедуры
 
 #КонецОбласти
