Процедура УведомленияПоЗаявкам() Экспорт
	
	Если ЭП_УведомленияПоЗаявкамСервер.ВключитьУведомленияПоЗаявкам() Тогда
	  	ПодключитьОбработчикОжидания("ПоказатьУведомленияПоЗаявкам", 60, Ложь); 
	Иначе
		ОтключитьОбработчикОжидания("ПоказатьУведомленияПоЗаявкам"); 
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПоказатьУведомленияПоЗаявкам() Экспорт  
	
	Сообщение = ЭП_УведомленияПоЗаявкамСервер.ПолучитьДанные();	 
	Если ТипЗнч(Сообщение) = Тип("Структура") Тогда
		ПоказатьОповещениеПользователя(Сообщение.ТекстСообщения, Сообщение.Заявка, " Нажмите для перехода ", БиблиотекаКартинок.Информация, СтатусОповещенияПользователя.Важное);
	КонецЕсли;    
	
КонецПроцедуры   

Процедура ОтключитьУведомления() Экспорт     
	
	ОтключитьОбработчикОжидания("ПоказатьУведомленияПоЗаявкам"); 
	
КонецПроцедуры   

