#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ветка", ПараметрКоманды);
	
	СтруктураБыстрогоОтбора = Новый Структура;
	
	СтруктураБыстрогоОтбора.Вставить("СтатусСогласования", Неопределено);
	СтруктураБыстрогоОтбора.Вставить("Согласующий", Неопределено);
	СтруктураБыстрогоОтбора.Вставить("ОбъектДобавлен", Неопределено);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	ПараметрыОткрытия.Вставить("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	ПараметрыОткрытия.Вставить("КлюЧНазначенияИспользования", "ИзмененияВВетке");
	
	ОткрытьФорму("РегистрСведений.ИзмененияВВетках.Форма.ИзмененияВВетке",
	             ПараметрыОткрытия,
				 ПараметрыВыполненияКоманды.Источник,
				 ПараметрыВыполненияКоманды.Уникальность,
				 ПараметрыВыполненияКоманды.Окно,
				 ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
