#Область ОбработчикиСобытий

Функция ПечатьАктВыдачи(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПараметрыПечати_ЭП_АктВыдачи";
	Макет = Документы.ЭП_АктПриемаПередачи.ПолучитьМакет("ПФ_АктВыдачи");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_АктПриемаПередачи.Дата КАК ДатаДок,
	|	ЭП_АктПриемаПередачи.Сотрудник КАК ФИОПолучателя,
	|	ЭП_АктПриемаПередачи.Номер КАК Номер,
	|	ЭП_АктПриемаПередачи.Номенклатура.(
	|		Номенклатура КАК Оборудование
	|	) КАК Номенклатура,
	|	ЭП_АктПриемаПередачи.Склад.Город КАК Город,
	|	ЭП_АктПриемаПередачи.Организация КАК Организация
	|ИЗ
	|	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
	|ГДЕ
	|	ЭП_АктПриемаПередачи.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	Строка = Макет.ПолучитьОбласть("Строка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Заголовок.Параметры.Заполнить(ВыборкаДетальныеЗаписи);  
		ТабДок.Вывести(Заголовок, ВыборкаДетальныеЗаписи.Уровень()); 
		ВыборкаДетальныеЗаписиНоменклатура = ВыборкаДетальныеЗаписи.Номенклатура.Выбрать(); 
		
		Пока ВыборкаДетальныеЗаписиНоменклатура.Следующий() Цикл
			
			Строка.Параметры.Заполнить(ВыборкаДетальныеЗаписиНоменклатура);
			ТабДок.Вывести(Строка, ВыборкаДетальныеЗаписиНоменклатура.Уровень());
			
		КонецЦикла;
		
		Подвал.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(Подвал, ВыборкаДетальныеЗаписи.Уровень());
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции 

Функция ПечатьАктВозвратаФорма(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПараметрыПечати_ЭП_АктВозврата";
	Макет = Документы.ЭП_АктПриемаПередачи.ПолучитьМакет("ПФ_АктВозврата");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_АктПриемаПередачи.Дата КАК ДатаДок,
	|	ЭП_АктПриемаПередачи.Сотрудник КАК ФИОПолучателя,
	|	ЭП_АктПриемаПередачи.Номер КАК Номер,
	|	ЭП_АктПриемаПередачи.Номенклатура.(
	|		Номенклатура КАК Оборудование
	|	) КАК Номенклатура,
	|	ЭП_АктПриемаПередачи.Отвественный КАК Отвественный,
	|	ЭП_АктПриемаПередачи.Склад.Город КАК Город,
	|	ЭП_АктПриемаПередачи.Организация КАК Организация
	|ИЗ
	|	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
	|ГДЕ
	|	ЭП_АктПриемаПередачи.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	Строка = Макет.ПолучитьОбласть("Строка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Заголовок.Параметры.Заполнить(ВыборкаДетальныеЗаписи);  
		ТабДок.Вывести(Заголовок, ВыборкаДетальныеЗаписи.Уровень()); 
		ВыборкаДетальныеЗаписиНоменклатура = ВыборкаДетальныеЗаписи.Номенклатура.Выбрать(); 
		
		Пока ВыборкаДетальныеЗаписиНоменклатура.Следующий() Цикл
			
			Строка.Параметры.Заполнить(ВыборкаДетальныеЗаписиНоменклатура);
			ТабДок.Вывести(Строка, ВыборкаДетальныеЗаписиНоменклатура.Уровень());
			
		КонецЦикла;
		
		Подвал.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(Подвал, ВыборкаДетальныеЗаписи.Уровень());
		
	КонецЦикла;
	
	Возврат ТабДок; 
	
КонецФункции 

Функция ПечатьТребование(МассивОбъектов, ОбъектыПечати) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_АктПриемаПередачи.ВидОперации КАК ВидОперации
	|ИЗ
	|	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
	|ГДЕ
	|	ЭП_АктПриемаПередачи.Ссылка В (&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВидОперации = Выборка.ВидОперации;
	КонецЦикла; 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПараметрыПечати_ЭП_Макет";
	Макет = Документы.ЭП_АктПриемаПередачи.ПолучитьМакет("ПФ_Макет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПечатьДокументаТребования(МассивОбъектов, ВидОперации);
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.УстановитьПараметр("Адрес", Справочники.ВидыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("НомерТелефона", Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаПечатьДокументаТребованияЦены(МассивОбъектов);
		
		Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
		
		ВыборкаНоменклатура = Запрос.Выполнить().Выбрать();
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ДетальнаяЗапись = Макет.ПолучитьОбласть("ДетальнаяЗапись");
		Подвал = Макет.ПолучитьОбласть("Подвал"); 
		
		Пока Выборка.Следующий() Цикл 
			
			НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
			
			Шапка.Параметры.Заполнить(Выборка);  
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			ТабДок.Вывести(ШапкаТаблицы, Выборка.Уровень());
			
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				ДетальнаяЗапись.Параметры.Заполнить(ВыборкаНоменклатура);
				ТабДок.Вывести(ДетальнаяЗапись, ВыборкаНоменклатура.Уровень()); 
				
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал, Выборка.Уровень());
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
			
		КонецЦикла; 
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаПечатьДокументаТребованияБезАдресаИТелефона(МассивОбъектов, ВидОперации); 
		Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
		
		РезультатЗапроса = Запрос.Выполнить();	
		Выборка = РезультатЗапроса.Выбрать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаПечатьДокументаТребованияЦены(МассивОбъектов);	
		Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);	
		ВыборкаНоменклатура = Запрос.Выполнить().Выбрать();
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ДетальнаяЗапись = Макет.ПолучитьОбласть("ДетальнаяЗапись");
		Подвал = Макет.ПолучитьОбласть("Подвал"); 
		
		Пока Выборка.Следующий() Цикл 
			
			НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
			
			Шапка.Параметры.Заполнить(Выборка);  
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			ТабДок.Вывести(ШапкаТаблицы, Выборка.Уровень());
			
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				ДетальнаяЗапись.Параметры.Заполнить(ВыборкаНоменклатура);
				ТабДок.Вывести(ДетальнаяЗапись, ВыборкаНоменклатура.Уровень()); 
				
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал, Выборка.Уровень());
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
			
		КонецЦикла; 
		
	КонецЕсли;
		
Возврат ТабДок;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПечатьДокументаТребования(МассивОбъектов, ВидОперации)
	
	Если ВидОперации = Перечисления.ЭП_ВидыОперций.ПередачаНоменклатуры Тогда
		
		Возврат "ВЫБРАТЬ
		        |	ЭП_АктПриемаПередачи.Сотрудник КАК ФизЛицоПолучатель,
		        |	ЭП_АктПриемаПередачи.Организация КАК Организация,
		        |	ЭП_АктПриемаПередачи.ВидОперации КАК ВидОперации,
		        |	ЭП_АктПриемаПередачи.Отвественный КАК Отвественный,
		        |	ЭП_АктПриемаПередачи.Ссылка КАК Ссылка,
		        |	ЭП_АктПриемаПередачи.Номер КАК Номер,
		        |	ЭП_АктПриемаПередачи.Дата КАК Дата
		        |ПОМЕСТИТЬ ВТДанныеДокумента
		        |ИЗ
		        |	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
		        |ГДЕ
		        |	ЭП_АктПриемаПередачи.Ссылка В(&Ссылка)
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТДанныеДокумента.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		        |	ВТДанныеДокумента.ВидОперации КАК ВидОперации,
		        |	ВТДанныеДокумента.Организация КАК Организация,
		        |	ЭП_Сотрудники.Подразделение КАК РабочееМестоПолучатель,
		        |	ЭП_Сотрудники.Должность КАК ФизЛицоПолучательДолжность,
		        |	ЭП_Организации.ИНН КАК ИНН,
		        |	ЭП_Организации.РасчетныйСчет КАК РасчетныйСчет,
		        |	ЭП_Организации.БИК КАК БИК,
		        |	ЭП_Организации.КорреспондентскийСчет КАК КорреспондентскийСчет,
		        |	ЭП_Организации.Банк КАК Банк,
		        |	Пользователи.ЭП_Сотрудник КАК ФизЛицоОтправитель,
		        |	ВТДанныеДокумента.Ссылка КАК Ссылка,
		        |	ВТДанныеДокумента.Номер КАК Номер,
		        |	ВТДанныеДокумента.Дата КАК Дата
		        |ПОМЕСТИТЬ ВТДанныеОргИСотр
		        |ИЗ
		        |	ВТДанныеДокумента КАК ВТДанныеДокумента
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		        |		ПО ВТДанныеДокумента.ФизЛицоПолучатель = ЭП_Сотрудники.Ссылка
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации КАК ЭП_Организации
		        |		ПО ВТДанныеДокумента.Организация = ЭП_Организации.Ссылка
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		        |		ПО ВТДанныеДокумента.Отвественный = Пользователи.Ссылка
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТДанныеОргИСотр.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		        |	ВТДанныеОргИСотр.ВидОперации КАК ВидОперации,
		        |	ВТДанныеОргИСотр.Организация КАК Организация,
		        |	ВТДанныеОргИСотр.РабочееМестоПолучатель КАК РабочееМестоПолучатель,
		        |	ВТДанныеОргИСотр.ФизЛицоПолучательДолжность КАК ФизЛицоПолучательДолжность,
		        |	ВТДанныеОргИСотр.ИНН КАК ИНН,
		        |	ВТДанныеОргИСотр.РасчетныйСчет КАК РасчетныйСчет,
		        |	ВТДанныеОргИСотр.БИК КАК БИК,
		        |	ВТДанныеОргИСотр.КорреспондентскийСчет КАК КорреспондентскийСчет,
		        |	ВТДанныеОргИСотр.Банк КАК Банк,
		        |	ВТДанныеОргИСотр.ФизЛицоОтправитель КАК ФизЛицоОтправитель,
		        |	ЭП_Сотрудники.Должность КАК ФизЛицоОтправительДолжность,
		        |	ЭП_Сотрудники.Подразделение КАК РабочееМестоОтправитель,
		        |	ВТДанныеОргИСотр.Ссылка КАК Ссылка,
		        |	ВТДанныеОргИСотр.Номер КАК Номер,
		        |	ВТДанныеОргИСотр.Дата КАК Дата
		        |ПОМЕСТИТЬ ВТДанныеСОтв
		        |ИЗ
		        |	ВТДанныеОргИСотр КАК ВТДанныеОргИСотр
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		        |		ПО ВТДанныеОргИСотр.ФизЛицоОтправитель = ЭП_Сотрудники.Ссылка
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТДанныеСОтв.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		        |	ВТДанныеСОтв.ВидОперации КАК ВидОперации,
		        |	ВТДанныеСОтв.Организация КАК Организация,
		        |	ВТДанныеСОтв.РабочееМестоПолучатель КАК РабочееМестоПолучатель,
		        |	ВТДанныеСОтв.ФизЛицоПолучательДолжность КАК ФизЛицоПолучательДолжность,
		        |	ВТДанныеСОтв.ИНН КАК ИНН,
		        |	ВТДанныеСОтв.РасчетныйСчет КАК РасчетныйСчет,
		        |	ВТДанныеСОтв.БИК КАК БИК,
		        |	ВТДанныеСОтв.КорреспондентскийСчет КАК КорреспондентскийСчет,
		        |	ВТДанныеСОтв.Банк КАК Банк,
		        |	ВТДанныеСОтв.ФизЛицоОтправитель КАК ФизЛицоОтправитель,
		        |	ВТДанныеСОтв.ФизЛицоОтправительДолжность КАК ФизЛицоОтправительДолжность,
		        |	ВТДанныеСОтв.РабочееМестоОтправитель КАК РабочееМестоОтправитель,
		        |	ЭП_ОрганизацииКонтактнаяИнформация.Представление КАК Адрес,
		        |	ВТДанныеСОтв.Ссылка КАК Ссылка,
		        |	ВТДанныеСОтв.Номер КАК Номер,
		        |	ВТДанныеСОтв.Дата КАК Дата
		        |ПОМЕСТИТЬ ВТДанныеСАдресом
		        |ИЗ
		        |	ВТДанныеСОтв КАК ВТДанныеСОтв
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации.КонтактнаяИнформация КАК ЭП_ОрганизацииКонтактнаяИнформация
		        |		ПО ВТДанныеСОтв.Организация = ЭП_ОрганизацииКонтактнаяИнформация.Ссылка
		        |ГДЕ
		        |	ЭП_ОрганизацииКонтактнаяИнформация.Вид = &Адрес
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТДанныеСАдресом.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		        |	ВТДанныеСАдресом.ВидОперации КАК ВидОперации,
		        |	ВТДанныеСАдресом.Организация КАК Организация,
		        |	ВТДанныеСАдресом.РабочееМестоПолучатель КАК РабочееМестоПолучатель,
		        |	ВТДанныеСАдресом.ФизЛицоПолучательДолжность КАК ФизЛицоПолучательДолжность,
		        |	ВТДанныеСАдресом.ИНН КАК ИНН,
		        |	ВТДанныеСАдресом.РасчетныйСчет КАК РасчетныйСчет,
		        |	ВТДанныеСАдресом.БИК КАК Бик,
		        |	ВТДанныеСАдресом.КорреспондентскийСчет КАК Кс,
		        |	ВТДанныеСАдресом.Банк КАК Банк,
		        |	ВТДанныеСАдресом.ФизЛицоОтправитель КАК ФизЛицоОтправитель,
		        |	ВТДанныеСАдресом.ФизЛицоОтправительДолжность КАК ФизЛицоОтправительДолжность,
		        |	ВТДанныеСАдресом.РабочееМестоОтправитель КАК РабочееМестоОтправитель,
		        |	ВТДанныеСАдресом.Адрес КАК Адрес,
		        |	ЭП_ОрганизацииКонтактнаяИнформация.НомерТелефона КАК Телефон,
		        |	ВТДанныеСАдресом.Ссылка КАК Ссылка,
		        |	ВТДанныеСАдресом.Номер КАК Номер,
		        |	ВТДанныеСАдресом.Дата КАК Дата
		        |ИЗ
		        |	ВТДанныеСАдресом КАК ВТДанныеСАдресом
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации.КонтактнаяИнформация КАК ЭП_ОрганизацииКонтактнаяИнформация
		        |		ПО ВТДанныеСАдресом.Организация = ЭП_ОрганизацииКонтактнаяИнформация.Ссылка
		        |ГДЕ
		        |	ЭП_ОрганизацииКонтактнаяИнформация.Вид = &НомерТелефона";
		
	Иначе 
		
		Возврат "ВЫБРАТЬ
		|	ЭП_АктПриемаПередачи.Сотрудник КАК ФизЛицоПолучатель,
		|	ЭП_АктПриемаПередачи.Организация КАК Организация,
		|	ЭП_АктПриемаПередачи.ВидОперации КАК ВидОперации,
		|	ЭП_АктПриемаПередачи.Отвественный КАК Отвественный,
		|	ЭП_АктПриемаПередачи.Ссылка КАК Ссылка,
		|	ЭП_АктПриемаПередачи.Номер КАК Номер,
		|	ЭП_АктПриемаПередачи.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеДокумента
		|ИЗ
		|	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
		|ГДЕ
		|	ЭП_АктПриемаПередачи.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеДокумента.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		|	ВТДанныеДокумента.ВидОперации КАК ВидОперации,
		|	ВТДанныеДокумента.Организация КАК Организация,
		|	ЭП_Сотрудники.Подразделение КАК РабочееМестоПолучатель,
		|	ЭП_Сотрудники.Должность КАК ФизЛицоПолучательДолжность,
		|	ЭП_Организации.ИНН КАК ИНН,
		|	ЭП_Организации.РасчетныйСчет КАК РасчетныйСчет,
		|	ЭП_Организации.БИК КАК БИК,
		|	ЭП_Организации.КорреспондентскийСчет КАК КорреспондентскийСчет,
		|	ЭП_Организации.Банк КАК Банк,
		|	Пользователи.ЭП_Сотрудник КАК ФизЛицоОтправитель,
		|	ВТДанныеДокумента.Ссылка КАК Ссылка,
		|	ВТДанныеДокумента.Номер КАК Номер,
		|	ВТДанныеДокумента.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеОргИСотр
		|ИЗ
		|	ВТДанныеДокумента КАК ВТДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		|		ПО ВТДанныеДокумента.ФизЛицоПолучатель = ЭП_Сотрудники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации КАК ЭП_Организации
		|		ПО ВТДанныеДокумента.Организация = ЭП_Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ВТДанныеДокумента.Отвественный = Пользователи.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеОргИСотр.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		|	ВТДанныеОргИСотр.ВидОперации КАК ВидОперации,
		|	ВТДанныеОргИСотр.Организация КАК Организация,
		|	ВТДанныеОргИСотр.РабочееМестоПолучатель КАК РабочееМестоПолучатель,
		|	ВТДанныеОргИСотр.ФизЛицоПолучательДолжность КАК ФизЛицоПолучательДолжность,
		|	ВТДанныеОргИСотр.ИНН КАК ИНН,
		|	ВТДанныеОргИСотр.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТДанныеОргИСотр.БИК КАК БИК,
		|	ВТДанныеОргИСотр.КорреспондентскийСчет КАК КорреспондентскийСчет,
		|	ВТДанныеОргИСотр.Банк КАК Банк,
		|	ВТДанныеОргИСотр.ФизЛицоОтправитель КАК ФизЛицоОтправитель,
		|	ЭП_Сотрудники.Должность КАК ФизЛицоОтправительДолжность,
		|	ЭП_Сотрудники.Подразделение КАК РабочееМестоОтправитель,
		|	ВТДанныеОргИСотр.Ссылка КАК Ссылка,
		|	ВТДанныеОргИСотр.Номер КАК Номер,
		|	ВТДанныеОргИСотр.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеСОтв
		|ИЗ
		|	ВТДанныеОргИСотр КАК ВТДанныеОргИСотр
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		|		ПО ВТДанныеОргИСотр.ФизЛицоОтправитель = ЭП_Сотрудники.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеСОтв.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		|	ВТДанныеСОтв.ВидОперации КАК ВидОперации,
		|	ВТДанныеСОтв.Организация КАК Организация,
		|	ВТДанныеСОтв.РабочееМестоПолучатель КАК РабочееМестоПолучатель,
		|	ВТДанныеСОтв.ФизЛицоПолучательДолжность КАК ФизЛицоПолучательДолжность,
		|	ВТДанныеСОтв.ИНН КАК ИНН,
		|	ВТДанныеСОтв.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТДанныеСОтв.БИК КАК БИК,
		|	ВТДанныеСОтв.КорреспондентскийСчет КАК КорреспондентскийСчет,
		|	ВТДанныеСОтв.Банк КАК Банк,
		|	ВТДанныеСОтв.ФизЛицоОтправитель КАК ФизЛицоОтправитель,
		|	ВТДанныеСОтв.ФизЛицоОтправительДолжность КАК ФизЛицоОтправительДолжность,
		|	ВТДанныеСОтв.РабочееМестоОтправитель КАК РабочееМестоОтправитель,
		|	ЭП_ОрганизацииКонтактнаяИнформация.Представление КАК Адрес,
		|	ВТДанныеСОтв.Ссылка КАК Ссылка,
		|	ВТДанныеСОтв.Номер КАК Номер,
		|	ВТДанныеСОтв.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеСАдресом
		|ИЗ
		|	ВТДанныеСОтв КАК ВТДанныеСОтв
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации.КонтактнаяИнформация КАК ЭП_ОрганизацииКонтактнаяИнформация
		|		ПО ВТДанныеСОтв.Организация = ЭП_ОрганизацииКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	ЭП_ОрганизацииКонтактнаяИнформация.Вид = &Адрес
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеСАдресом.ФизЛицоПолучатель КАК ФизЛицоОтправитель,
		|	ВТДанныеСАдресом.ВидОперации КАК ВидОперации,
		|	ВТДанныеСАдресом.Организация КАК Организация,
		|	ВТДанныеСАдресом.РабочееМестоПолучатель КАК РабочееМестоОтправитель,
		|	ВТДанныеСАдресом.ФизЛицоПолучательДолжность КАК ФизЛицоОтправительДолжность,
		|	ВТДанныеСАдресом.ИНН КАК ИНН,
		|	ВТДанныеСАдресом.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТДанныеСАдресом.БИК КАК Бик,
		|	ВТДанныеСАдресом.КорреспондентскийСчет КАК Кс,
		|	ВТДанныеСАдресом.Банк КАК Банк,
		|	ВТДанныеСАдресом.ФизЛицоОтправитель КАК ФизЛицоПолучатель,
		|	ВТДанныеСАдресом.ФизЛицоОтправительДолжность КАК ФизЛицоПолучательДолжность,
		|	ВТДанныеСАдресом.РабочееМестоОтправитель КАК РабочееМестоПолучатель,
		|	ВТДанныеСАдресом.Адрес КАК Адрес,
		|	ЭП_ОрганизацииКонтактнаяИнформация.НомерТелефона КАК Телефон,
		|	ВТДанныеСАдресом.Ссылка КАК Ссылка,
		|	ВТДанныеСАдресом.Номер КАК Номер,
		|	ВТДанныеСАдресом.Дата КАК Дата
		|ИЗ
		|	ВТДанныеСАдресом КАК ВТДанныеСАдресом
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации.КонтактнаяИнформация КАК ЭП_ОрганизацииКонтактнаяИнформация
		|		ПО ВТДанныеСАдресом.Организация = ЭП_ОрганизацииКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	ЭП_ОрганизацииКонтактнаяИнформация.Вид = &НомерТелефона";
		
	КонецЕсли;
	
КонецФункции
	
Функция ТекстЗапросаПечатьДокументаТребованияЦены(МассивОбъектов)
	
	Возврат "ВЫБРАТЬ
	|	ЭП_АктПриемаПередачиНоменклатура.Номенклатура КАК Номенклатура,
	|	ЭП_АктПриемаПередачиНоменклатура.ИнвентарныйНомер КАК СерийныйНомер,
	|	ЭП_АктПриемаПередачиНоменклатура.ВидНоменклатуры КАК Модель,
	|	ЭП_СтоимостьНоменклатурыСрезПоследних.Стоимость КАК Цена
	|ИЗ
	|	Документ.ЭП_АктПриемаПередачи.Номенклатура КАК ЭП_АктПриемаПередачиНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_СтоимостьНоменклатуры.СрезПоследних КАК ЭП_СтоимостьНоменклатурыСрезПоследних
	|		ПО ЭП_АктПриемаПередачиНоменклатура.Номенклатура = ЭП_СтоимостьНоменклатурыСрезПоследних.Номенклатура
	|			И ЭП_АктПриемаПередачиНоменклатура.ИнвентарныйНомер = ЭП_СтоимостьНоменклатурыСрезПоследних.ИнвентарныйНомер
	|ГДЕ
	|	ЭП_АктПриемаПередачиНоменклатура.Ссылка В(&Ссылка)"
		
КонецФункции
	
Функция ТекстЗапросаПечатьДокументаТребованияБезАдресаИТелефона(МассивОбъектов, ВидОперации)
	
	Если ВидОперации = Перечисления.ЭП_ВидыОперций.ПередачаНоменклатуры Тогда
		
		Возврат "ВЫБРАТЬ
		|	ЭП_АктПриемаПередачи.Сотрудник КАК ФизЛицоПолучатель,
		|	ЭП_АктПриемаПередачи.Организация КАК Организация,
		|	ЭП_АктПриемаПередачи.ВидОперации КАК ВидОперации,
		|	ЭП_АктПриемаПередачи.Отвественный КАК Отвественный,
		|	ЭП_АктПриемаПередачи.Ссылка КАК Ссылка,
		|	ЭП_АктПриемаПередачи.Номер КАК Номер,
		|	ЭП_АктПриемаПередачи.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеДокумента
		|ИЗ
		|	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
		|ГДЕ
		|	ЭП_АктПриемаПередачи.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеДокумента.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		|	ВТДанныеДокумента.ВидОперации КАК ВидОперации,
		|	ВТДанныеДокумента.Организация КАК Организация,
		|	ЭП_Сотрудники.Подразделение КАК РабочееМестоПолучатель,
		|	ЭП_Сотрудники.Должность КАК ФизЛицоПолучательДолжность,
		|	ЭП_Организации.ИНН КАК ИНН,
		|	ЭП_Организации.РасчетныйСчет КАК РасчетныйСчет,
		|	ЭП_Организации.БИК КАК БИК,
		|	ЭП_Организации.КорреспондентскийСчет КАК КорреспондентскийСчет,
		|	ЭП_Организации.Банк КАК Банк,
		|	Пользователи.ЭП_Сотрудник КАК ФизЛицоОтправитель,
		|	ВТДанныеДокумента.Ссылка КАК Ссылка,
		|	ВТДанныеДокумента.Номер КАК Номер,
		|	ВТДанныеДокумента.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеОргИСотр
		|ИЗ
		|	ВТДанныеДокумента КАК ВТДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		|		ПО ВТДанныеДокумента.ФизЛицоПолучатель = ЭП_Сотрудники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации КАК ЭП_Организации
		|		ПО ВТДанныеДокумента.Организация = ЭП_Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ВТДанныеДокумента.Отвественный = Пользователи.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеОргИСотр.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		|	ВТДанныеОргИСотр.ВидОперации КАК ВидОперации,
		|	ВТДанныеОргИСотр.Организация КАК Организация,
		|	ВТДанныеОргИСотр.РабочееМестоПолучатель КАК РабочееМестоПолучатель,
		|	ВТДанныеОргИСотр.ФизЛицоПолучательДолжность КАК ФизЛицоПолучательДолжность,
		|	ВТДанныеОргИСотр.ИНН КАК ИНН,
		|	ВТДанныеОргИСотр.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТДанныеОргИСотр.БИК КАК Бик,
		|	ВТДанныеОргИСотр.КорреспондентскийСчет КАК Кс,
		|	ВТДанныеОргИСотр.Банк КАК Банк,
		|	ВТДанныеОргИСотр.ФизЛицоОтправитель КАК ФизЛицоОтправитель,
		|	ЭП_Сотрудники.Должность КАК ФизЛицоОтправительДолжность,
		|	ЭП_Сотрудники.Подразделение КАК РабочееМестоОтправитель,
		|	ВТДанныеОргИСотр.Ссылка КАК Ссылка,
		|	ВТДанныеОргИСотр.Номер КАК Номер,
		|	ВТДанныеОргИСотр.Дата КАК Дата
		|ИЗ
		|	ВТДанныеОргИСотр КАК ВТДанныеОргИСотр
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		|		ПО ВТДанныеОргИСотр.ФизЛицоОтправитель = ЭП_Сотрудники.Ссылка";
		
	Иначе 
		
		Возврат "ВЫБРАТЬ
		|	ЭП_АктПриемаПередачи.Сотрудник КАК ФизЛицоПолучатель,
		|	ЭП_АктПриемаПередачи.Организация КАК Организация,
		|	ЭП_АктПриемаПередачи.ВидОперации КАК ВидОперации,
		|	ЭП_АктПриемаПередачи.Отвественный КАК Отвественный,
		|	ЭП_АктПриемаПередачи.Ссылка КАК Ссылка,
		|	ЭП_АктПриемаПередачи.Номер КАК Номер,
		|	ЭП_АктПриемаПередачи.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеДокумента
		|ИЗ
		|	Документ.ЭП_АктПриемаПередачи КАК ЭП_АктПриемаПередачи
		|ГДЕ
		|	ЭП_АктПриемаПередачи.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеДокумента.ФизЛицоПолучатель КАК ФизЛицоПолучатель,
		|	ВТДанныеДокумента.ВидОперации КАК ВидОперации,
		|	ВТДанныеДокумента.Организация КАК Организация,
		|	ЭП_Сотрудники.Подразделение КАК РабочееМестоПолучатель,
		|	ЭП_Сотрудники.Должность КАК ФизЛицоПолучательДолжность,
		|	ЭП_Организации.ИНН КАК ИНН,
		|	ЭП_Организации.РасчетныйСчет КАК РасчетныйСчет,
		|	ЭП_Организации.БИК КАК Бик,
		|	ЭП_Организации.КорреспондентскийСчет КАК Кс,
		|	ЭП_Организации.Банк КАК Банк,
		|	Пользователи.ЭП_Сотрудник КАК ФизЛицоОтправитель,
		|	ВТДанныеДокумента.Ссылка КАК Ссылка,
		|	ВТДанныеДокумента.Номер КАК Номер,
		|	ВТДанныеДокумента.Дата КАК Дата
		|ПОМЕСТИТЬ ВТДанныеОргИСотр
		|ИЗ
		|	ВТДанныеДокумента КАК ВТДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		|		ПО ВТДанныеДокумента.ФизЛицоПолучатель = ЭП_Сотрудники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Организации КАК ЭП_Организации
		|		ПО ВТДанныеДокумента.Организация = ЭП_Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ВТДанныеДокумента.Отвественный = Пользователи.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеОргИСотр.ФизЛицоПолучатель КАК ФизЛицоОтправитель,
		|	ВТДанныеОргИСотр.ВидОперации КАК ВидОперации,
		|	ВТДанныеОргИСотр.Организация КАК Организация,
		|	ВТДанныеОргИСотр.РабочееМестоПолучатель КАК РабочееМестоОтправитель,
		|	ВТДанныеОргИСотр.ФизЛицоПолучательДолжность КАК ФизЛицоОтправительДолжность,
		|	ВТДанныеОргИСотр.ИНН КАК ИНН,
		|	ВТДанныеОргИСотр.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТДанныеОргИСотр.БИК КАК Бик,
		|	ВТДанныеОргИСотр.КорреспондентскийСчет КАК Кс,
		|	ВТДанныеОргИСотр.Банк КАК Банк,
		|	ВТДанныеОргИСотр.ФизЛицоОтправитель КАК ФизЛицоПолучатель,
		|	ЭП_Сотрудники.Должность КАК ФизЛицоПолучательДолжность,
		|	ЭП_Сотрудники.Подразделение КАК РабочееМестоПолучатель,
		|	ВТДанныеОргИСотр.Ссылка КАК Ссылка,
		|	ВТДанныеОргИСотр.Номер КАК Номер,
		|	ВТДанныеОргИСотр.Дата КАК Дата
		|ИЗ
		|	ВТДанныеОргИСотр КАК ВТДанныеОргИСотр
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		|		ПО ВТДанныеОргИСотр.ФизЛицоОтправитель = ЭП_Сотрудники.Ссылка";
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_АктВыдачи";
	КомандаПечати.Представление = НСтр("ru = 'Акт выдачи'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_АктВозврата";
	КомандаПечати.Представление = НСтр("ru = 'Акт возврата'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_Макет";
	КомандаПечати.Представление = НСтр("ru = 'Требование'");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_АктВыдачи") Тогда
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ПФ_АктВыдачи"); 
		ПечатнаяФорма.ТабличныйДокумент = ПечатьАктВыдачи(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт выдачи'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЭП_АктПриемаПередачи.ПФ_АктВыдачи";   
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_АктВозврата") Тогда 	
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ПФ_АктВозврата");		
		ПечатнаяФорма.ТабличныйДокумент = ПечатьАктВозвратаФорма(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'АктВозврата'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЭП_АктПриемаПередачи.ПФ_АктВозврата"; 
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_Макет") Тогда 
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ПФ_Макет");
		ПечатнаяФорма.ТабличныйДокумент = ПечатьТребование(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Требование'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЭП_АктПриемаПередачи.ПФ_Требование";		
	КонецЕсли;
			
КонецПроцедуры      
	
#КонецОбласти	
	
	
