
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОкрашиваниеПоляЦвет();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовГруппыВводЦвета

&НаКлиенте
Процедура КрасныйПриИзменении(Элемент)  
	ОкрашиваниеПоляЦвет(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗеленыйПриИзменении(Элемент)
	ОкрашиваниеПоляЦвет();
КонецПроцедуры

&НаКлиенте
Процедура СинийПриИзменении(Элемент)
	ОкрашиваниеПоляЦвет();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

&НаКлиенте
Процедура ОкрашиваниеПоляЦвет()  
	Элементы.Цвет.ЦветФона = Новый Цвет(Объект.Красный, Объект.Зеленый, Объект.Синий);
КонецПроцедуры 

#КонецОбласти







