&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Параметры.Проект) И ЗначениеЗаполнено(Параметры.Департамент) Тогда
		Сотрудники.Параметры.УстановитьЗначениеПараметра("Проект", Параметры.Проект);
		Сотрудники.Параметры.УстановитьЗначениеПараметра("Департамент", Параметры.Департамент);
	Иначе
		Сотрудники.Параметры.УстановитьЗначениеПараметра("Проект", Null);
		Сотрудники.Параметры.УстановитьЗначениеПараметра("Департамент", Null);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(Элементы.Сотрудники.ТекущиеДанные);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
