
&НаКлиенте
Процедура ПроектПриИзменении(Элемент) 
	ПроектПриИзмененииНаСервере()
КонецПроцедуры

&НаСервере
Процедура ПроектПриИзмененииНаСервере()
	
	//Если ЗначениеЗаполнено(Объект.Проект) Тогда
	//	Элементы.Этап.ТолькоПросмотр = Ложь;
	//	Если Объект.Проект.ЭП_ПроектСопровождение Тогда
	//		Массив = Новый Массив();  
	//		Массив.Добавить(Тип("СправочникСсылка.ЭП_ВиртуальныеЭтапы"));
	//		Описание = Новый ОписаниеТипов(Массив);	
	//		Элементы.Этап.ОграничениеТипа = Описание;
	//	Иначе
	//		Массив = Новый Массив();  
	//		Массив.Добавить(Тип("СправочникСсылка.ЭП_ВиртуальныеЭтапы"));
	//		Массив.Добавить(Тип("СправочникСсылка.РазделыПроекта"));
	//		Описание = Новый ОписаниеТипов(Массив);	
	//		Элементы.Этап.ОграничениеТипа = Описание;
	//	КонецЕсли 
	//Иначе
	//	Элементы.Этап.ТолькоПросмотр = Истина;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Проект) И Объект.Проект.ЭП_ПроектСопровождение Тогда
		Элементы.ГруппаТехническиеПроекты.Видимость = Истина;
	Иначе
		Элементы.ГруппаТехническиеПроекты.Видимость = Ложь;
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		
		Элементы.НомерАкта.Доступность = (РольДоступна("Администрирование")
			Или РольДоступна("ПолныеПрава") Или РольДоступна("АдминистраторСистемы"));
		
		СписокТехническихПроектов.Параметры.УстановитьЗначениеПараметра("РеализацияУслуг", Объект.Ссылка);
		
		Если Объект.Проект.ЭП_ПроектСопровождение Тогда
			Элементы.ГруппаТехническиеПроекты.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
