#Область СлужебныйПрограммныйИнтерфейс
// Настройки размещения в панели отчетов.

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Описание = НСтр("ru = 'Ведомость движений (общая)'"); 
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВедомостьДвиженийПоСотруднику");
	НастройкиВарианта.Описание = НСтр("ru = 'Ведомость движений по сотруднику'");

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВедомостьДвиженийПоСкладу");
	НастройкиВарианта.Описание = НСтр("ru = 'Ведомость движений по складу'");

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВедомостьДвиженийПоСотрудникуДетальная");
	НастройкиВарианта.Описание = НСтр("ru = 'Ведомость движений по сотруднику (детальная)'");

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВедомостьДвиженийПоСкладуДетальная");
	НастройкиВарианта.Описание = НСтр("ru = 'Ведомость движений по складу детальная'");

КонецПроцедуры 

#КонецОбласти