
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	ДокументСсылка = ТабличныйДокументОбработкаРасшифровкиНаСервере(Расшифровка);
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ПоказатьЗначение(, ДокументСсылка);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ТабличныйДокументОбработкаРасшифровкиНаСервере(Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ПоляРасшифровки = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();
	
	Возврат ?(ПоляРасшифровки.Количество() > 0, ПоляРасшифровки[0].Значение, Неопределено);	
	
КонецФункции;


