#Область ПрограммныйИнтерфейс 

// Ставим обработчик ожидания с задержкой пять минут, который вызывает функцию,
// которая обращается к регистру сведений ЭП_ИсторияСообщений и ищет там по текущему пользователю
// записи и если они там есть, то выводит уведомление о том, что началось согласование по переработкам
Процедура Напоминания() Экспорт
	
  	ПодключитьОбработчикОжидания("Задержка", 300, Ложь);  
	
КонецПроцедуры 

Процедура Задержка() Экспорт  
	
	Сообщение = ЭП_НапоминанияСервер.ПолучитьДанные();	 
	РезультатЗапроса = Сообщение.Результат;
	Если РезультатЗапроса = Истина Тогда
		Проект = Сообщение.Проект;
		Документ = Сообщение.Документ;
		ПоказатьОповещениеПользователя("Началось согласование по проекту " + Проект, Документ," Нажмите для перехода ",БиблиотекаКартинок.Информация,СтатусОповещенияПользователя.Важное);
	КонецЕсли;    
	
КонецПроцедуры   

Процедура ОтключитьНапоминания() Экспорт     
	
	ОтключитьОбработчикОжидания("Задержка"); 
	
КонецПроцедуры   

#КонецОбласти