Процедура ВызватьНапоминаниеПроставитьОценкиСотрудникам() Экспорт

	КоличествоБезОценок = ЭП_ОбщегоНазначенияСервер.КоличествоСторудниковБезОценок();
	
	Если КоличествоБезОценок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаСообщения = СтрШаблон("Для %1 сотрудников не проставленны оценки ", КоличествоБезОценок); 
	НавигационнаяСсылка = ЭП_ОбщегоНазначенияСервер.ПолучитьСсылкуНаОбработкуПроставленияОценок();
	ПоказатьОповещениеПользователя(СтрокаСообщения, 
								НавигационнаяСсылка, 
								"Нажмите для перехода в обработку по выставлению оценок", 
								БиблиотекаКартинок.Оповещения, 
								СтатусОповещенияПользователя.Важное);
	
КонецПроцедуры  
