
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПолныеПрава = Пользователи.РолиДоступны("ПолныеПрава, ЭП_ИспользованиеЭП_РасчетРезультативностиПолныеПрава",,Ложь);
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Настройки компоновки
	ТекущиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ТекущиеНастройки);
	
	// Получить результирующие настройки отчета
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ТекПараметр = Новый ПараметрКомпоновкиДанных("ПолныеПрава");
	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ТекПараметр);
	ЗначениеПараметра.Значение = ПолныеПрава;	
	ЗначениеПараметра.Использование = Истина;	
	
	// Получить период оценивания
	ТекПараметр = Новый ПараметрКомпоновкиДанных("ПериодГод");
	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ТекПараметр);
	ПериодГод = ЗначениеПараметра.Значение;
	
	ТекПараметр = Новый ПараметрКомпоновкиДанных("ПериодМесяц");
	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ТекПараметр);
	ПериодМесяц = ЗначениеПараметра.Значение;
	
	ПериодОценивания = Дата(ПериодГод, ПериодМесяц, 1);
	
	ТекПараметр = Новый ПараметрКомпоновкиДанных("ПериодОценивания");
	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ТекПараметр);
	ЗначениеПараметра.Значение = ПериодОценивания;
	ЗначениеПараметра.Использование = Истина;	
	
	//Макет компоновки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки,,,Ложь);
	
	//Компоновка данных 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки, Истина, Ложь);
	
	//Вывод результата 
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
	

КонецПроцедуры
