#Область ПрограмныйИнтерфейс

Функция СоздатьТекстПисьма(Ответственный, Департамент, ТабЧастьСотрудники, ПроектДокумента, Ссылка) Экспорт

	HTMLТекст = 
	"<html>
	|<head>
	|<meta http-equiv=Content-Type content=""text/html; charset=windows-1251"">
	|<meta name=Generator content=""Microsoft Word 14 (filtered)"">
	|<style type=""text/css"">
	|
	|    body {
	|         margin-top: 2px;
	|         margin-left: 2px;
	|         margin-right: 2px;
	|         font-family: Arial; 
	|         font-size: 12pt;}
	|    table {
	|          border: 1px solid #000;
	|          border-collapse: collapse;
	|        	text-align: center;}
	|    td {
	|       border: 1px solid;
	|		text-align: center;}
	|    th {
	|       border: 1px solid;
	|		text-align: center;}
	|    a:link {
	|           color: #006699;} 
	|    a:hover {
	|            color: #006699; 
	|            text-decoration: underline;}
	|    p {
	|      margin-top: 10px;}
	|    img {
	|        width: 150;
	|        height: 150}
	|
	|</style>
	|</head>";
		
	HTMLТекст = HTMLТекст + "<body>";
	
	HTMLТекст = HTMLТекст + "<font color=#413003>";
	HTMLТекст = HTMLТекст + "Здравствуйте, ";
	HTMLТекст = HTMLТекст + "</font>";
	HTMLТекст = HTMLТекст + Ответственный;
	HTMLТекст = HTMLТекст + "<br>"; 
	
	HTMLТекст = HTMLТекст + "<font color=#413003>";
	HTMLТекст = HTMLТекст + "Создано утверждение переработок по проекту: ";
	HTMLТекст = HTMLТекст + "</font>";
	HTMLТекст = HTMLТекст + ПроектДокумента;
	HTMLТекст = HTMLТекст + "<br>";  
	
	HTMLТекст = HTMLТекст + "<font color=#413003>";
	HTMLТекст = HTMLТекст + "Ссылка на документ в тонком клиенте: ";
	HTMLТекст = HTMLТекст + "</font>";
	HTMLТекст = HTMLТекст + ПолучитьНавигационнуюСсылку(Ссылка);
	HTMLТекст = HTMLТекст + "<br>";
	
	HTMLТекст = HTMLТекст + "<font color=#413003>";
	HTMLТекст = HTMLТекст + "Ссылка на документ в веб-клиенте: ";
	HTMLТекст = HTMLТекст + "</font>";
	HTMLТекст = HTMLТекст + "<a href=";
	HTMLТекст = HTMLТекст + "http://prod-1c.edit-pro.ru/prod_ep_sppr/#e1cib/data/";
	HTMLТекст = HTMLТекст + СтрЗаменить(ПолучитьНавигационнуюСсылку(Ссылка),"e1cib/data/","");
	HTMLТекст = HTMLТекст + ">";
	HTMLТекст = HTMLТекст + "Ссылка";
	HTMLТекст = HTMLТекст + "</a>";
	HTMLТекст = HTMLТекст + "<br>";
	
	HTMLТекст = HTMLТекст + "<font color=#413003>";
	HTMLТекст = HTMLТекст + "Следующие сотрудники имеют переработки:";
	HTMLТекст = HTMLТекст + "</font>";
	HTMLТекст = HTMLТекст + "<br>";
	
	HTMLТекст = HTMLТекст + "<table>";
	HTMLТекст = HTMLТекст + "<tr>";   
	HTMLТекст = HTMLТекст + "<th>Департамент</th>";
	HTMLТекст = HTMLТекст + "<th>Сотрудник</th>";
	HTMLТекст = HTMLТекст + "<th>Этап</th>";
	HTMLТекст = HTMLТекст + "<th>Технический проект</th>";
	HTMLТекст = HTMLТекст + "<th>Задача</th>";
	HTMLТекст = HTMLТекст + "<th>Дата</th>";
	HTMLТекст = HTMLТекст + "<th>Часы по табелю</th>";
	HTMLТекст = HTMLТекст + "<th>Часы переработок</th>";
	HTMLТекст = HTMLТекст + "<th>Часы фактические</th>";
	HTMLТекст = HTMLТекст + "<th>Отгул</th>";
	HTMLТекст = HTMLТекст + "</tr>";
	
	Для Каждого Элемент Из ТабЧастьСотрудники Цикл
		
		Если Департамент = 0 ИЛИ Элемент.Департамент = Департамент Тогда
			
			HTMLТекст = HTMLТекст + "<tr>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.Департамент + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.Сотрудник + "</td>"; 
			HTMLТекст = HTMLТекст + "<td>" + Элемент.Этап + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.ТехническийПроект + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.Задача + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.Дата + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.ЧасыПоТабелю + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.ЧасыПереработок + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.ЧасыФакт + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.Отгул + "</td>";
			HTMLТекст = HTMLТекст + "</tr>";
			
		КонецЕсли;
		
	КонецЦикла;
	
	HTMLТекст = HTMLТекст + "</table>";
	
	Возврат HTMLТекст;
	
КонецФункции

Функция ПолучитьМассивОтветственных(Проект) Экспорт	
	
	УстановитьПривилегированныйРежим(Истина);

	МассивДанныхПользователей = Новый Массив; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступаПользователи.Ссылка КАК Ссылка,
	|	ГруппыДоступаПользователи.Пользователь КАК Пользователь,
	|	ГруппыДоступа.Профиль КАК Профиль
	|ПОМЕСТИТЬ ВТ_Профили
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ПО ГруппыДоступа.Ссылка = ГруппыДоступаПользователи.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Профиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Профили.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ ВТ_Роли
	|ИЗ
	|	ВТ_Профили КАК ВТ_Профили
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	|		ПО ВТ_Профили.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	|ГДЕ
	|	ПрофилиГруппДоступаРоли.Роль = &Роль
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Профили.Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пользователи.ЭП_Сотрудник КАК ЭП_Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	ВТ_Роли КАК ВТ_Роли
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ВТ_Роли.Пользователь = Пользователи.Ссылка
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И Пользователи.ЭП_Сотрудник <> ЗНАЧЕНИЕ(Справочник.ЭП_Сотрудники.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.ЭП_Сотрудник КАК Сотрудник,
	|	ЭП_СотрудникиКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	0 КАК Департамент
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники.КонтактнаяИнформация КАК ЭП_СотрудникиКонтактнаяИнформация
	|		ПО ВТ_Сотрудники.ЭП_Сотрудник = ЭП_СотрудникиКонтактнаяИнформация.Ссылка"; 
	
	Индентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Роли["ЭП_ОтправкаПисем"]);
	Запрос.УстановитьПараметр("Роль", Индентификатор);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда		
		Выборка = РезультатЗапроса.Выбрать();			
		Пока Выборка.Следующий() Цикл			
			СтруктураОтветственных = Новый Структура;
			СтруктураОтветственных.Вставить("АдресЭП", Выборка.АдресЭП);
			СтруктураОтветственных.Вставить("Ответственный", Выборка.Сотрудник); 
			СтруктураОтветственных.Вставить("Департамент", 0);
            МассивДанныхПользователей.Добавить(СтруктураОтветственных);					
		КонецЦикла;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.ЭП_Сотрудник КАК ЭП_Сотрудник,
		|	ПроектыУведомлениеРуководителей.Почта КАК Почта,
		|	ЕСТЬNULL(ПроектыУведомлениеРуководителей.Департамент, 0) КАК Департамент
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты.УведомлениеРуководителей КАК ПроектыУведомлениеРуководителей
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|			ПО (Пользователи.ЭП_Сотрудник = ПроектыУведомлениеРуководителей.Сотрудник)
		|		ПО (ПроектыУведомлениеРуководителей.Ссылка = Проекты.Ссылка)
		|ГДЕ
		|	Проекты.Ссылка = &Проект
		|	И ПроектыУведомлениеРуководителей.Почта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ.ЭП_Сотрудник КАК Сотрудник,
		|	ЭП_СотрудникиКонтактнаяИнформация.АдресЭП КАК АдресЭП,
		|	ВЫБОР
		|		КОГДА ВТ.Департамент ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВТ.ЭП_Сотрудник.Департамент
		|	КОНЕЦ КАК Департамент
		|ПОМЕСТИТЬ ВТ_СотрудникиПоПроектам
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники.КонтактнаяИнформация КАК ЭП_СотрудникиКонтактнаяИнформация
		|		ПО ВТ.ЭП_Сотрудник = ЭП_СотрудникиКонтактнаяИнформация.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СотрудникиПоПроектам.Сотрудник КАК Сотрудник,
		|	ВТ_СотрудникиПоПроектам.АдресЭП КАК АдресЭП,
		|	ВТ_СотрудникиПоПроектам.Департамент КАК Департамент
		|ПОМЕСТИТЬ ВТ_Итоги
		|ИЗ
		|	ВТ_СотрудникиПоПроектам КАК ВТ_СотрудникиПоПроектам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итоги.Сотрудник КАК Сотрудник,
		|	ВТ_Итоги.АдресЭП КАК АдресЭП,
		|	ВТ_Итоги.Департамент КАК Департамент
		|ИЗ
		|	ВТ_Итоги КАК ВТ_Итоги
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Итоги.Сотрудник,
		|	ВТ_Итоги.АдресЭП,
		|	ВТ_Итоги.Департамент";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	МассивДанныхПользователейИзСправочникаПроекты = Новый Массив;
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаПроекты = РезультатЗапроса.Выбрать();
		Пока ВыборкаПроекты.Следующий() Цикл
			Для Каждого ЭлементМассива Из МассивДанныхПользователей Цикл
				Если ЭлементМассива.АдресЭП <> ВыборкаПроекты.АдресЭП Тогда 
					СтруктураОтветственных = Новый Структура;
					СтруктураОтветственных.Вставить("АдресЭП", ВыборкаПроекты.АдресЭП);
					СтруктураОтветственных.Вставить("Ответственный", ВыборкаПроекты.Сотрудник); 
					СтруктураОтветственных.Вставить("Департамент", ВыборкаПроекты.Департамент);
					МассивДанныхПользователейИзСправочникаПроекты.Добавить(СтруктураОтветственных);					
				КонецЕсли;
			КонецЦикла; 
		КонецЦикла; 
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивДанныхПользователей, МассивДанныхПользователейИзСправочникаПроекты);
	УстановитьПривилегированныйРежим(Ложь);

	Возврат МассивДанныхПользователей;
	
КонецФункции 

#КонецОбласти