Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЭП_КорректировкаВыплатПремий.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭП_КорректировкаВыплатПремий.Дата,
	|	ЭП_КорректировкаВыплатПремий.Комментарий,
	|	ЭП_КорректировкаВыплатПремий.Номер,
	|	ЭП_КорректировкаВыплатПремий.Ответственный,
	|	ЭП_КорректировкаВыплатПремий.Проект,
	|	ЭП_КорректировкаВыплатПремий.Этап,
	|	ЭП_КорректировкаВыплатПремий.Сотрудники.(
	|		НомерСтроки,
	|		Сотрудник,
	|		ПроектныйКоэффициент,
	|		ВидДвижения,
	|		ПремияПоЭтапу,
	|		ПроектнаяПремия
	|	)
	|ИЗ
	|	Документ.ЭП_КорректировкаВыплатПремий КАК ЭП_КорректировкаВыплатПремий
	|ГДЕ
	|	ЭП_КорректировкаВыплатПремий.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСотрудникиШапка = Макет.ПолучитьОбласть("СотрудникиШапка");
	ОбластьСотрудники = Макет.ПолучитьОбласть("Сотрудники");
	ОбластьИтог = Макет.ПолучитьОбласть("Всего");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСотрудникиШапка);
		ВыборкаСотрудники = Выборка.Сотрудники.Выбрать();
		СуммаИтогПЗК = 0;
		СуммаИтогПП = 0;
		
		Пока ВыборкаСотрудники.Следующий() Цикл
			ОбластьСотрудники.Параметры.Заполнить(ВыборкаСотрудники);
			ТабДок.Вывести(ОбластьСотрудники, ВыборкаСотрудники.Уровень());
			СуммаИтогПЗК = СуммаИтогПЗК + ВыборкаСотрудники.ПремияПоЭтапу;
			СуммаИтогПП = СуммаИтогПП + ВыборкаСотрудники.ПроектнаяПремия;
		КонецЦикла;

		ОбластьИтог.Параметры.ВсегоПоПЗК = СуммаИтогПЗК;
		ОбластьИтог.Параметры.ВсегоПоПП = СуммаИтогПП;
		ТабДок.Вывести(ОбластьИтог);
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
					

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
