
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
	
		Возврат;		
	
	КонецЕсли;
	
	ТекРасчетныеПрофиля = ЭтотОбъект.ВыгрузитьКолонку("ПрофильРасчета");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних.РасчетныйПрофиль КАК РасчетныйПрофиль,
	               |	ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЭП_ДатыЗакрытияРедактированияПоказателей.СрезПоследних(&Период, РасчетныйПрофиль В (&МассивРасчетныхПрофилей)) КАК ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних
	               |ГДЕ
	               |	ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних.Период = &Период";
	Запрос.УстановитьПараметр("МассивРасчетныхПрофилей", ТекРасчетныеПрофиля); 
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Отбор.ПериодОценивания.Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
			
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "По следующим расчетным профилям закрыт период редактирования: ";        
		Сообщение.Сообщить();
		Пока Выборка.Следующий() Цикл
		
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ""+Выборка.РасчетныйПрофиль;        
			Сообщение.Сообщить();
		
		КонецЦикла;
		Возврат;
	
	КонецЕсли;
	
КонецПроцедуры
