Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Настройки = КомпоновщикНастроек.Настройки;
    ПараметрСКДНачало = Настройки.ПараметрыДанных.Элементы.Найти("ОбщаяГруппа"); 
	ПараметрСКДНачало.Значение = Справочники.ЭП_ГруппыРасчетныхПрофилей.НайтиПоНаименованию("ОбщийРасчет");
    ПараметрСКДНачало.Использование = Истина;
	ПараметрСКДОкончание = Настройки.ПараметрыДанных.Элементы.Найти("ГруппаТимЛидер");
    ПараметрСКДОкончание.Значение = Справочники.ЭП_ГруппыРасчетныхПрофилей.НайтиПоНаименованию("Разработчики Teamlead");
    ПараметрСКДОкончание.Использование = Истина;
КонецПроцедуры 