#Область СлужебныйПрограммныйИнтерфейс

// Рассчитывает сумму по сотрудникам в табличной части с учетом проектного коэффициента 
Процедура РассчитатьСуммуСУчетомПроектногоКоэффициента(СтрокаТабличнойЧасти) Экспорт

	СтрокаТабличнойЧасти.ИтогСУчетомПроектногоКоэффициента = (СтрокаТабличнойЧасти.ПремияПоЭтапу + СтрокаТабличнойЧасти.ПроектнаяПремия + СтрокаТабличнойЧасти.ОстатокПЗК) * 
	СтрокаТабличнойЧасти.СреднийКоэффициентПЗК*СтрокаТабличнойЧасти.ПроектныйКоэффициент;

КонецПроцедуры

// Рассчитывает сумму по сотрудникам в табличной части без учета проектного коэффициента 
Процедура РассчитатьСуммуБезУчетаПроектногоКоэффициента(СтрокаТабличнойЧасти) Экспорт
	
	СтрокаТабличнойЧасти.ИтогБезУчетаПроектногоКоэффициента = СтрокаТабличнойЧасти.ОстатокПЗК + СтрокаТабличнойЧасти.ПремияПоЭтапу +
	СтрокаТабличнойЧасти.ПроектнаяПремия;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

#КонецОбласти
