
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Дата = Параметры.Дата;
	Статус = Параметры.Статус;
	ТекстПоручения = Параметры.ТекстПоручения;
	
	СтрокаАвторИсполнитель = СтрШаблон("%1 -> ", ПредставлениеПользователя(Параметры.Автор));
	Исполнитель = Параметры.ИсполнительПоручения;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ПараметрыЗакрытия = Новый Структура("ТекстПоручения", ТекстПоручения);
	ПараметрыЗакрытия.Вставить("Исполнитель", Исполнитель);   
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПредставлениеПользователя(Пользователь)

	Если ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Строка(Пользователь);
	Иначе
		Возврат НСтр("ru = '<не указан>'");
	КонецЕсли;

КонецФункции

#КонецОбласти