
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	Дата = Параметры.Дата;
	Статус = Параметры.Статус;
	ТекстПоручения = Параметры.ТекстСообщения;
	Автор = ПредставлениеПользователя(Параметры.Автор);	
	                             	
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	Закрыть(ТекстПоручения);
КонецПроцедуры

 &НаСервере
Функция ПредставлениеПользователя(Пользователь)

	Если ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Строка(Пользователь);
	Иначе
		Возврат НСтр("ru = '<не указан>'");
	КонецЕсли;

КонецФункции

