
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Пользователи.РолиДоступны("ЭП_СогласованиеТрудозатратКПремированию") Тогда
		
		Элементы.Согласовать.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиЭлементовШапкиФормы

&НаКлиенте
Процедура Согласовать(Команда)
	СогласоватьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбратчикиДинамическогоСпсика 

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.Статус) 
			И ТекущаяСтрока.Статус = ПредопределенноеЗначение("Перечисление.ЭП_СтатусыДокументаУтверждениеПереработок.НаСогласовании") Тогда
			Элементы.Согласовать.Видимость = Истина;
		Иначе
			Элементы.Согласовать.Видимость = Ложь;	
		КонецЕсли;
	Иначе
		Элементы.Согласовать.Видимость = Ложь;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура СогласоватьНаСервере()
	
	Документы.ЭП_ПланированиеТрудозатрат.СогласоватьПереработки(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Если ИмяСобытия = "СтатусНаСогласовании" Тогда
			
			Если Параметр.Статус = ПредопределенноеЗначение("Перечисление.ЭП_СтатусыДокументаУтверждениеПереработок.НаСогласовании")
				И ТекущаяСтрока.Ссылка = Параметр.Объект Тогда
				
				УстановитьОформление(ТекущаяСтрока, Истина);
				
			ИначеЕсли Параметр.Статус = ПредопределенноеЗначение("Перечисление.ЭП_СтатусыДокументаУтверждениеПереработок.НовыйДокумент")
				И ТекущаяСтрока.Ссылка = Параметр.Объект Тогда
				
				УстановитьОформление(ТекущаяСтрока, Ложь);
				
			ИначеЕсли Параметр.Статус = ПредопределенноеЗначение("Перечисление.ЭП_СтатусыДокументаУтверждениеПереработок.Отменен") 
				И ТекущаяСтрока.Ссылка = Параметр.Объект Тогда
				
				УстановитьОформление(ТекущаяСтрока, Ложь);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформление(ТекущаяСтрока, ПараметрОтображения)
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.Статус) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Согласовать" ,"Видимость" ,ПараметрОтображения); 
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Согласовать" ,"Видимость" ,Ложь);	
		КонецЕсли; 	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 
