#Область ПрограммныйИнтерфейс
// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
    
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.Идентификатор = "ЭП_РасчетПоказателей";
    КомандаПечати.Представление = НСтр("ru = 'Расчет показателей'");
   
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	// Печать направления
    ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ЭП_РасчетПоказателей");
    Если ПечатнаяФорма <> Неопределено Тогда
           
        // описание печатной формы
        ПечатнаяФорма.ТабличныйДокумент = ПечатьРасчетаПоказателей(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Расчет показателей'");
        ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЭП_РасчетПоказателей.ПФ_MXL_РасчетПоказателей";
		//ПечатнаяФорма.ИмяФайлаПечатнойФормы = ИменаФайлов;
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьРасчетаПоказателей(МассивОбъектов, ОбъектыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
    ТабДок.КлючПараметровПечати = "ПараметрыПечати_ЭП_РасчетПоказателей";
	
	Макет = Документы.ЭП_РасчетПоказателей.ПолучитьМакет("ПФ_MXL_РасчетПоказателей");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭП_РасчетПоказателей.Дата КАК Дата,
	|	ЭП_РасчетПоказателей.ВводныеДляНачисленияПремий.(
	|		НомерСтроки КАК НомерСтроки,
	|		Сотрудник КАК Сотрудник,
	|		Проект КАК Проект,
	|		Этап КАК Этап,
	|		Оклад КАК Оклад,
	|		ОстатокПЗК КАК ОстатокПЗК,
	|		ПроектнаяПремия КАК ПроектнаяПремия,
	|		КоэффициентПЗК КАК КоэффициентПЗК,
	|		КоличествоДнейВЭтапе КАК КоличествоДнейВЭтапе,
	|		ДнейПоТабелю КАК ДнейПоТабелю,
	|		ОтработанныеЧасы КАК ОтработанныеЧасы,
	|		ОстатокДнейНаНачалоПериода КАК ОстатокДнейНаНачалоПериода,
	|		ДнейКПремированию КАК ДнейКПремированию,
	|		Ставка КАК Ставка,
	|		КоэффициентПоПроекту КАК КоэффициентПоПроекту,
	|		ПремияПоЭтапу КАК ПремияПоЭтапу,
	|		КоэффициентПоРаспределению КАК КоэффициентПоРаспределению,
	|		КоэффициентПоЭтапу КАК КоэффициентПоЭтапу,
	|		ПроцентПЗК КАК ПроцентПЗК
	|	) КАК ВводныеДляНачисленияПремий,
	|	ЭП_РасчетПоказателей.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭП_РасчетПоказателей КАК ЭП_РасчетПоказателей
	|ГДЕ
	|	ЭП_РасчетПоказателей.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Проект,
	|	Этап";
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьВводныеДляНачисленияПремийШапка = Макет.ПолучитьОбласть("ВводныеДляНачисленияПремийШапка");
	ОбластьВводныеДляНачисленияПремий = Макет.ПолучитьОбласть("ВводныеДляНачисленияПремий");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВводныеДляНачисленияПремийШапка);
		ВыборкаВводныеДляНачисленияПремий = Выборка.ВводныеДляНачисленияПремий.Выбрать();
		Пока ВыборкаВводныеДляНачисленияПремий.Следующий() Цикл
			ОбластьВводныеДляНачисленияПремий.Параметры.Заполнить(ВыборкаВводныеДляНачисленияПремий);
			ТабДок.Вывести(ОбластьВводныеДляНачисленияПремий, ВыборкаВводныеДляНачисленияПремий.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;	
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	КонецЦикла;
	
	ТабДок.Вывести(Подвал);
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.Автомасштаб = Истина;  
	ТабДок.ФиксацияСверху = 6; 
	ТабДок.Защита = Истина;
	Возврат ТабДок;

КонецФункции

#КонецОбласти