
#Область СобытияЭлементов

&НаКлиенте
Процедура ПоказателиПередНачаломИзменения(Элемент, Отказ)
	ТекущиеДанные = Элементы.Показатели.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПоказателиЦелевоеЗначение.МинимальноеЗначение = ПолучитьЗначениеРеквизита(ТекущиеДанные.Показатель, "МинЗначение");
	Элементы.ПоказателиЦелевоеЗначение.МаксимальноеЗначение = ПолучитьЗначениеРеквизита(ТекущиеДанные.Показатель, "МаксЗначение");

	Элементы.ПоказателиЗначениеПоУмолчанию.МинимальноеЗначение = ПолучитьЗначениеРеквизита(ТекущиеДанные.Показатель, "МинЗначение");
	Элементы.ПоказателиЗначениеПоУмолчанию.МаксимальноеЗначение = ПолучитьЗначениеРеквизита(ТекущиеДанные.Показатель, "МаксЗначение");

КонецПроцедуры

#КонецОбласти


#Область Служебные

&НаСервере
Функция ПолучитьЗначениеРеквизита(ВладелецРеквизита, ИмяРеквизита)
	
	СтруктураРеквизита = Новый Структура(ИмяРеквизита);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, ВладелецРеквизита);
	Возврат СтруктураРеквизита[ИмяРеквизита];
	
КонецФункции

#КонецОбласти
