
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Для Каждого СтрокаСписка Из Строки Цикл
		ДанныеСтроки = СтрокаСписка.Значение.Данные;
		
		ДанныеСтроки.ТипЗначенияДлина = ДанныеСтроки.ТипЗначения.КвалификаторыЧисла.Разрядность;
		ДанныеСтроки.ТипЗначенияТочность = ДанныеСтроки.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти; 
		
		ОформлениеСтроки = СтрокаСписка.Значение.Оформление;
		ФорматСтроки = СтрШаблон("ЧЦ=%1; ЧДЦ=%2", ДанныеСтроки.ТипЗначенияДлина, ДанныеСтроки.ТипЗначенияТочность); 	
		УстановитьФорматЯчейкиСтроки(ОформлениеСтроки, "МинЗначение", ФорматСтроки); 
		УстановитьФорматЯчейкиСтроки(ОформлениеСтроки, "МаксЗначение", ФорматСтроки); 
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьФорматЯчейкиСтроки(ОформлениеСтроки, ИмяПоля, ФорматСтроки)
	
	ОформлениеЯчейки = ОформлениеСтроки.Получить(ИмяПоля);
	ЭлементОформления = ОформлениеЯчейки.Элементы.Найти("Формат");
	ЭлементОформления.Значение = ФорматСтроки;
	
КонецПроцедуры

