Функция ВключитьУведомленияПоЗаявкам() Экспорт 
	Если Пользователи.РолиДоступны("ЭП_ИспользованиеЭП_НастройкиУведомленийПоЗаявкам", Пользователи.ТекущийПользователь()) Тогда 

		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ПараметрУведомленияПоЗаявкам", ПользователиКлиентСервер.ТекущийПользователь());
		Возврат ПолучитьФункциональнуюОпцию("ЭП_УведомленияПоЗаявкам", СтруктураПараметров);   
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанные() Экспорт
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭП_ИсторияУведомленийПоЗаявкамСрезПоследних.Пользователь КАК Пользователь,
			|	ЭП_ИсторияУведомленийПоЗаявкамСрезПоследних.Заявка КАК Заявка,
			|	ЭП_ИсторияУведомленийПоЗаявкамСрезПоследних.СтатусЗаявки КАК СтатусЗаявки,
			|	ЭП_ИсторияУведомленийПоЗаявкамСрезПоследних.Период КАК Период
			|ИЗ
			|	РегистрСведений.ЭП_ИсторияУведомленийПоЗаявкам.СрезПоследних КАК ЭП_ИсторияУведомленийПоЗаявкамСрезПоследних
			|ГДЕ
			|	НЕ ЭП_ИсторияУведомленийПоЗаявкамСрезПоследних.Оповещен
			|	И ЭП_ИсторияУведомленийПоЗаявкамСрезПоследних.Пользователь = &Пользователь";
		
		Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
					НаборЗаписей = РегистрыСведений.ЭП_ИсторияУведомленийПоЗаявкам.СоздатьМенеджерЗаписи();
					НаборЗаписей.Период = Выборка.Период;
					НаборЗаписей.Пользователь = Выборка.Пользователь;
					НаборЗаписей.Заявка = Выборка.Заявка; 
					НаборЗаписей.СтатусЗаявки = Выборка.СтатусЗаявки;
					НаборЗаписей.Прочитать();
					Если НаборЗаписей.Выбран() Тогда
						НаборЗаписей.Оповещен = Истина;
						НаборЗаписей.Записать();
					КонецЕсли;
					СтруктураСообщения = Новый Структура("Заявка, ТекстСообщения", ПолучитьНавигационнуюСсылку(Выборка.Заявка), "Заявка имеет состояние: " + Выборка.СтатусЗаявки + ".");
					Возврат СтруктураСообщения; 
			КонецЦикла;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	
КонецФункции
	
