#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.НеДобавлятьВидЗадачиВНабор Тогда 
		КоманднаяПанель.Видимость = Ложь;
		Элементы.Создать.Видимость = Истина;
		ОтборПоВладельцу = Параметры.Отбор.Владелец;
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)   
	
	ДополнительныеПараметры = Новый Структура("НеДобавлятьВидЗадачиВНабор", Истина);
	ДополнительныеПараметры.Вставить("Владелец", ОтборПоВладельцу);
	ОткрытьФорму("Справочник.ЭП_ВидыЗадачи.Форма.ФормаЭлемента", ДополнительныеПараметры); 
	
КонецПроцедуры

#КонецОбласти 