#Область ОбработчикиСобытийФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 Массив = Новый Массив; 
	 Массив.Добавить(Перечисления.ЭП_СтатусПроекта.ПустаяСсылка());
	 Массив.Добавить(Перечисления.ЭП_СтатусПроекта.Действующий);
	 Список.Параметры.УстановитьЗначениеПараметра("ПоказатьАрхивные", Массив);
	 ПоказатьАрхивные = Ложь;
	 
	 // Рощектаев Д.Е, ЭП-0024441, 30.01.2025 {
	 Элементы.Переместить(Элементы.ЭП_Создать,Элементы.Список.КоманднаяПанель,Элементы.Список.КоманднаяПанель.ПодчиненныеЭлементы[0]);
	 // Рощектаев Д.Е, ЭП-0024441, 30.01.2025 }
	 
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Настройки.Получить("Ответственный")<>Неопределено Тогда
		УстановитьОтборПоОтветственному(Список, Ответственный);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОтветственныйПриИзменении(Элемент)
	
	УстановитьОтборПоОтветственному(Список, Ответственный);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоОтветственному(Список, Ответственный)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Ответственный",
																			Ответственный,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(Ответственный));
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьАрхивныеНаСервере(Архивные) 
	
	Если Архивные = Истина Тогда      
		
		Массив = Новый Массив;
		Массив.Добавить(Перечисления.ЭП_СтатусПроекта.Архивный);
		Массив.Добавить(Перечисления.ЭП_СтатусПроекта.АрхивныйСПросмотром);
 
		
		Список.Параметры.УстановитьЗначениеПараметра("ПоказатьАрхивные", Массив);
		
	Иначе 
		
		Массив = Новый Массив; 
		Массив.Добавить(Перечисления.ЭП_СтатусПроекта.ПустаяСсылка());
		Массив.Добавить(Перечисления.ЭП_СтатусПроекта.Действующий);
		Список.Параметры.УстановитьЗначениеПараметра("ПоказатьАрхивные", Массив);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьАрхивные(Команда)
	Если НЕ ПоказатьАрхивные Тогда
		
		ПоказатьАрхивные = Истина;
		ПоказатьАрхивныеНаСервере(ПоказатьАрхивные);
		Элементы.СписокПоказатьАрхивные.Заголовок = "Показать не архивированные";
		
	Иначе
		
		ПоказатьАрхивные = Ложь;
		ПоказатьАрхивныеНаСервере(ПоказатьАрхивные);
	    Элементы.СписокПоказатьАрхивные.Заголовок = "Показать архивные";
		
	КонецЕсли;
	Элементы.СписокПоказатьАрхивные.Пометка = ПоказатьАрхивные;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭП_Создать(Команда)
	
	ОткрытьФорму("Обработка.ЭП_АРМПомощникСозданияПроекта.Форма.Форма"); 
	
КонецПроцедуры

#КонецОбласти