
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьУникальностьЗаписи();
	
КонецПроцедуры

Процедура ПроверитьУникальностьЗаписи()
	// Во избежание ошибок "Запись с такими ключевыми полями существует" удалить существующую запись
	
	Если Количество() <> 1 Тогда // только в случае одиночной записи
		Возврат;
	КонецЕсли;
	
	РегЗапись = РегистрыСведений.ЭП_ЗагруженностьСотрудников.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(РегЗапись,ЭтотОбъект[0]);
	РегЗапись.Прочитать();
	
	Если Не РегЗапись.Выбран() Тогда // такой записи нет
		Возврат;
	КонецЕсли;
	
	// Записать пустой набор в режиме загрузки (иначе зациклится)
	РегНабор = РегистрыСведений.ЭП_ЗагруженностьСотрудников.СоздатьНаборЗаписей();
	Для Каждого ЭлементОтбора Из Отбор Цикл
		РегНабор.Отбор[ЭлементОтбора.Имя].Установить(ЭлементОтбора.Значение);
	КонецЦикла;
	
	РегНабор.ОбменДанными.Загрузка = Истина;
	РегНабор.Записать();
	
КонецПроцедуры
