
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	
	Заявитель = ПользователиКлиентСервер.ТекущийПользователь();    
	СтатусЗаявки = Перечисления.ЭП_СтатусыЗаявок.Новая;
	НаборЗаписей= РегистрыСведений.ЭП_НастройкиАдресацииДляВыполненияЗаявок.СоздатьНаборЗаписей();     
	НаборЗаписей.Отбор.ТипУчастникаЗаявок.Установить(Перечисления.ЭП_ИсполнителиЗаявок.ГлавныйСистемныйАдминистратор);
	НаборЗаписей.Прочитать();
	Для Каждого Элемент Из НаборЗаписей Цикл 
		Контролирующий =  Элемент.Пользователь;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ТипЗаявкиПодкллючениеККонтуруПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)  
	
	//Результат = ?(ТипЗаявки = Перечисления.ЭП_ТипЗаявки.ПредоставлениеДоступаККонтуру, ИСТИНА, ЛОЖЬ);  
	Результат = Ложь;
КонецПроцедуры

Процедура ДоговорГПХПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)  
	
	Результат = Сотрудник.ДоговорГПХ;  
	
КонецПроцедуры

Процедура УдовлетворительноПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат) 
	
	Результат = Удовлетворительно;  
	
КонецПроцедуры

Процедура СогласиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)  
	
	Результат = СогласиеНаВыполнениеЗаявки; 
	
КонецПроцедуры

Процедура ВыполнениеЗаявкиПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭП_ЗадачиЗаявок.Ссылка КАК ЗадачаСсылка
	|ИЗ
	|	Задача.ЭП_ЗадачиЗаявок КАК ЭП_ЗадачиЗаявок
	|ГДЕ
	|	ЭП_ЗадачиЗаявок.БизнесПроцесс = &БизнесПроцесс
	|	И ЭП_ЗадачиЗаявок.Наименование = ""Выполнение Заявки"""; 
	Запрос.УстановитьПараметр("БизнесПроцесс", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда  
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗадачаСсылка = Выборка.ЗадачаСсылка;
		ЗадачаОб = ЗадачаСсылка.ПолучитьОбъект();
		ЗадачаОб.Выполнена = Ложь;
		ЗадачаОб.Записать();
		ФормируемыеЗадачи.Удалить(0);
		ФормируемыеЗадачи.Добавить(ЗадачаОб);
		СтатусЗаявки = Перечисления.ЭП_СтатусыЗаявок.ВРаботе;
		Исполнитель = ФормируемыеЗадачи[0].Исполнитель;
	Иначе
		СтатусЗаявки = Перечисления.ЭП_СтатусыЗаявок.ВОчереди;
		Исполнитель = ФормируемыеЗадачи[0].Отдел;
	КонецЕсли;
    Записать();
		
КонецПроцедуры

Процедура СогласованиеРППриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) 
	
	РуководительПроект =  Проект.Ответственный;
	Задача = ФормируемыеЗадачи[0];  
	Задача.Исполнитель = РуководительПроект;
	Задача.Записать();
	СтатусЗаявки = Перечисления.ЭП_СтатусыЗаявок.НаСогласовании;
	Исполнитель = РуководительПроект;
    Записать();
	
КонецПроцедуры

Процедура СогласованиеГДПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СтатусЗаявки = Перечисления.ЭП_СтатусыЗаявок.НаСогласовании; 
	Исполнитель = Перечисления.ЭП_ИсполнителиЗаявок.ОтветственныйЗаСогласованиеЗаявок;
    Записать();

КонецПроцедуры 

Процедура ОбратнаяСвязьПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭП_ЗадачиЗаявок.Ссылка КАК ЗадачаСсылка
	|ИЗ
	|	Задача.ЭП_ЗадачиЗаявок КАК ЭП_ЗадачиЗаявок
	|ГДЕ
	|	ЭП_ЗадачиЗаявок.БизнесПроцесс = &БизнесПроцесс
	|	И ЭП_ЗадачиЗаявок.Наименование = ""ОбратнаяСвязь"""; 
	Запрос.УстановитьПараметр("БизнесПроцесс", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда  
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗадачаСсылка = Выборка.ЗадачаСсылка;
		ЗадачаОб = ЗадачаСсылка.ПолучитьОбъект();
		ЗадачаОб.Выполнена = Ложь;
		ЗадачаОб.Записать();
		ФормируемыеЗадачи.Удалить(0);
		ФормируемыеЗадачи.Добавить(ЗадачаОб);
	КонецЕсли; 

КонецПроцедуры







