
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Подстатус") Тогда
		Запись.Подстатус = Параметры.Подстатус;
	КонецЕсли;         
	
	Если Параметры.Свойство("ТехПроект") Тогда
		Запись.ТехПроект = Параметры.ТехПроект;
	КонецЕсли;
	
	Запись.Пользователь = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.Подстатус) Тогда
		СтруктураЗакрытия = Новый Структура("Подстатус", Запись.Подстатус);
		Закрыть(СтруктураЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Запись.Период = ПолучитьТекущуюДатуСеанса();
КонецПроцедуры

Функция ПолучитьТекущуюДатуСеанса()
	
	Дата = ТекущаяДатаСеанса();
	Возврат Дата;
	
КонецФункции
