

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	МенеджерЗаписи = РегистрыСведений.ЭП_ВиртуальныеЭтапыПроектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Проект = Объект.Владелец;
	МенеджерЗаписи.КодБИ = Объект.ЭП_КодBI;
	МенеджерЗаписи.ДатаПо = Объект.ДатаОкончания;
	МенеджерЗаписи.ДатаС = Объект.ДатаНачала;
	МенеджерЗаписи.ВиртуальныйЭтап = Объект.Наименование;
	МенеджерЗаписи.ВиртуальныйЭтапСсылка = Объект.Ссылка;  
	МенеджерЗаписи.Записать(); 
КонецПроцедуры


