
&НаСервере
Процедура ВиртуальныйЭтапСсылкаПриИзмененииНаСервере()
	ОбъектРазделыПроекта = Запись.ВиртуальныйЭтапСсылка.ПолучитьОбъект();
	Запись.ВиртуальныйЭтап = ОбъектРазделыПроекта.Ссылка;
	Запись.ДатаПо = ОбъектРазделыПроекта.ДатаНачала; 
	Запись.ДатаС = ОбъектРазделыПроекта.ДатаОкончания;
	Запись.КодБИ = ОбъектРазделыПроекта.ЭП_КодBI;
КонецПроцедуры

&НаКлиенте
Процедура ВиртуальныйЭтапСсылкаПриИзменении(Элемент)
	ВиртуальныйЭтапСсылкаПриИзмененииНаСервере();
КонецПроцедуры

