

Процедура ПриЗаписи(Отказ)  
	
	ОтразитьДостижения();
	
КонецПроцедуры 

Процедура ОтразитьДостижения()	
	
	НаборЗаписей = РегистрыСведений.ЭП_СобытияСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Установить(Ссылка);
	НаборЗаписей.Прочитать();  
	
	//Для Каждого Запись из НаборЗаписей Цикл
	//	Если ТипЗнч(Запись.ВидСобытия) = Тип("СправочникСсылка.ЭП_ВидыДостиженийСотрудников") Тогда 
	//		НаборЗаписей.Удалить(Запись);
	//	КонецЕсли; 	
	//КонецЦикла;   
	
	КолЗап = НаборЗаписей.Количество(); 
	Для Счетчик = 1 По КолЗап Цикл
		
		Запись = НаборЗаписей[КолЗап - Счетчик];
		
		Если ТипЗнч(Запись.ВидСобытия) = Тип("СправочникСсылка.ЭП_ВидыДостиженийСотрудников") Тогда 
			НаборЗаписей.Удалить(Запись);
		КонецЕсли
		
	КонецЦикла;
	
	Для Каждого СтрокаТЧ из Достижения Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЧ.ДатаПлан)
			И Не ЗначениеЗаполнено(СтрокаТЧ.ДатаФакт) Тогда 
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ДатаСобытия = СтрокаТЧ.ДатаПлан;
			НоваяЗапись.Сотрудник = Ссылка;
			НоваяЗапись.ВидСобытия = СтрокаТЧ.ВидДостижения;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры



