#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.СформироватьПриОткрытии = Истина;
	Параметры.КлючВарианта = Параметры.Параметр;
	НачалоНедели = Параметры.НачалоНедели;
	КонецНедели = Параметры.КонецНедели;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)

	Если Параметры.КлючВарианта = "Основной" Тогда 
		
		ГруппаЭлементовОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
 		ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		НовыйЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ПолеОтбора = Новый ПолеКомпоновкиДанных("Дата");
		НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
		НовыйЭлементОтбора.Использование = Истина;
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		НовыйЭлементОтбора.ПравоеЗначение = НачалоНедели; 
	
		НовыйЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ПолеОтбора = Новый ПолеКомпоновкиДанных("Дата");
		НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
		НовыйЭлементОтбора.Использование = Истина;
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		НовыйЭлементОтбора.ПравоеЗначение = КонецНедели;
		
	ИначеЕсли Параметры.КлючВарианта = "НеделяНазад" Тогда
		
		ГруппаЭлементовОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
 		ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		НовыйЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ПолеОтбора = Новый ПолеКомпоновкиДанных("Дата");
		НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
		НовыйЭлементОтбора.Использование = Истина;
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		НовыйЭлементОтбора.ПравоеЗначение = НачалоНедели; 
	
		НовыйЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ПолеОтбора = Новый ПолеКомпоновкиДанных("Дата");
		НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
		НовыйЭлементОтбора.Использование = Истина;
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		НовыйЭлементОтбора.ПравоеЗначение = КонецНедели;	
		
	ИначеЕсли Параметры.КлючВарианта = "БольшеДвухНедельНазад" Тогда
	
		НовыйЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ПолеОтбора = Новый ПолеКомпоновкиДанных("Дата");
		НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
		НовыйЭлементОтбора.Использование = Истина;
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
		НовыйЭлементОтбора.ПравоеЗначение = НачалоНедели; 
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)  
	
	ОтчетыПереопределяемый.УстановитьМакетОформленияВРежимеТакси(ЭтотОбъект, Настройки);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СменаВарианта" Тогда
    	ЭтаФорма.Закрыть();
	КонецЕсли;   
	
КонецПроцедуры

#КонецОбласти 

