#Область ПерезаполнениеСтатусов
&НаСервере
Процедура ПерезаполнитьСтатусыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_СтатусыЗадач.Ссылка КАК Статус
		|ИЗ
		|	Справочник.ЭП_СтатусыЗадач КАК ЭП_СтатусыЗадач
		|ГДЕ
		|	ЭП_СтатусыЗадач.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	РезультатЗапроса = Запрос.Выполнить();
	Объект.Статусы.Очистить();
	Объект.Статусы.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьСтатусы(Команда)
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Вы уверены что хотите перезаписать заполненные данные?", Режим, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры)  Экспорт
	Если  Результат = КодВозвратаДиалога.Да Тогда
		ПерезаполнитьСтатусыНаСервере();
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыСтатусы

&НаКлиенте
Процедура СтатусыСтатусСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДополнительныеПараметры = Новый Структура("НеДобавлятьСтатусВНабор", Истина); 
	ДополнительныеПараметры.Вставить("Владелец", Объект.Владелец);  
	ДополнительныеПараметры.Вставить("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.ЭП_СтатусыЗадач.Форма.ФормаЭлемента", ДополнительныеПараметры, ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ПараметрыОтбора = Новый Структура("Статус", ВыбранноеЗначение); 
	 
	Если Объект.Статусы.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда 
		Элементы.Статусы.ТекущиеДанные.Статус = ВыбранноеЗначение; 
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выбранный элемент уже находится в таблице выбранных видов задач");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыСтатусНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;  
	ДополнительныеПараметры = Новый Структура("НеДобавлятьСтатусВНабор", Истина);
	ЗначениеОтбора = Новый Структура("Владелец", Объект.Владелец);
	ДополнительныеПараметры.Вставить("Отбор", ЗначениеОтбора);
	ДополнительныеПараметры.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.ЭП_СтатусыЗадач.Форма.ФормаВыбора", ДополнительныеПараметры, 
					ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыСтатусПриИзменении(Элемент)
	
	ПараметрыОтбора = Новый Структура("Статус", Элементы.Статусы.ТекущиеДанные.Статус); 
	 
	Если Объект.Статусы.НайтиСтроки(ПараметрыОтбора).Количество() <> 0 И Объект.Статусы.Количество() > 1 Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выбранный элемент уже находится в таблице выбранных статусов задач");	
		Элементы.Статусы.ТекущиеДанные.Статус = ПредопределенноеЗначение("Справочник.ЭП_СтатусыЗадач.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
