
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Ответственный.Ссылка.Пустая() ИЛИ НЕ ЗначениеЗаполнено(Ответственный) Тогда
        Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ЭтотОбъект.Проекты.Количество() = 0 и ПроектыСопровождения.Количество() = 0 Тогда 
		Отказ = Истина;
		Сообщить("Не указан ни один проект.");
		Возврат;
	КонецЕсли;
	
	// регистр ЭП_Поступление 
	Движения.ЭП_Поступление.Записывать = Истина;
	Для Каждого ТекСтрокаПроекты Из Проекты Цикл
		Движение = Движения.ЭП_Поступление.Добавить();
		Движение.Период = ДатаАкта;
		Движение.Проект = ТекСтрокаПроекты.Проект;
		Движение.Этап = ТекСтрокаПроекты.Этап;
		Движение.Сумма = ТекСтрокаПроекты.Сумма;
		Движение.Контрагент = Контрагент;
	КонецЦикла;

	// регистр ЭП_ПоступлениеПроектыСопровождения 
	Движения.ЭП_ПоступлениеПроектыСопровождения.Записывать = Истина;
	Для Каждого ТекСтрокаПроектыСопровождения Из ПроектыСопровождения Цикл
		Движение = Движения.ЭП_ПоступлениеПроектыСопровождения.Добавить();
		Движение.Период = ДатаАкта;
		Движение.ТехническийПроект = ТекСтрокаПроектыСопровождения.ТехническийПроект;
		Движение.Проект = ТекСтрокаПроектыСопровождения.Проект;
		Движение.Сумма = ТекСтрокаПроектыСопровождения.Сумма; 
		Движение.Контрагент = Контрагент;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Сумма = ЭтотОбъект.Проекты.Итог("Сумма") + ПроектыСопровождения.Итог("Сумма"); 
КонецПроцедуры
