#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если ЗначениеЗаполнено(Параметры.ОтборПоВиду) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Ссылка", Параметры.ОтборПоВиду); 
	Иначе 		
		ТекстЗапроса = "ВЫБРАТЬ
		|	СправочникЭП_ВидНоменлкатуры.Ссылка КАК Ссылка,
		|	СправочникЭП_ВидНоменлкатуры.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникЭП_ВидНоменлкатуры.Код КАК Код,
		|	СправочникЭП_ВидНоменлкатуры.Наименование КАК Наименование,
		|	СправочникЭП_ВидНоменлкатуры.Предопределенный КАК Предопределенный,
		|	СправочникЭП_ВидНоменлкатуры.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ЭП_ВидНоменлкатуры КАК СправочникЭП_ВидНоменлкатуры";
		
		СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		СвойстваСписка.ОсновнаяТаблица = "Справочник.ЭП_ВидНоменклатуры";
		СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
		СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
		ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список,
		СвойстваСписка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти