&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)	

	//ЗначенияРеквизитов = Новый Структура;
	//
	//ЗначенияРеквизитов.Вставить("БулевоПросрочено", БулевоПросрочено);
	//ЗначенияРеквизитов.Вставить("БулевоДнейДоЗавершения", БулевоДнейДоЗавершения);
	//ЗначенияРеквизитов.Вставить("ДнейДоЗавершения", ДнейДоЗавершения);

	//Закрыть(ЗначенияРеквизитов);

	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	БулевоПросрочено = ВладелецФормы.БулевоПросрочено; 
	
	БулевоДнейДоЗавершения = ВладелецФормы.БулевоДнейДоЗавершения;
	
	ДнейДоЗавершения = ВладелецФормы.ДнейДоЗавершения;
	
КонецПроцедуры   

&НаКлиенте
Процедура ОК(Команда)

	ЗначенияРеквизитов = Новый Структура;
	
	ЗначенияРеквизитов.Вставить("БулевоПросрочено", БулевоПросрочено);
	ЗначенияРеквизитов.Вставить("БулевоДнейДоЗавершения", БулевоДнейДоЗавершения);
	ЗначенияРеквизитов.Вставить("ДнейДоЗавершения", ДнейДоЗавершения);

    Закрыть(ЗначенияРеквизитов);

	
КонецПроцедуры


