Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Перем ДополнительныеПараметры;	
	Если Параметры.Свойство("ДополнительныеПараметры", ДополнительныеПараметры) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = РегистрыНакопления.ЭП_ОстаткиНаСкладе.ПолучитьДанныеВыбораИнвентарныйНомер(ДополнительныеПараметры.Склад, 
		ДополнительныеПараметры.Номенклатура, 
		ДополнительныеПараметры.ИнвентарныйНомер,
		ДополнительныеПараметры.РежимРаботы,
		ДополнительныеПараметры.Сотрудник,
		ДополнительныеПараметры.ВидНоменклатуры);
		
	КонецЕсли;
	
КонецПроцедуры