&НаКлиенте
Перем ПорядокСтраниц; 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьДеревоСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоСтраниц()
	
	ПорядокСтраниц = Новый Соответствие();  
	
	ПорядокСтраниц.Вставить(Элементы.СтраницаВидЗадачи,
		Новый Структура("Назад, Далее", Элементы.СтраницаВидЗадачи, Элементы.СтраницаНаборыСтатусов)); 
		
	ПорядокСтраниц.Вставить(Элементы.СтраницаНаборыСтатусов,
		Новый Структура("Назад, Далее", Элементы.СтраницаВидЗадачи, Элементы.СтраницаСтатусы)); 
		
	ПорядокСтраниц.Вставить(Элементы.СтраницаСтатусы,
		Новый Структура("Назад, Далее", Элементы.СтраницаНаборыСтатусов, Элементы.СтраницаТеги)); 
		
	ПорядокСтраниц.Вставить(Элементы.СтраницаТеги,
		Новый Структура("Назад, Далее", Элементы.СтраницаСтатусы, Элементы.СтраницаТеги));

КонецПроцедуры  
	
&НаКлиенте
Процедура СменитьСтраницу(Направление) 
	
	Структура = ПорядокСтраниц.Получить(Элементы.ГруппаСтраницы.ТекущаяСтраница); 
	
	Если Структура = Неопределено Тогда        
		Возврат;
	КонецЕсли;  
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница.Видимость = Ложь;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Структура[Направление];
	Элементы.ГруппаСтраницы.ТекущаяСтраница.Видимость = Истина;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВидЗадачи Тогда 
		
		Элементы.Назад.Видимость = Ложь;
		Элементы.Отмена.Видимость = Истина; 
		
	Иначе                                
		
		Элементы.Назад.Видимость = Истина;
		Элементы.Отмена.Видимость = Ложь; 
		
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТеги Тогда  
		
		Элементы.Далее.Видимость = Ложь;
		Элементы.Готово.Видимость = Истина; 
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура Готово(Команда) 
	
	Записать();
	Закрыть(); 
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	СменитьСтраницу("Далее");
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда) 
	
	СменитьСтраницу("Назад");
	
	Если Элементы.Готово.Видимость Тогда 
		
		Элементы.Далее.Видимость = Истина;
		Элементы.Готово.Видимость = Ложь;  
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();	
КонецПроцедуры
