#Область ОбработчикиСобытий

// Движения в регистр накопления ЭП_УчетПремий и ЭП_УчетПремийПоДокументам 
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЭП_УчетОтгулов.Записывать = Истина;
	
	Для Каждого ТекСтрокаКорректировка Из Корректировка Цикл
		
		Движение = Движения.ЭП_УчетОтгулов.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаКорректировка.Сотрудник;
		Движение.Длительность = ТекСтрокаКорректировка.Длительность;
		Движение.ВидДвижения = ?(ТекСтрокаКорректировка.ВидДвижения = Перечисления.ВидДвиженияРегистра.Приход,
			ВидДвиженияНакопления.Приход,
			ВидДвиженияНакопления.Расход);
			
	КонецЦикла;
	
	
КонецПроцедуры

// Устанавливает пользователя ответственным за документ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры 

#КонецОбласти