&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)		
	Отчет.Проект = ПараметрыСеанса.ТекущийПроект; 
	СтатусыТехПроекта.ДоступныеЗначения = ПолучитьСписокСтатусовТехПроекта();

	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь; 
	ТекущийСотрудник = ТекущийПользователь.ЭП_Сотрудник;
КонецПроцедуры

&НаКлиенте
Процедура ОткреплениеФиксацииСтатуса(Команда)
	ФлагСтатус = Ложь;
	СформироватьНаСервереДеревом(ФлагСтатус);
    Элементы.ФормаОткреплениеФиксацииСтатуса.Пометка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)    
	Если НЕ ПроверитьЗаполнение() Тогда
	
		Возврат;		
	
	КонецЕсли; 
	ФлагСтатус = Истина;
	СформироватьНаСервереДеревом(ФлагСтатус); 
	Элементы.Результат.ОтображениеСостояния.Видимость = ложь;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;  
	Элементы.ДеревоИтого.Видимость = ПереключательДеревоОтчет;
	Элементы.Результат.Видимость = НЕ ПереключательДеревоОтчет;
    
КонецПроцедуры

&НаСервере
Процедура СтатусПодстатусИЗаполнениеВЗапросе(Запрос,Массив,Параметр,ПараметрМассива)
	
	Если Массив.Количество() = 0 Тогда
		Запрос.УстановитьПараметр(Параметр, Истина);
	Иначе
		Запрос.УстановитьПараметр(Параметр, Ложь);
	КонецЕсли;
	Запрос.УстановитьПараметр(ПараметрМассива, Массив);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервереДеревом(ФлагСтатус) Экспорт	
	
	Результат.Очистить();
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет"); 
	
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаОтчета");
	ОбластьШАпкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы"); 
	ОбластьСтрокаТаблицыТехПроект = Макет.ПолучитьОбласть("СтрокаТаблицыТехПроект");
	ОбластьСтрокаТаблицыВерхнегоУровня = Макет.ПолучитьОбласть("СтрокаТаблицыЗадачаВерхнегоУровня");
	
	ОбластьШапка.Параметры.Заполнить(Отчет);
	Результат.Вывести(ОбластьШапка);
	
	Если НЕ ПереключательКод Тогда
		Запрос = Новый Запрос(ТекстЗапросаДанныхПоПроектуДерево_Код_Сппр());
	Иначе
		Запрос = Новый Запрос(ТекстЗапросаДанныхПоПроектуДерево_ВнутреннийКод());
		ВнутреннийКод = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Внутренний код");
		Запрос.УстановитьПараметр("ВнутреннийКод", ВнутреннийКод);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Проект", Отчет.Проект);
	Запрос.УстановитьПараметр("Этап", Отчет.Этап);
	Запрос.УстановитьПараметр("Направлено", Отчет.Направлено);
	Запрос.УстановитьПараметр("Исполнитель", Отчет.Исполнитель);
	Запрос.УстановитьПараметр("Очередность", Отчет.Очередность);
	Запрос.УстановитьПараметр("Раздел", Отчет.ТехПроект);
	Запрос.УстановитьПараметр("МассивТегов", Теги);
	Запрос.УстановитьПараметр("ТегиЗаполнены", Теги.Количество() <> 0);
	МассивВсехСтатусов = СтатусыТехПроекта;
	МассивСтатусов = Новый Массив;
	
	Для Каждого ЭлементМассива из МассивВсехСтатусов Цикл
		МассивСтатусов.Добавить(ЭлементМассива.Значение);
	КонецЦикла;
	
	СтатусПодстатусИЗаполнениеВЗапросе(Запрос, МассивСтатусов,"СтатусПроверка","СтатусТехПроекта");
	
	ОтборИсполнительЗадача = Ложь;
	Направлено = Ложь;
	Если ЗначениеЗаполнено(Отчет.Исполнитель) Тогда
		ОтборИсполнительЗадача = Истина;
	КонецЕсли;
	Запрос.УстановитьПараметр("ИсполнительПроверка", ОтборИсполнительЗадача);
	
	Если ЗначениеЗаполнено(Отчет.Направлено) Тогда
		Направлено = Истина;
	КонецЕсли;
	Запрос.УстановитьПараметр("ФлагНаправлено",Направлено);
	
	Запрос.УстановитьПараметр("ИсполнительПоТехПроекту", Отчет.ИсполнительПоТехПроекту);
		
	Запрос.УстановитьПараметр("Департамент",Константы.ЭП_ДепартаментРазработки.Получить());
	
	ДеревоРеестра = Новый ДеревоЗначений;
	ДеревоРеестра.Колонки.Добавить("КодСппр"); 
	ДеревоРеестра.Колонки.Добавить("Раздел");
    ДеревоРеестра.Колонки.Добавить("Этап");
	ДеревоРеестра.Колонки.Добавить("Наименование");
	ДеревоРеестра.Колонки.Добавить("Тег");
	ДеревоРеестра.Колонки.Добавить("Статус");
	ДеревоРеестра.Колонки.Добавить("ДатаИзмененияСтатуса");
	ДеревоРеестра.Колонки.Добавить("ДатаТехПроекта");
	ДеревоРеестра.Колонки.Добавить("Исполнитель");
	ДеревоРеестра.Колонки.Добавить("ПлановаяДатаНачала");
	ДеревоРеестра.Колонки.Добавить("ПлановаяДатаОкончания");   
	ДеревоРеестра.Колонки.Добавить("ФактическаяДатаНачалаРазработки");
	ДеревоРеестра.Колонки.Добавить("ФактическаяДатаОкончанияРазработки");
	ДеревоРеестра.Колонки.Добавить("Направлена");
	ДеревоРеестра.Колонки.Добавить("Контролирующий");
	ДеревоРеестра.Колонки.Добавить("Цели");
	ДеревоРеестра.Колонки.Добавить("Заметки");
	ДеревоРеестра.Колонки.Добавить("Проект");
	ДеревоРеестра.Колонки.Добавить("ЭтоТехПроект");
	ДеревоРеестра.Колонки.Добавить("ТехническийПроект");
	ДеревоРеестра.Колонки.Добавить("РодительЗадачи");
	ДеревоРеестра.Колонки.Добавить("Задача");
	ДеревоРеестра.Колонки.Добавить("Очередность");
	ДеревоРеестра.Колонки.Добавить("ФактическаяДатаНачалаАналитики");
	ДеревоРеестра.Колонки.Добавить("ФактическаяДатаОкончанияАналитики");  
	ДеревоРеестра.Колонки.Добавить("КонтролирующийРазработка");
	ДеревоРеестра.Колонки.Добавить("НаправленоРазработка");
	ДеревоРеестра.Колонки.Добавить("КонтролирующийАналитика");
	ДеревоРеестра.Колонки.Добавить("НаправленоАналитика");
	ДеревоРеестра.Колонки.Добавить("Подстатус");
	ДеревоРеестра.Колонки.Добавить("ДатаИзмененияПодстатуса");
	ДеревоРеестра.Колонки.Добавить("НаименованиеДляСорт");
	ДеревоРеестра.Колонки.Добавить("РодительЗадачи1"); 
	ДеревоРеестра.Колонки.Добавить("ФактическаяДатаНачала");
	ДеревоРеестра.Колонки.Добавить("ФактическаяДатаОкончания");
    ДеревоРеестра.Колонки.Добавить("ФактическаяДатаОкончанияМин");
	ДеревоРеестра.Колонки.Добавить("ЭтоЗадачаДепартаментаРазработки");
	ДеревоРеестра.Колонки.Добавить("ОбъектыМетаданных");	

	ТаблицаПромежутков = Новый ТаблицаЗначений;
	ТаблицаПромежутков.Колонки.Добавить("КодСппр"); 
	ТаблицаПромежутков.Колонки.Добавить("Раздел");
    ТаблицаПромежутков.Колонки.Добавить("Этап");
	ТаблицаПромежутков.Колонки.Добавить("Наименование");
	ТаблицаПромежутков.Колонки.Добавить("Версия");
	ТаблицаПромежутков.Колонки.Добавить("Статус");
	ТаблицаПромежутков.Колонки.Добавить("ДатаТехПроекта");
	ТаблицаПромежутков.Колонки.Добавить("Исполнитель");
	ТаблицаПромежутков.Колонки.Добавить("ПлановаяДатаНачала");
	ТаблицаПромежутков.Колонки.Добавить("ПлановаяДатаОкончания");   
	ТаблицаПромежутков.Колонки.Добавить("ФактическаяДатаНачала");
	ТаблицаПромежутков.Колонки.Добавить("ФактическаяДатаОкончания");
	ТаблицаПромежутков.Колонки.Добавить("Направлена");
	ТаблицаПромежутков.Колонки.Добавить("Контролирующий");
	ТаблицаПромежутков.Колонки.Добавить("Цели");
	ТаблицаПромежутков.Колонки.Добавить("Заметки");
	ТаблицаПромежутков.Колонки.Добавить("Проект"); 
	ТаблицаПромежутков.Колонки.Добавить("ДатаИзмененияСтатуса");
	ТаблицаПромежутков.Колонки.Добавить("ЭтоТехПроект");
	ТаблицаПромежутков.Колонки.Добавить("ТехническийПроект");
	ТаблицаПромежутков.Колонки.Добавить("РодительЗадачи");
	ТаблицаПромежутков.Колонки.Добавить("Задача");
	ТаблицаПромежутков.Колонки.Добавить("Очередность");
	ТаблицаПромежутков.Колонки.Добавить("ФактическаяДатаОкончанияМин");
	ТаблицаПромежутков.Колонки.Добавить("ЭтоЗадачаДепартаментаРазработки"); 
	ТаблицаПромежутков.Колонки.Добавить("ФактическаяДатаНачалаРазработки");
	ТаблицаПромежутков.Колонки.Добавить("ФактическаяДатаОкончанияРазработки");
	ТаблицаПромежутков.Колонки.Добавить("ФактическаяДатаНачалаАналитики");
	ТаблицаПромежутков.Колонки.Добавить("ФактическаяДатаОкончанияАналитики");
	ТаблицаПромежутков.Колонки.Добавить("КонтролирующийРазработка");
	ТаблицаПромежутков.Колонки.Добавить("НаправленоРазработка");
	ТаблицаПромежутков.Колонки.Добавить("КонтролирующийАналитика");
	ТаблицаПромежутков.Колонки.Добавить("НаправленоАналитика");
	ТаблицаПромежутков.Колонки.Добавить("Подстатус");
	ТаблицаПромежутков.Колонки.Добавить("ДатаИзмененияПодстатуса");
	ТаблицаПромежутков.Колонки.Добавить("НаименованиеДляСорт");
	ТаблицаПромежутков.Колонки.Добавить("РодительЗадачи1");
	
	Результат.Вывести(ОбластьШАпкаТаблицы);
	ПакетыЗапроса = Запрос.ВыполнитьПакет();
	ПакетыКоличество = ПакетыЗапроса.Количество();
	
	Выборка = ПакетыЗапроса[ПакетыКоличество-4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ТаблицаТеговОтбор = ПакетыЗапроса[ПакетыКоличество-3].Выгрузить();
	ТаблицаТегов = ПакетыЗапроса[ПакетыКоличество-2].Выгрузить();
	ОбъектыМетаданных = ПакетыЗапроса[ПакетыКоличество-1].Выгрузить();
	Пока Выборка.Следующий() Цикл
		СтрокиТеговОтбор = ТаблицаТеговОтбор.НайтиСтроки(Новый Структура("ТехническийПроект", Выборка.ТехническийПроект));
		Если СтрокиТеговОтбор.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
		Результат.НачатьАвтогруппировкуСтрок();
		ТегиПоТехПроекту = "";
		ТекЭлемент = ДеревоРеестра.Строки.Добавить();
		СтрокиТегов = ТаблицаТегов.НайтиСтроки(Новый Структура("ТехническийПроект", Выборка.ТехническийПроект));
		Для Каждого СтрокаТега Из СтрокиТегов Цикл
				
			Если ЗначениеЗаполнено(СтрокаТега.Тег) Тогда
				Если ТегиПоТехПроекту = "" Тогда
					ТегиПоТехПроекту = Строка(СтрокаТега.Тег);
				Иначе
					Если СтрНайти(ТегиПоТехПроекту, Строка(СтрокаТега.Тег)) = 0 Тогда
						ТегиПоТехПроекту = ТегиПоТехПроекту + "; " + Строка(СтрокаТега.Тег);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
				
		КонецЦикла;
		
		ТекЭлемент.Тег = ТегиПоТехПроекту;
		
		ОбъектыМетаданныхТехПроекта = "";
		СтрокиОбъектовМетаданных = ОбъектыМетаданных.НайтиСтроки(Новый Структура("ТехническийПроект", 
									Выборка.ТехническийПроект));
		Для каждого СтрокаОбъекта Из СтрокиОбъектовМетаданных Цикл														
			Если ЗначениеЗаполнено(СтрокаОбъекта.ОбъектМетаданных) Тогда
				ОбъектСтрокой = Строка(СтрокаОбъекта.ОбъектМетаданных);
				ФорматОбъект = СтрЗаменить(ОбъектСтрокой, ".", ": ");
				Если ОбъектыМетаданныхТехПроекта = "" Тогда	
					ОбъектыМетаданныхТехПроекта	= ФорматОбъект;
				Иначе
					ОбъектыМетаданныхТехПроекта = ОбъектыМетаданныхТехПроекта + "; "
												+ ФорматОбъект;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		
		ТекЭлемент.ОбъектыМетаданных = ОбъектыМетаданныхТехПроекта;
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		    Если ВыборкаДетальныеЗаписи.ЭтоТехПроект Тогда
				ЗаполнитьЗначенияСвойств(ТекЭлемент, ВыборкаДетальныеЗаписи);
				 
				ТекЭлемент.ФактическаяДатаНачалаРазработки = Выборка.ФактическаяДатаНачалаРазработки;
				ТекЭлемент.ФактическаяДатаОкончанияРазработки = Выборка.ФактическаяДатаОкончанияРазработки;
				ТекЭлемент.ФактическаяДатаНачалаАналитики = Выборка.ФактическаяДатаНачалаАналитики;
				ТекЭлемент.ФактическаяДатаОкончанияАналитики = Выборка.ФактическаяДатаОкончанияАналитики;
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РодительЗадачи) Тогда
				
				ТекЭлемент2 = ТекЭлемент.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(ТекЭлемент2, ВыборкаДетальныеЗаписи);
				
			Иначе
				
				ТекЭлемент3 = ПереборСтрокДерева(ТекЭлемент,ВыборкаДетальныеЗаписи.РодительЗадачи);
				
				Если НЕ ЗначениеЗаполнено(ТекЭлемент3) Тогда
					
					НовСтр = ТаблицаПромежутков.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи); 
					Продолжить;																	
				
				КонецЕсли;
				
				ТекЭлемент3 = ТекЭлемент3.Строки.Добавить();	
				
				ЗаполнитьЗначенияСвойств(ТекЭлемент3, ВыборкаДетальныеЗаписи);                                                               	
			КонецЕсли;	
		
		КонецЦикла;
		
		Если ТаблицаПромежутков.Количество() > 0 Тогда
			Для каждого ТекЭлементТаблицы Из ТаблицаПромежутков Цикл
				
				ТекЭлемент3 = ПереборСтрокДерева(ТекЭлемент,ТекЭлементТаблицы.РодительЗадачи);
				Если НЕ ЗначениеЗаполнено(ТекЭлемент3) Тогда
				
					Продолжить;					
				
				КонецЕсли;
				ТекЭлемент3 = ТекЭлемент3.Строки.Добавить();
					
				ЗаполнитьЗначенияСвойств(ТекЭлемент3, ТекЭлементТаблицы); 
				
			КонецЦикла;
		КонецЕсли;
			
		
	КонецЦикла;   

	
	Для каждого СтрокаДерева Из ДеревоРеестра.Строки Цикл
	
		Результат.НачатьАвтогруппировкуСтрок();
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТехПроект.Параметры, СтрокаДерева);
		
		Если СтрокаДерева.ФактическаяДатаНачалаРазработки = Дата(3099,1,1) Тогда
			ФактическаяДатаНачалаРазработки = "";
		Иначе	
			ФактическаяДатаНачалаРазработки = СтрокаДерева.ФактическаяДатаНачалаРазработки;
		КонецЕсли;
		
		Если СтрокаДерева.ФактическаяДатаНачалаАналитики = Дата(3099,1,1) Тогда
			ФактическаяДатаНачалаАналитики = "";
		Иначе	
			ФактическаяДатаНачалаАналитики = СтрокаДерева.ФактическаяДатаНачалаАналитики;
		КонецЕсли;
		
		ФактическаяДатаОкончанияРазработки = СтрокаДерева.ФактическаяДатаОкончанияРазработки;
		ФактическаяДатаОкончанияАналитики = СтрокаДерева.ФактическаяДатаОкончанияАналитики;
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТехПроект.Параметры, СтрокаДерева);
			
		ОбластьСтрокаТаблицыТехПроект.Параметры.ФактическаяДатаОкончанияРазработки = ФактическаяДатаОкончанияРазработки;
		ОбластьСтрокаТаблицыТехПроект.Параметры.ФактическаяДатаНачалаРазработки = ФактическаяДатаНачалаРазработки;
		
		ОбластьСтрокаТаблицыТехПроект.Параметры.ФактическаяДатаОкончанияАналитики = ФактическаяДатаОкончанияАналитики;
		ОбластьСтрокаТаблицыТехПроект.Параметры.ФактическаяДатаНачалаАналитики = ФактическаяДатаНачалаАналитики; 
		
		ОбластьСтрокаТаблицыТехПроект.Параметры.Контролирующий = "";
		ОбластьСтрокаТаблицыТехПроект.Параметры.Направлена = "";
		
		Если СтрокаДерева.Статус = Перечисления.СтатусыТехническихПроектов.Активен И ЗначениеЗаполнено(СтрокаДерева.Подстатус) Тогда
			ОбластьСтрокаТаблицыТехПроект.Параметры.Статус = СтрокаДерева.Подстатус;
			ОбластьСтрокаТаблицыТехПроект.Параметры.ДатаИзмененияСтатуса = СтрокаДерева.ДатаИзмененияПодстатуса;
		КонецЕсли;
		
		СтруктураРасшифровкиДатаИзмененияСтатуса = Новый Структура();
		СтруктураРасшифровкиДатаИзмененияСтатуса.Вставить("ЭтоРасшифровкаДатаИзмененияСтатуса",Истина);
		СтруктураРасшифровкиДатаИзмененияСтатуса.Вставить("СсылкаНаТехПроект",СтрокаДерева.ТехническийПроект);  				
		ОбластьСтрокаТаблицыТехПроект.Параметры.ДатаИзмененияСтатусаРасшифровка = СтруктураРасшифровкиДатаИзмененияСтатуса;
		
		НаправленоОбласть = Результат.Область(Результат.ВысотаТаблицы+1,17,Результат.ВысотаТаблицы+1,17);
		КонтролирующийОбласть = Результат.Область(Результат.ВысотаТаблицы+1,18,Результат.ВысотаТаблицы+1,18);
		
		Результат.Вывести(ОбластьСтрокаТаблицыТехПроект,СтрокаДерева.Уровень(),"Технические проекты",Истина);  
		ЦветСтатуса(СтрокаДерева);
		Результат.Область(Результат.ВысотаТаблицы,8,Результат.ВысотаТаблицы,8).ЦветТекста = WebЦвета.Черный;
		
		ПереборСтрокДляМакета(СтрокаДерева,
							  ФактическаяДатаОкончанияРазработки, 
							  ФактическаяДатаОкончанияАналитики, 
							  ФактическаяДатаНачалаАналитики, 
							  ФактическаяДатаНачалаРазработки,
							  ОбластьСтрокаТаблицыТехПроект,
							  ОбластьСтрокаТаблицыВерхнегоУровня,
							  ОбластьСтрокаТаблицы,
							  НаправленоОбласть,
							  КонтролирующийОбласть); 
							  
		Результат.ЗакончитьАвтогруппировкуСтрок();
		Результат.ПоказатьУровеньГруппировокСтрок(0);
		
	КонецЦикла;
	Результат.ФиксацияСверху = 5;
	Если ФлагСтатус = Истина Тогда
		Результат.ФиксацияСлева = 8;
	Иначе 
		Результат.ФиксацияСлева = 0;
	КонецЕсли;

	//ЗначениеВРеквизитФормы(ДеревоРеестра,"ДеревоИтого"); 		
	                                 
КонецПроцедуры

&НаСервере
Процедура ПереборСтрокДляМакета(СтрокаДерева, 
								ФактическаяДатаОкончанияРазработки, 
								ФактическаяДатаОкончанияАналитики, 
								ФактическаяДатаНачалаАналитики, 
								ФактическаяДатаНачалаРазработки,
								ОбластьСтрокаТаблицыТехПроект,
								ОбластьСтрокаТаблицыВерхнегоУровня,
								ОбластьСтрокаТаблицы,
								НаправленоОбласть,
								КонтролирующийОбласть)

    Для каждого СтрокаДереваНижнегоУровня Из СтрокаДерева.Строки Цикл
		
		
		
		
		Если СтрокаДереваНижнегоУровня.ЭтоТехПроект Тогда
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТехПроект.Параметры, СтрокаДереваНижнегоУровня);
			
			ОбластьСтрокаТаблицыТехПроект.Параметры.ФактическаяДатаОкончанияРазработки = ФактическаяДатаОкончанияРазработки;
			ОбластьСтрокаТаблицыТехПроект.Параметры.ФактическаяДатаНачалаРазработки = ФактическаяДатаНачалаРазработки;
			
			ОбластьСтрокаТаблицыТехПроект.Параметры.ФактическаяДатаОкончанияАналитики = ФактическаяДатаОкончанияАналитики;
			ОбластьСтрокаТаблицыТехПроект.Параметры.ФактическаяДатаНачалаАналитики = ФактическаяДатаНачалаАналитики; 
			
			ОбластьСтрокаТаблицыТехПроект.Параметры.Контролирующий = "";
			ОбластьСтрокаТаблицыТехПроект.Параметры.Направлена = "";
			
			Если СтрокаДереваНижнегоУровня.Статус = Перечисления.СтатусыТехническихПроектов.Активен И ЗначениеЗаполнено(СтрокаДереваНижнегоУровня.Подстатус) Тогда
				ОбластьСтрокаТаблицыТехПроект.Параметры.Статус = СтрокаДереваНижнегоУровня.Подстатус;
				ОбластьСтрокаТаблицыТехПроект.Параметры.ДатаИзмененияСтатуса = СтрокаДереваНижнегоУровня.ДатаИзмененияПодстатуса;
			КонецЕсли;
			
			СтруктураРасшифровкиДатаИзмененияСтатуса = Новый Структура();
			СтруктураРасшифровкиДатаИзмененияСтатуса.Вставить("ЭтоРасшифровкаДатаИзмененияСтатуса",Истина);
			СтруктураРасшифровкиДатаИзмененияСтатуса.Вставить("СсылкаНаТехПроект",СтрокаДереваНижнегоУровня.ТехническийПроект);  				
			ОбластьСтрокаТаблицыТехПроект.Параметры.ДатаИзмененияСтатусаРасшифровка = СтруктураРасшифровкиДатаИзмененияСтатуса;
			
			НаправленоОбласть = Результат.Область(Результат.ВысотаТаблицы+1,17,Результат.ВысотаТаблицы+1,17);
			КонтролирующийОбласть = Результат.Область(Результат.ВысотаТаблицы+1,18,Результат.ВысотаТаблицы+1,18);
			
			Результат.Вывести(ОбластьСтрокаТаблицыТехПроект,СтрокаДереваНижнегоУровня.Уровень(),"Технические проекты",Истина);  
			ЦветСтатуса(СтрокаДереваНижнегоУровня);
			Результат.Область(Результат.ВысотаТаблицы,8,Результат.ВысотаТаблицы,8).ЦветТекста = WebЦвета.Черный;
			Продолжить;
			
		КонецЕсли;
		ЕстьСтрокиНиже = СтрокаДереваНижнегоУровня.Строки.Количество() > 0;
		Если ЕстьСтрокиНиже Тогда
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыВерхнегоУровня.Параметры,СтрокаДереваНижнегоУровня);
			
			Если СтрокаДереваНижнегоУровня.ФактическаяДатаНачалаРазработки = Дата(3099,1,1) Тогда
				ОбластьСтрокаТаблицыВерхнегоУровня.Параметры.ФактическаяДатаНачалаРазработки = "";
			КонецЕсли;
			
			Если СтрокаДереваНижнегоУровня.ФактическаяДатаНачалаАналитики = Дата(3099,1,1) Тогда
				ОбластьСтрокаТаблицыВерхнегоУровня.Параметры.ФактическаяДатаНачалаАналитики = ""; 
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДереваНижнегоУровня.КонтролирующийАналитика) И ЗначениеЗаполнено(СтрокаДереваНижнегоУровня.НаправленоАналитика) Тогда
				НаправленоОбласть.Текст = Строка(СтрокаДереваНижнегоУровня.НаправленоАналитика);
				КонтролирующийОбласть.Текст = Строка(СтрокаДереваНижнегоУровня.КонтролирующийАналитика);
			КонецЕсли; 
			
			Если НаправленоОбласть.Текст = "" ИЛИ КонтролирующийОбласть.Текст = "" Тогда
				Если ЗначениеЗаполнено(СтрокаДереваНижнегоУровня.НаправленоРазработка) И ЗначениеЗаполнено(СтрокаДереваНижнегоУровня.КонтролирующийРазработка) Тогда
					НаправленоОбласть.Текст = Строка(СтрокаДереваНижнегоУровня.НаправленоРазработка);
					КонтролирующийОбласть.Текст = Строка(СтрокаДереваНижнегоУровня.КонтролирующийРазработка);	
				КонецЕсли;
			КонецЕсли;
			
			Если НаправленоОбласть.Текст = "" И КонтролирующийОбласть.Текст = "" Тогда
				Если ЗначениеЗаполнено(СтрокаДереваНижнегоУровня.НаправленоРазработка) ИЛИ ЗначениеЗаполнено(СтрокаДереваНижнегоУровня.КонтролирующийРазработка) Тогда
					НаправленоОбласть.Текст = Строка(СтрокаДереваНижнегоУровня.НаправленоРазработка);
					КонтролирующийОбласть.Текст = Строка(СтрокаДереваНижнегоУровня.КонтролирующийРазработка);	
				КонецЕсли;
			КонецЕсли;
			
			Результат.Вывести(ОбластьСтрокаТаблицыВерхнегоУровня,СтрокаДереваНижнегоУровня.Уровень(),"Задачи",Ложь);
			ЦветСтатуса(СтрокаДереваНижнегоУровня);  
		Иначе
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры,СтрокаДереваНижнегоУровня);
			
			Если СтрокаДереваНижнегоУровня.ФактическаяДатаНачалаРазработки = Дата(3099,1,1) Тогда
				ОбластьСтрокаТаблицы.Параметры.ФактическаяДатаНачалаРазработки = "";
			КонецЕсли;
			
			Если СтрокаДереваНижнегоУровня.ФактическаяДатаНачалаАналитики = Дата(3099,1,1) Тогда
				ОбластьСтрокаТаблицы.Параметры.ФактическаяДатаНачалаАналитики = "";
			КонецЕсли;  
			
			Если ЗначениеЗаполнено(СтрокаДереваНижнегоУровня.КонтролирующийАналитика) И ЗначениеЗаполнено(СтрокаДереваНижнегоУровня.НаправленоАналитика) Тогда
				НаправленоОбласть.Текст = Строка(СтрокаДереваНижнегоУровня.НаправленоАналитика);
				КонтролирующийОбласть.Текст = Строка(СтрокаДереваНижнегоУровня.КонтролирующийАналитика);
			КонецЕсли; 
			
			Если НаправленоОбласть.Текст = "" И КонтролирующийОбласть.Текст = "" Тогда
				Если ЗначениеЗаполнено(СтрокаДереваНижнегоУровня.НаправленоРазработка) И ЗначениеЗаполнено(СтрокаДереваНижнегоУровня.КонтролирующийРазработка) Тогда
					НаправленоОбласть.Текст = Строка(СтрокаДереваНижнегоУровня.НаправленоРазработка);
					КонтролирующийОбласть.Текст = Строка(СтрокаДереваНижнегоУровня.КонтролирующийРазработка);	
				КонецЕсли;
			КонецЕсли;
			
			Результат.Вывести(ОбластьСтрокаТаблицы,СтрокаДереваНижнегоУровня.Уровень(),"Подчиненные задачи",Ложь); 
			ЦветСтатуса(СтрокаДереваНижнегоУровня); 	
		КонецЕсли;
		Если ЕстьСтрокиНиже Тогда
		
			ПереборСтрокДляМакета(СтрокаДереваНижнегоУровня, 
								  ФактическаяДатаОкончанияРазработки, 
								  ФактическаяДатаОкончанияАналитики, 
								  ФактическаяДатаНачалаАналитики, 
								  ФактическаяДатаНачалаРазработки,
								  ОбластьСтрокаТаблицыТехПроект,
								  ОбластьСтрокаТаблицыВерхнегоУровня,
								  ОбластьСтрокаТаблицы,
								  НаправленоОбласть,
								  КонтролирующийОбласть);	
		
		КонецЕсли;
		
	КонецЦикла;
	

КонецПроцедуры

&НаСервере
Функция ПереборСтрокДерева(ТекЭлемент, Родитель)

	Для каждого СтрокаДерева Из ТекЭлемент.Строки Цикл
		
		Если СтрокаДерева.Задача = Родитель Тогда
			
			Возврат СтрокаДерева;	 
			
		КонецЕсли;					
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
		
			ИтогПеребораСтроки = ПереборСтрокДерева(СтрокаДерева, Родитель);			
			
			Если ЗначениеЗаполнено(ИтогПеребораСтроки) И ИтогПеребораСтроки.Задача = Родитель Тогда
			
				Возврат ИтогПеребораСтроки;
			
			КонецЕсли;
		
		КонецЕсли;
	КонецЦикла;	
    Возврат Неопределено;
КонецФункции

&НаСервере
Процедура ЦветСтатуса(СтрокаВыборки)
	
	Если ТипЗнч(СтрокаВыборки.Статус) = Тип("ПеречислениеСсылка.СтатусыТехническихПроектов") Тогда
	
		Запланирована = Перечисления.СтатусыТехническихПроектов.Запланирован;
		Выполняется = Перечисления.СтатусыТехническихПроектов.Активен;
		Завершена = Перечисления.СтатусыТехническихПроектов.Выполнен; 
		
	Иначе
		
		Запланирована = Перечисления.СтатусыЗадачПроцессов.Запланирована;
		Выполняется = Перечисления.СтатусыЗадачПроцессов.ПринятаКВыполнению;
		Завершена = Перечисления.СтатусыЗадачПроцессов.Выполнена;
	
	КонецЕсли;
	
	Если СтрокаВыборки.Статус = Запланирована Тогда
	
		Результат.Область(Результат.ВысотаТаблицы-1,8,Результат.ВысотаТаблицы-1,8).ЦветТекста = WebЦвета.Черный;	
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаВыборки.ПлановаяДатаОкончания) И НЕ СтрокаВыборки.Статус = Завершена Тогда
	
		Результат.Область(Результат.ВысотаТаблицы-1,8,Результат.ВысотаТаблицы-1,8).ЦветТекста = WebЦвета.Черный;		
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаВыборки.ПлановаяДатаНачала) И НЕ ЗначениеЗаполнено(СтрокаВыборки.ПлановаяДатаОкончания) Тогда
		
		Результат.Область(Результат.ВысотаТаблицы-1,8,Результат.ВысотаТаблицы-1,8).ЦветТекста = WebЦвета.Серый;
		Возврат;		
	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СтрокаВыборки.ПлановаяДатаНачала) И СтрокаВыборки.Статус = Запланирована Тогда
		
		Если СтрокаВыборки.ПлановаяДатаНачала < ТекущаяДатаСеанса() Тогда
		
			Результат.Область(Результат.ВысотаТаблицы-1,8,Результат.ВысотаТаблицы-1,8).ЦветТекста = WebЦвета.Красный;	
		    Возврат;
		КонецЕсли;
				
	КонецЕсли; 
	
	Если СтрокаВыборки.Статус = Выполняется Тогда
	
		Если ТекущаяДатаСеанса() <= СтрокаВыборки.ПлановаяДатаОкончания Тогда
		
			Результат.Область(Результат.ВысотаТаблицы-1,8,Результат.ВысотаТаблицы-1,8).ЦветТекста = WebЦвета.ТемноЗеленый;	
		    Возврат;
			
		Иначе
			
			Результат.Область(Результат.ВысотаТаблицы-1,8,Результат.ВысотаТаблицы-1,8).ЦветТекста = WebЦвета.Красный;
			Возврат;
			
		КонецЕсли;		
	
	КонецЕсли; 
	
	Если СтрокаВыборки.Статус = Завершена Тогда
		
		Если ЗначениеЗаполнено(СтрокаВыборки.ПлановаяДатаОкончания) И СтрокаВыборки.ПлановаяДатаОкончания < СтрокаВыборки.ФактическаяДатаОкончания Тогда
		
			Результат.Область(Результат.ВысотаТаблицы-1,8,Результат.ВысотаТаблицы-1,8).ЦветТекста = WebЦвета.Черный;			
		
		КонецЕсли;		
	
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаДанныхПоПроектуДерево_ВнутреннийКод()

	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ТехническиеПроекты.Ссылка КАК ТехническийПроект,
	        |	ТехническиеПроекты.Версия КАК Версия,
	        |	ТехническиеПроекты.Владелец КАК Проект,
	        |	ТехническиеПроекты.ЭП_ЗафиксированнаяДатаИзменения КАК ЭП_ЗафиксированнаяДатаИзменения,
	        |	ТехническиеПроекты.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ТехническиеПроекты.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
	        |	ТехническиеПроекты.Статус КАК Статус,
	        |	ТехническиеПроекты.РазделПроекта КАК ЭтапПроекта,
	        |	ТехническиеПроекты.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
	        |	ТехническиеПроекты.Наименование КАК Наименование,
	        |	ТехническиеПроекты.Ответственный КАК Ответственный,
	        |	ТехническиеПроекты.Заметки КАК Заметки,
	        |	ТехническиеПроекты.ЦелиПроекта КАК ЦелиПроекта,
	        |	ТехническиеПроекты.Родитель КАК Раздел,
	        |	ТехническиеПроекты.Очередность КАК Очередность,
	        |	NULL КАК Код
	        |ПОМЕСТИТЬ ВТ_ТехПроектыРазрешенные
	        |ИЗ
	        |	Справочник.ТехническиеПроекты КАК ТехническиеПроекты
	        |ГДЕ
	        |	ТехническиеПроекты.Владелец = &Проект
	        |	И НЕ ТехническиеПроекты.ПометкаУдаления
	        |	И НЕ ТехническиеПроекты.ЭтоГруппа
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВТ_ТехПроектыРазрешенные.ТехническийПроект КАК ТехническийПроект,
	        |	ЭП_ТегиПоТехническимПроектам.Тег КАК Тег,
	        |	ВТ_ТехПроектыРазрешенные.Проект КАК Проект
	        |ПОМЕСТИТЬ ВТ_ТегиПоТехПроектам
	        |ИЗ
	        |	ВТ_ТехПроектыРазрешенные КАК ВТ_ТехПроектыРазрешенные
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_ТегиПоТехническимПроектам КАК ЭП_ТегиПоТехническимПроектам
	        |		ПО ВТ_ТехПроектыРазрешенные.ТехническийПроект = ЭП_ТегиПоТехническимПроектам.ТехническийПроект
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТехПроектыРазрешенные.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ТехПроектыРазрешенные.Версия КАК Версия,
	        |	ВТ_ТехПроектыРазрешенные.Проект КАК Проект,
	        |	ВТ_ТехПроектыРазрешенные.ЭП_ЗафиксированнаяДатаИзменения КАК ЭП_ЗафиксированнаяДатаИзменения,
	        |	ВТ_ТехПроектыРазрешенные.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ВТ_ТехПроектыРазрешенные.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
	        |	ВТ_ТехПроектыРазрешенные.Статус КАК Статус,
	        |	ВТ_ТехПроектыРазрешенные.ЭтапПроекта КАК ЭтапПроекта,
	        |	ВТ_ТехПроектыРазрешенные.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
	        |	ВТ_ТехПроектыРазрешенные.Наименование КАК Наименование,
	        |	ВТ_ТехПроектыРазрешенные.Ответственный КАК Ответственный,
	        |	ВТ_ТехПроектыРазрешенные.Заметки КАК Заметки,
	        |	ВТ_ТехПроектыРазрешенные.ЦелиПроекта КАК ЦелиПроекта,
	        |	ВТ_ТехПроектыРазрешенные.Раздел КАК Раздел,
	        |	ВТ_ТехПроектыРазрешенные.Очередность КАК Очередность,
	        |	ЭП_ПодстатусыТехническихПроектовСрезПоследних.Период КАК ДатаИзмененияПодстатуса,
	        |	ВЫБОР
	        |		КОГДА ВТ_ТехПроектыРазрешенные.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыТехническихПроектов.Активен)
	        |			ТОГДА NULL
	        |		ИНАЧЕ ЭП_ПодстатусыТехническихПроектовСрезПоследних.Подстатус
	        |	КОНЕЦ КАК Подстатус
	        |ПОМЕСТИТЬ ВТ_ТехПроектыСПодстатусом
	        |ИЗ
	        |	ВТ_ТехПроектыРазрешенные КАК ВТ_ТехПроектыРазрешенные
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_ПодстатусыТехническихПроектов.СрезПоследних(
	        |				&Дата,
	        |				ТехПроект В
	        |					(ВЫБРАТЬ
	        |						ВТ_ТехПроектыРазрешенные.ТехническийПроект КАК ТехническийПроект
	        |					ИЗ
	        |						ВТ_ТехПроектыРазрешенные КАК ВТ_ТехПроектыРазрешенные)) КАК ЭП_ПодстатусыТехническихПроектовСрезПоследних
	        |		ПО ВТ_ТехПроектыРазрешенные.ТехническийПроект = ЭП_ПодстатусыТехническихПроектовСрезПоследних.ТехПроект
	        |ГДЕ
	        |	ВТ_ТехПроектыРазрешенные.ТехническийПроект В
	        |			(ВЫБРАТЬ
	        |				ВТ_ТегиПоТехПроектам.ТехническийПроект КАК ТехническийПроект
	        |			ИЗ
	        |				ВТ_ТегиПоТехПроектам КАК ВТ_ТегиПоТехПроектам)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТехПроектыСПодстатусом.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ТехПроектыСПодстатусом.Версия КАК Версия,
	        |	ВТ_ТехПроектыСПодстатусом.Проект КАК Проект,
	        |	ВТ_ТехПроектыСПодстатусом.ЭП_ЗафиксированнаяДатаИзменения КАК ЭП_ЗафиксированнаяДатаИзменения,
	        |	ВТ_ТехПроектыСПодстатусом.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ВТ_ТехПроектыСПодстатусом.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
	        |	ВТ_ТехПроектыСПодстатусом.Статус КАК Статус,
	        |	ВТ_ТехПроектыСПодстатусом.ЭтапПроекта КАК ЭтапПроекта,
	        |	ВТ_ТехПроектыСПодстатусом.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
	        |	ВТ_ТехПроектыСПодстатусом.Наименование КАК Наименование,
	        |	ВТ_ТехПроектыСПодстатусом.Ответственный КАК Ответственный,
	        |	ВТ_ТехПроектыСПодстатусом.Заметки КАК Заметки,
	        |	ВТ_ТехПроектыСПодстатусом.ЦелиПроекта КАК ЦелиПроекта,
	        |	ВТ_ТехПроектыСПодстатусом.Раздел КАК Раздел,
	        |	ВТ_ТехПроектыСПодстатусом.Очередность КАК Очередность,
	        |	ВТ_ТехПроектыСПодстатусом.ДатаИзмененияПодстатуса КАК ДатаИзмененияПодстатуса,
	        |	ВТ_ТехПроектыСПодстатусом.Подстатус КАК Подстатус
	        |ПОМЕСТИТЬ ВТ_ТехПроекты
	        |ИЗ
	        |	ВТ_ТехПроектыСПодстатусом КАК ВТ_ТехПроектыСПодстатусом
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &Очередность = 0
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_ТехПроектыСПодстатусом.Очередность = &Очередность
	        |		КОНЕЦ
	        |	И ВЫБОР
	        |			КОГДА &Этап = ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_ТехПроектыСПодстатусом.ЭтапПроекта = &Этап
	        |		КОНЕЦ
	        |	И ВЫБОР
	        |			КОГДА &ИсполнительПоТехПроекту = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_ТехПроектыСПодстатусом.Ответственный = &ИсполнительПоТехПроекту
	        |		КОНЕЦ
	        |	И ВЫБОР
	        |			КОГДА &СтатусПроверка
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_ТехПроектыСПодстатусом.Статус В (&СтатусТехПроекта)
	        |						И ВТ_ТехПроектыСПодстатусом.Подстатус ЕСТЬ NULL
	        |					ИЛИ ВТ_ТехПроектыСПодстатусом.Подстатус В (&СтатусТехПроекта)
	        |						И ВТ_ТехПроектыСПодстатусом.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыТехническихПроектов.Активен)
	        |		КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ЗадачиПроцесса.Ссылка КАК Ссылка,
	        |	ЗадачиПроцесса.Исполнитель КАК Исполнитель,
	        |	ЗадачиПроцесса.Контролирующий КАК Контролирующий,
	        |	ЗадачиПроцесса.ИсполнительПорученияПоЗадаче КАК Направлена,
	        |	ЗадачиПроцесса.Предмет КАК ТехническийПроект,
	        |	ЗадачиПроцесса.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ЗадачиПроцесса.ФактическаяДатаНачала КАК ФактическаяДатаНачала,
	        |	ЗадачиПроцесса.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
	        |	ЗадачиПроцесса.Код КАК Код,
	        |	ЗадачиПроцесса.Наименование КАК Наименование,
	        |	ЗадачиПроцесса.Статус КАК Статус,
	        |	ЗадачиПроцесса.Родитель КАК РодительЗадачи,
	        |	ЗадачиПроцесса.КрайняяДатаОкончания КАК КрайняяДатаОкончания,
	        |	ЗадачиПроцесса.Предмет.Версия КАК Версия,
	        |	ЗадачиПроцесса.Предмет.Владелец КАК Проект,
	        |	ЗадачиПроцесса.Предмет.РазделПроекта КАК ПредметРазделПроекта,
	        |	ЗадачиПроцесса.Предмет.Родитель КАК ПредметРодитель,
	        |	ЗадачиПроцесса.Предмет.Очередность КАК ПредметОчередность,
	        |	ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент = &Департамент КАК ЭтоЗадачаДепартаментаРазработки,
	        |	ВЫБОР
	        |		КОГДА ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент = &Департамент
	        |				И ЗадачиПроцесса.ФактическаяДатаНачала <> """"
	        |				И ЗадачиПроцесса.ФактическаяДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА ЗадачиПроцесса.ФактическаяДатаНачала
	        |		ИНАЧЕ ДАТАВРЕМЯ(3099, 1, 1)
	        |	КОНЕЦ КАК ФактическаяДатаНачалаРазработки,
	        |	ВЫБОР
	        |		КОГДА ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент = &Департамент
	        |			ТОГДА ЗадачиПроцесса.ФактическаяДатаОкончания
	        |		ИНАЧЕ """"
	        |	КОНЕЦ КАК ФактическаяДатаОкончанияРазработки,
	        |	ВЫБОР
	        |		КОГДА ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент <> &Департамент
	        |				И ЗадачиПроцесса.ФактическаяДатаНачала <> """"
	        |				И ЗадачиПроцесса.ФактическаяДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА ЗадачиПроцесса.ФактическаяДатаНачала
	        |		ИНАЧЕ ДАТАВРЕМЯ(3099, 1, 1)
	        |	КОНЕЦ КАК ФактическаяДатаНачалаАналитики,
	        |	ВЫБОР
	        |		КОГДА ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент <> &Департамент
	        |			ТОГДА ЗадачиПроцесса.ФактическаяДатаОкончания
	        |		ИНАЧЕ """"
	        |	КОНЕЦ КАК ФактическаяДатаОкончанияАналитики,
	        |	ВЫБОР
	        |		КОГДА (ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПринятаКВыполнению)
	        |				ИЛИ ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Запланирована))
	        |				И ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент = &Департамент
	        |			ТОГДА ЗадачиПроцесса.Контролирующий
	        |	КОНЕЦ КАК КонтролирующийРазработка,
	        |	ВЫБОР
	        |		КОГДА (ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПринятаКВыполнению)
	        |				ИЛИ ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Запланирована))
	        |				И ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент = &Департамент
	        |			ТОГДА ЗадачиПроцесса.ИсполнительПорученияПоЗадаче
	        |	КОНЕЦ КАК НаправленоРазработка,
	        |	ВЫБОР
	        |		КОГДА (ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПринятаКВыполнению)
	        |				ИЛИ ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Запланирована))
	        |				И ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент <> &Департамент
	        |			ТОГДА ЗадачиПроцесса.Контролирующий
	        |	КОНЕЦ КАК КонтролирующийАналитика,
	        |	ВЫБОР
	        |		КОГДА (ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПринятаКВыполнению)
	        |				ИЛИ ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Запланирована))
	        |				И ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент <> &Департамент
	        |			ТОГДА ЗадачиПроцесса.ИсполнительПорученияПоЗадаче
	        |	КОНЕЦ КАК НаправленоАналитика
	        |ПОМЕСТИТЬ ВТ_ЗадачиРазрешенные
	        |ИЗ
	        |	Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
	        |ГДЕ
	        |	ЗадачиПроцесса.Предмет ССЫЛКА Справочник.ТехническиеПроекты
	        |	И ЗадачиПроцесса.Предмет В
	        |			(ВЫБРАТЬ
	        |				ВТ_ТехПроекты.ТехническийПроект КАК Ссылка
	        |			ИЗ
	        |				ВТ_ТехПроекты КАК ВТ_ТехПроекты)
	        |	И НЕ ЗадачиПроцесса.ПометкаУдаления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЗадачиРазрешенные.Ссылка КАК Ссылка,
	        |	ВТ_ЗадачиРазрешенные.Исполнитель КАК Исполнитель,
	        |	ВТ_ЗадачиРазрешенные.Контролирующий КАК Контролирующий,
	        |	ВТ_ЗадачиРазрешенные.Направлена КАК Направлена,
	        |	ВТ_ЗадачиРазрешенные.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ЗадачиРазрешенные.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ВТ_ЗадачиРазрешенные.ФактическаяДатаНачала КАК ФактическаяДатаНачала,
	        |	ВТ_ЗадачиРазрешенные.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
	        |	ВТ_ЗадачиРазрешенные.Код КАК Код,
	        |	ВТ_ЗадачиРазрешенные.Наименование КАК Наименование,
	        |	ВТ_ЗадачиРазрешенные.Статус КАК Статус,
	        |	ВТ_ЗадачиРазрешенные.РодительЗадачи КАК РодительЗадачи,
	        |	ВТ_ЗадачиРазрешенные.КрайняяДатаОкончания КАК КрайняяДатаОкончания,
	        |	ВТ_ЗадачиРазрешенные.Версия КАК Версия,
	        |	ВТ_ЗадачиРазрешенные.Проект КАК Проект,
	        |	ВТ_ЗадачиРазрешенные.ПредметРазделПроекта КАК ПредметРазделПроекта,
	        |	ВТ_ЗадачиРазрешенные.ПредметРодитель КАК ПредметРодитель,
	        |	ВТ_ЗадачиРазрешенные.ПредметОчередность КАК ПредметОчередность,
	        |	ВТ_ЗадачиРазрешенные.ЭтоЗадачаДепартаментаРазработки КАК ЭтоЗадачаДепартаментаРазработки,
	        |	ВТ_ЗадачиРазрешенные.ФактическаяДатаНачалаРазработки КАК ФактическаяДатаНачалаРазработки,
	        |	ВТ_ЗадачиРазрешенные.ФактическаяДатаОкончанияРазработки КАК ФактическаяДатаОкончанияРазработки,
	        |	ВТ_ЗадачиРазрешенные.ФактическаяДатаНачалаАналитики КАК ФактическаяДатаНачалаАналитики,
	        |	ВТ_ЗадачиРазрешенные.ФактическаяДатаОкончанияАналитики КАК ФактическаяДатаОкончанияАналитики,
	        |	ВТ_ЗадачиРазрешенные.КонтролирующийРазработка КАК КонтролирующийРазработка,
	        |	ВТ_ЗадачиРазрешенные.НаправленоРазработка КАК НаправленоРазработка,
	        |	ВТ_ЗадачиРазрешенные.КонтролирующийАналитика КАК КонтролирующийАналитика,
	        |	ВТ_ЗадачиРазрешенные.НаправленоАналитика КАК НаправленоАналитика
	        |ПОМЕСТИТЬ ВТ_ДоступныеЗадачи
	        |ИЗ
	        |	ВТ_ЗадачиРазрешенные КАК ВТ_ЗадачиРазрешенные
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_ЗадачиРазрешенные.Исполнитель = &Исполнитель
	        |		КОНЕЦ
	        |	И ВЫБОР
	        |			КОГДА &Направлено = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_ЗадачиРазрешенные.Направлена = &Направлено
	        |		КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТехническиеПроектыДополнительныеРеквизиты.Значение КАК Значение,
	        |	ТехническиеПроектыДополнительныеРеквизиты.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ТаблицаКодов
	        |ИЗ
	        |	Справочник.ТехническиеПроекты.ДополнительныеРеквизиты КАК ТехническиеПроектыДополнительныеРеквизиты
	        |ГДЕ
	        |	ТехническиеПроектыДополнительныеРеквизиты.Свойство = &ВнутреннийКод
	        |	И ТехническиеПроектыДополнительныеРеквизиты.Ссылка В
	        |			(ВЫБРАТЬ
	        |				ВТ_ТехПроектыРазрешенные.ТехническийПроект
	        |			ИЗ
	        |				ВТ_ТехПроектыРазрешенные)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТехПроекты.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ТехПроекты.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ТаблицаКодов.Значение КАК Код,
	        |	ВТ_ТехПроекты.Ответственный КАК Исполнитель,
	        |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Контролирующий,
	        |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Направлена,
	        |	ДАТАВРЕМЯ(1, 1, 1) КАК ФактическаяДатаНачала,
	        |	ДАТАВРЕМЯ(1, 1, 1) КАК ФактическаяДатаОкончания,
	        |	ВТ_ТехПроекты.Версия КАК Версия,
	        |	ВТ_ТехПроекты.Проект КАК Проект,
	        |	ВТ_ТехПроекты.ЭП_ЗафиксированнаяДатаИзменения КАК ЭП_ЗафиксированнаяДатаИзменения,
	        |	ВТ_ТехПроекты.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
	        |	ВТ_ТехПроекты.Статус КАК Статус,
	        |	ВТ_ТехПроекты.ЭтапПроекта КАК ЭтапПроекта,
	        |	ВТ_ТехПроекты.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
	        |	ВТ_ТехПроекты.ТехническийПроект КАК Наименование,
	        |	ВТ_ТехПроекты.Заметки КАК Заметки,
	        |	ВТ_ТехПроекты.ЦелиПроекта КАК ЦелиПроекта,
	        |	ВТ_ТехПроекты.Раздел КАК Раздел,
	        |	ИСТИНА КАК ЭтоТехПроект,
	        |	ВТ_ТехПроекты.Очередность КАК Очередность,
	        |	NULL КАК РодительЗадачи,
	        |	NULL КАК Задача,
	        |	NULL КАК ЭтоЗадачаДепартаментаРазработки,
	        |	NULL КАК ФактическаяДатаНачалаРазработки,
	        |	NULL КАК ФактическаяДатаОкончанияРазработки,
	        |	NULL КАК ФактическаяДатаНачалаАналитики,
	        |	NULL КАК ФактическаяДатаОкончанияАналитики,
	        |	NULL КАК КонтролирующийРазработка,
	        |	NULL КАК НаправленоРазработка,
	        |	NULL КАК КонтролирующийАналитика,
	        |	NULL КАК НаправленоАналитика,
	        |	ВТ_ТехПроекты.Подстатус КАК Подстатус,
	        |	ВТ_ТехПроекты.ДатаИзмененияПодстатуса КАК ДатаИзмененияПодстатуса,
	        |	ВТ_ТехПроекты.Наименование КАК НаименованиеДляСорт
	        |ПОМЕСТИТЬ ВТ_ВсеТехПроектыСЗадачами
	        |ИЗ
	        |	ВТ_ТехПроекты КАК ВТ_ТехПроекты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКодов КАК ТаблицаКодов
	        |		ПО ВТ_ТехПроекты.ТехническийПроект = ТаблицаКодов.Ссылка
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ДоступныеЗадачи.ТехническийПроект,
	        |	ВТ_ДоступныеЗадачи.ПлановаяДатаНачала,
	        |	ВТ_ДоступныеЗадачи.Код,
	        |	ВТ_ДоступныеЗадачи.Исполнитель,
	        |	ВТ_ДоступныеЗадачи.Контролирующий,
	        |	ВТ_ДоступныеЗадачи.Направлена,
	        |	ВТ_ДоступныеЗадачи.ФактическаяДатаНачала,
	        |	ВТ_ДоступныеЗадачи.ФактическаяДатаОкончания,
	        |	ВТ_ДоступныеЗадачи.Версия,
	        |	ВТ_ДоступныеЗадачи.Проект,
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	ВТ_ДоступныеЗадачи.КрайняяДатаОкончания,
	        |	ВТ_ДоступныеЗадачи.Статус,
	        |	ВТ_ДоступныеЗадачи.ПредметРазделПроекта,
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	ВТ_ДоступныеЗадачи.Ссылка,
	        |	"""",
	        |	"""",
	        |	ВТ_ДоступныеЗадачи.ПредметРодитель,
	        |	ЛОЖЬ,
	        |	ВТ_ДоступныеЗадачи.ПредметОчередность,
	        |	ВТ_ДоступныеЗадачи.РодительЗадачи,
	        |	ВТ_ДоступныеЗадачи.Ссылка,
	        |	ВТ_ДоступныеЗадачи.ЭтоЗадачаДепартаментаРазработки,
	        |	ВТ_ДоступныеЗадачи.ФактическаяДатаНачалаРазработки,
	        |	ВТ_ДоступныеЗадачи.ФактическаяДатаОкончанияРазработки,
	        |	ВТ_ДоступныеЗадачи.ФактическаяДатаНачалаАналитики,
	        |	ВТ_ДоступныеЗадачи.ФактическаяДатаОкончанияАналитики,
	        |	ВТ_ДоступныеЗадачи.КонтролирующийРазработка,
	        |	ВТ_ДоступныеЗадачи.НаправленоРазработка,
	        |	ВТ_ДоступныеЗадачи.КонтролирующийАналитика,
	        |	ВТ_ДоступныеЗадачи.НаправленоАналитика,
	        |	NULL,
	        |	NULL,
	        |	NULL
	        |ИЗ
	        |	ВТ_ДоступныеЗадачи КАК ВТ_ДоступныеЗадачи
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ВсеТехПроектыСЗадачами.Код КАК КодСппр,
	        |	ВТ_ВсеТехПроектыСЗадачами.Раздел КАК Раздел,
	        |	ВТ_ВсеТехПроектыСЗадачами.ЭтапПроекта КАК Этап,
	        |	ВТ_ВсеТехПроектыСЗадачами.Наименование КАК Наименование,
	        |	ВТ_ВсеТехПроектыСЗадачами.Версия КАК Версия,
	        |	ВТ_ВсеТехПроектыСЗадачами.Статус КАК Статус,
	        |	ВТ_ВсеТехПроектыСЗадачами.ЭП_ЗафиксированнаяДатаИзменения КАК ДатаТехПроекта,
	        |	ВТ_ВсеТехПроектыСЗадачами.Исполнитель КАК Исполнитель,
	        |	ВТ_ВсеТехПроектыСЗадачами.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ВТ_ВсеТехПроектыСЗадачами.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
	        |	ВТ_ВсеТехПроектыСЗадачами.ФактическаяДатаНачала КАК ФактическаяДатаНачала,
	        |	ВТ_ВсеТехПроектыСЗадачами.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
	        |	ВТ_ВсеТехПроектыСЗадачами.Направлена КАК Направлена,
	        |	ВТ_ВсеТехПроектыСЗадачами.Контролирующий КАК Контролирующий,
	        |	ВТ_ВсеТехПроектыСЗадачами.ЦелиПроекта КАК Цели,
	        |	ВТ_ВсеТехПроектыСЗадачами.Заметки КАК Заметки,
	        |	ВТ_ВсеТехПроектыСЗадачами.Проект КАК Проект,
	        |	ВТ_ВсеТехПроектыСЗадачами.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
	        |	ВТ_ВсеТехПроектыСЗадачами.ЭтоТехПроект КАК ЭтоТехПроект,
	        |	ВТ_ВсеТехПроектыСЗадачами.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ВсеТехПроектыСЗадачами.РодительЗадачи КАК РодительЗадачи,
	        |	ВТ_ВсеТехПроектыСЗадачами.Задача КАК Задача,
	        |	ВТ_ВсеТехПроектыСЗадачами.Очередность КАК Очередность,
	        |	ВТ_ВсеТехПроектыСЗадачами.ЭтоЗадачаДепартаментаРазработки КАК ЭтоЗадачаДепартаментаРазработки,
	        |	ВТ_ВсеТехПроектыСЗадачами.ФактическаяДатаНачалаРазработки КАК ФактическаяДатаНачалаРазработки,
	        |	ВТ_ВсеТехПроектыСЗадачами.ФактическаяДатаОкончанияРазработки КАК ФактическаяДатаОкончанияРазработки,
	        |	ВТ_ВсеТехПроектыСЗадачами.ФактическаяДатаНачалаАналитики КАК ФактическаяДатаНачалаАналитики,
	        |	ВТ_ВсеТехПроектыСЗадачами.ФактическаяДатаОкончанияАналитики КАК ФактическаяДатаОкончанияАналитики,
	        |	ВТ_ВсеТехПроектыСЗадачами.КонтролирующийРазработка КАК КонтролирующийРазработка,
	        |	ВТ_ВсеТехПроектыСЗадачами.НаправленоРазработка КАК НаправленоРазработка,
	        |	ВТ_ВсеТехПроектыСЗадачами.КонтролирующийАналитика КАК КонтролирующийАналитика,
	        |	ВТ_ВсеТехПроектыСЗадачами.НаправленоАналитика КАК НаправленоАналитика,
	        |	ВТ_ВсеТехПроектыСЗадачами.Подстатус КАК Подстатус,
	        |	ВТ_ВсеТехПроектыСЗадачами.ДатаИзмененияПодстатуса КАК ДатаИзмененияПодстатуса,
	        |	ВТ_ВсеТехПроектыСЗадачами.НаименованиеДляСорт КАК НаименованиеДляСорт
	        |ПОМЕСТИТЬ ВТ_Иерархия
	        |ИЗ
	        |	ВТ_ВсеТехПроектыСЗадачами КАК ВТ_ВсеТехПроектыСЗадачами
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВТ_Иерархия.Задача КАК Задача
	        |ПОМЕСТИТЬ ВТ_РодительскиеЗадачи
	        |ИЗ
	        |	ВТ_Иерархия КАК ВТ_Иерархия
	        |ГДЕ
	        |	ВТ_Иерархия.Задача В
	        |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |				ВТ_Иерархия.РодительЗадачи КАК РодительЗадачи
	        |			ИЗ
	        |				ВТ_Иерархия КАК ВТ_Иерархия
	        |			ГДЕ
	        |				НЕ ВТ_Иерархия.РодительЗадачи = ЗНАЧЕНИЕ(Справочник.ЗадачиПроцесса.ПустаяСсылка)
	        |			СГРУППИРОВАТЬ ПО
	        |				ВТ_Иерархия.РодительЗадачи)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Иерархия.Задача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Иерархия.Раздел КАК Раздел,
	        |	ВТ_Иерархия.Этап КАК Этап,
	        |	ВТ_Иерархия.Наименование КАК Наименование,
	        |	ВТ_Иерархия.Версия КАК Версия,
	        |	ВТ_Иерархия.Статус КАК Статус,
	        |	ВТ_Иерархия.ДатаТехПроекта КАК ДатаТехПроекта,
	        |	ВТ_Иерархия.Исполнитель КАК Исполнитель,
	        |	ВТ_Иерархия.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ВТ_Иерархия.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
	        |	ВТ_Иерархия.ФактическаяДатаНачала КАК ФактическаяДатаНачала,
	        |	ВТ_Иерархия.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
	        |	ВТ_Иерархия.Направлена КАК Направлена,
	        |	ВТ_Иерархия.Контролирующий КАК Контролирующий,
	        |	ВТ_Иерархия.Цели КАК Цели,
	        |	ВТ_Иерархия.Заметки КАК Заметки,
	        |	ВТ_Иерархия.Проект КАК Проект,
	        |	ВТ_Иерархия.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
	        |	ВТ_Иерархия.ЭтоТехПроект КАК ЭтоТехПроект,
	        |	ВТ_Иерархия.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_Иерархия.РодительЗадачи КАК РодительЗадачи,
	        |	ВТ_Иерархия.Задача КАК Задача,
	        |	ВТ_Иерархия.Очередность КАК Очередность,
	        |	ВТ_Иерархия.ФактическаяДатаОкончания КАК ФактическаяДатаОкончанияМин,
	        |	ВТ_Иерархия.ЭтоЗадачаДепартаментаРазработки КАК ЭтоЗадачаДепартаментаРазработки,
	        |	ВТ_Иерархия.ФактическаяДатаНачалаРазработки КАК ФактическаяДатаНачалаРазработки,
	        |	ВТ_Иерархия.ФактическаяДатаОкончанияРазработки КАК ФактическаяДатаОкончанияРазработки,
	        |	ВТ_Иерархия.ФактическаяДатаНачалаАналитики КАК ФактическаяДатаНачалаАналитики,
	        |	ВТ_Иерархия.ФактическаяДатаОкончанияАналитики КАК ФактическаяДатаОкончанияАналитики,
	        |	ВТ_Иерархия.КонтролирующийРазработка КАК КонтролирующийРазработка,
	        |	ВТ_Иерархия.НаправленоРазработка КАК НаправленоРазработка,
	        |	ВТ_Иерархия.КонтролирующийАналитика КАК КонтролирующийАналитика,
	        |	ВТ_Иерархия.НаправленоАналитика КАК НаправленоАналитика,
	        |	ВТ_Иерархия.Подстатус КАК Подстатус,
	        |	ВТ_Иерархия.ДатаИзмененияПодстатуса КАК ДатаИзмененияПодстатуса,
	        |	ВТ_Иерархия.КодСппр КАК КодСппр,
	        |	ВТ_Иерархия.НаименованиеДляСорт КАК НаименованиеДляСорт,
	        |	ВЫБОР
	        |		КОГДА ВТ_Иерархия.РодительЗадачи = ЗНАЧЕНИЕ(Справочник.ЗадачиПроцесса.ПустаяСсылка)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК РодительскаяЗадача,
	        |	ВЫБОР
	        |		КОГДА ВТ_РодительскиеЗадачи.Задача ЕСТЬ NULL
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК Поле1
	        |ИЗ
	        |	ВТ_Иерархия КАК ВТ_Иерархия
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РодительскиеЗадачи КАК ВТ_РодительскиеЗадачи
	        |		ПО ВТ_Иерархия.Задача = ВТ_РодительскиеЗадачи.Задача
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ИсполнительПроверка
	        |				ТОГДА ВТ_Иерархия.ТехническийПроект В
	        |						(ВЫБРАТЬ
	        |							ВТ_ДоступныеЗадачи.ТехническийПроект
	        |						ИЗ
	        |							ВТ_ДоступныеЗадачи КАК ВТ_ДоступныеЗадачи
	        |						ГДЕ
	        |							ВТ_ДоступныеЗадачи.Исполнитель = &Исполнитель)
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
	        |	И ВЫБОР
	        |			КОГДА &ФлагНаправлено
	        |				ТОГДА ВТ_Иерархия.ТехническийПроект В
	        |						(ВЫБРАТЬ
	        |							ВТ_ДоступныеЗадачи.ТехническийПроект
	        |						ИЗ
	        |							ВТ_ДоступныеЗадачи КАК ВТ_ДоступныеЗадачи
	        |						ГДЕ
	        |							ВТ_ДоступныеЗадачи.Направлена = &Направлено)
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
	        |	И ВЫБОР
	        |			КОГДА &Раздел = ЗНАЧЕНИЕ(Справочник.ТехническиеПроекты.ПустаяСсылка)
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_Иерархия.Раздел В ИЕРАРХИИ (&Раздел)
	        |		КОНЕЦ
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ВТ_Иерархия.Раздел.Наименование,
	        |	ЭтоТехПроект УБЫВ,
	        |	НаименованиеДляСорт,
	        |	Очередность,
	        |	РодительЗадачи
	        |ИТОГИ
	        |	МИНИМУМ(ФактическаяДатаНачалаРазработки),
	        |	ВЫБОР
	        |		КОГДА МИНИМУМ(ФактическаяДатаОкончанияРазработки) = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА """"
	        |		ИНАЧЕ МАКСИМУМ(ФактическаяДатаОкончанияРазработки)
	        |	КОНЕЦ КАК ФактическаяДатаОкончанияРазработки,
	        |	МИНИМУМ(ФактическаяДатаНачалаАналитики),
	        |	ВЫБОР
	        |		КОГДА МИНИМУМ(ФактическаяДатаОкончанияАналитики) = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА """"
	        |		ИНАЧЕ МАКСИМУМ(ФактическаяДатаОкончанияАналитики)
	        |	КОНЕЦ КАК ФактическаяДатаОкончанияАналитики
	        |ПО
	        |	ТехническийПроект
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВТ_Иерархия.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ТегиПоТехПроектам.Тег КАК Тег
	        |ИЗ
	        |	ВТ_Иерархия КАК ВТ_Иерархия
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТегиПоТехПроектам КАК ВТ_ТегиПоТехПроектам
	        |		ПО ВТ_Иерархия.ТехническийПроект = ВТ_ТегиПоТехПроектам.ТехническийПроект
	        |			И ВТ_Иерархия.Проект = ВТ_ТегиПоТехПроектам.Проект
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ТегиЗаполнены
	        |				ТОГДА ВТ_ТегиПоТехПроектам.Тег В (&МассивТегов)
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТегиПоТехПроектам.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ТегиПоТехПроектам.Тег КАК Тег
	        |ИЗ
	        |	ВТ_ТегиПоТехПроектам КАК ВТ_ТегиПоТехПроектам";		
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если Элемент.ТекущаяОбласть.Право = 6 Тогда
		Возврат;	
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") И Расшифровка.ЭтоРасшифровкаДатаИзмененияСтатуса Тогда
	 
		ПараметрыФормы = Новый Структура("ТехПроект", Расшифровка.СсылкаНаТехПроект);
		ОткрытьФорму("Отчет.ЭП_СводныйРеестрРазработки.Форма.ФормаПодстатусов",ПараметрыФормы);		
		Возврат;
		
	КонецЕсли; 	
	
	Расшифровка = Элемент.ТекущаяОбласть.Расшифровка;
	
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.ТехническиеПроекты") Тогда             
		
		Если Не ПроверкаНаКлючевогоСотрудника() И Не ПроверкаПользователяПоТехПроекту(Расшифровка)И НЕ ПроверкаНаПолныеПрава() Тогда
			ПоказатьПредупреждение(,"У вас нет прав для изменения статуса у технического проекта!!!",,"Ошибка");
			Возврат;
		КонецЕсли;
		
		ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ПослеВыбораСтатусаТехПроекта",ЭтотОбъект,Расшифровка),ПолучитьСписокСтатусовТехПроекта());
	Иначе
		
		Если  Не ПроверкаНаКлючевогоСотрудника() И Не ПроверкаПользователяПоЗадаче(Расшифровка,ТекущийПользователь) И НЕ ПроверкаНаПолныеПрава() Тогда
			ПоказатьПредупреждение(,"У вас нет прав для изменения статуса у задач!!!",,"Ошибка");
			Возврат;
		КонецЕсли;
	
		ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ПослеВыбораСтатусаЗадачи",ЭтотОбъект,Расшифровка), ПолучитьСписокСтатусовЗадач());
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокСтатусовТехПроекта()
	
	СписокЗначений = Новый СписокЗначений();
	СписокЗначений.Добавить(Перечисления.СтатусыТехническихПроектов.Отменен);
	
	ИндексСтатусов = 0;
	
	Пока ИндексСтатусов < 3 Цикл
		СписокЗначений.Добавить(Перечисления.СтатусыТехническихПроектов.Получить(ИндексСтатусов));
		ИндексСтатусов = ИндексСтатусов + 1;
	КонецЦикла;
	       	
	ИндексПодстатусов = 0;
	Пока ИндексПодстатусов < Перечисления.ЭП_Подстатусы.Количество() Цикл
		СписокЗначений.Добавить(Перечисления.ЭП_Подстатусы.Получить(ИндексПодстатусов));
		ИндексПодстатусов = ИндексПодстатусов + 1;	
	КонецЦикла;
	
	СписокЗначений.Добавить(Перечисления.СтатусыТехническихПроектов.Выполнен);

	Возврат СписокЗначений;

КонецФункции

&НаСервере                                     
Функция ПолучитьСписокСтатусовЗадач()
	
	СписокЗначений = Новый СписокЗначений();
	
	Индекс = 0;
	Пока Индекс < Перечисления.СтатусыЗадачПроцессов.Количество() Цикл
		СписокЗначений.Добавить(Перечисления.СтатусыЗадачПроцессов.Получить(Индекс));
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Возврат СписокЗначений;
КонецФункции

&НаКлиенте
Процедура ПослеВыбораСтатусаТехПроекта(ВыбранныйСтатус, ДопПараметры) Экспорт 
		
	Если ВыбранныйСтатус = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВыбранныйСтатус = ВыбранныйСтатус.Значение;
	Если  ТипЗнч(ВыбранныйСтатус) = Тип("ПеречислениеСсылка.СтатусыТехническихПроектов") Тогда		
		ПоменятьСтатусТехПроекта(ВыбранныйСтатус,ДопПараметры);	
	ИначеЕсли ТипЗнч(ВыбранныйСтатус) = Тип("ПеречислениеСсылка.ЭП_Подстатусы") Тогда    		
		ПоменятьПодстатусы(ВыбранныйСтатус,ДопПараметры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСтатусаЗадачи(ВыбранныйСтатус, ДопПараметры) Экспорт 
	
	Если ВыбранныйСтатус = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоменятьСтатусЗадачи(ВыбранныйСтатус.Значение,ДопПараметры);	
КонецПроцедуры

&НаСервере
Процедура ПоменятьСтатусТехПроекта(Статус,ТехПроектСсылка)
	
	Объект = ТехПроектСсылка.ПолучитьОбъект();
	Объект.Статус = Статус;
	Объект.Записать();
	СформироватьНаСервереДеревом(Истина);

КонецПроцедуры

&НаСервере
Процедура ПоменятьСтатусЗадачи(Статус, ЗадачаСсылка)
	//Ссылка = Справочники.ЗадачиПроцесса.НайтиПоНаименованию(ЗадачаСсылка.Наименование);
	
	Объект = ЗадачаСсылка.ПолучитьОбъект();
	Объект.Статус = Статус;
	Объект.Записать();
	
	СформироватьНаСервереДеревом(Истина);

КонецПроцедуры

&НаСервере
Процедура ПоменятьПодстатусы(Статус,ТехПроектСсылка)
	
	Если Статус = Перечисления.ЭП_Подстатусы.НаписаниеПостановки 
		ИЛИ Статус = Перечисления.ЭП_Подстатусы.ДоработкаПостановки 
		ИЛИ Статус = Перечисления.ЭП_Подстатусы.ВРазработке 
		ИЛИ Статус = Перечисления.ЭП_Подстатусы.ДоработкаПоЗамечаниям
		ИЛИ Статус = Перечисления.ЭП_Подстатусы.ВТестировании
		ИЛИ Статус = Перечисления.ЭП_Подстатусы.ПринятоПостановщиком
		ИЛИ Статус = Перечисления.ЭП_Подстатусы.ПринятоФЗ 
		Тогда 
		
		Ссылка = Справочники.ТехническиеПроекты.НайтиПоНаименованию(ТехПроектСсылка.Наименование);
		Объект = Ссылка.ПолучитьОбъект();	
		
		Если Объект.Статус <> Перечисления.СтатусыТехническихПроектов.Активен Тогда
			Объект.Статус = Перечисления.СтатусыТехническихПроектов.Активен;
			Объект.Записать();	
		КонецЕсли; 
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_ПодстатусыТехническихПроектовСрезПоследних.Подстатус КАК Подстатус
		|ИЗ
		|	РегистрСведений.ЭП_ПодстатусыТехническихПроектов.СрезПоследних(&Дата, ТехПроект = &ТехПроект) КАК ЭП_ПодстатусыТехническихПроектовСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Запрос.УстановитьПараметр("ТехПроект", ТехПроектСсылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда 
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Выборка.Следующий();
			
			ПоследнийПодстатус = Выборка.Подстатус;
			
			Если ПоследнийПодстатус = Статус Тогда 				
				
				Возврат;
				
			Иначе 
				
				МенеджерЗаписи = РегистрыСведений.ЭП_ПодстатусыТехническихПроектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период 		= ТекущаяДата();
				МенеджерЗаписи.ТехПроект 	= ТехПроектСсылка;
				МенеджерЗаписи.Подстатус 	= Статус;
				МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
				МенеджерЗаписи.Записать();  
				
			КонецЕсли;	
			
		КонецЕсли;  	
		
	СформироватьНаСервереДеревом(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеВОтбореСтатуса(Команда)                                  
	СтатусыТехПроекта = ПолучитьСписокСтатусовТехПроекта();
КонецПроцедуры

&НаСервере
Функция ПроверкаПользователяПоЗадаче(ЗадачаСсылка,ТекущийПользователь)
	Ссылка = Справочники.ЗадачиПроцесса.НайтиПоНаименованию(ЗадачаСсылка.Наименование);
	Объект = Ссылка.ПолучитьОбъект();
	
	Если Объект.Исполнитель = ТекущийПользователь Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

&НаСервере
Функция ПроверкаНаПолныеПрава()
	
	Возврат Пользователи.ЭтоПолноправныйПользователь();

КонецФункции

&НаСервере
Функция ПроверкаПользователяПоТехПроекту(ТехПроектСсылка)
	
	Объект = ТехПроектСсылка.ПолучитьОбъект();
	
	ПредыдущийПодстатус = ПолучитьПодстатус(ТехПроектСсылка);
	
	ПодстатусыДоступныеРазработчикам = Новый Массив;
	ПодстатусыДоступныеРазработчикам.Добавить(Перечисления.ЭП_Подстатусы.ВРазработке);
	ПодстатусыДоступныеРазработчикам.Добавить(Перечисления.ЭП_Подстатусы.ВТестировании);
	ПодстатусыДоступныеРазработчикам.Добавить(Перечисления.ЭП_Подстатусы.ДоработкаПоЗамечаниям);
	ПодстатусыДоступныеРазработчикам.Добавить(Перечисления.ЭП_Подстатусы.ДоработкаПостановки);
	
	Если СтатусыТехПроекта.ДоступныеЗначения = Неопределено Тогда 
		СтатусыТехПроекта.ДоступныеЗначения = ПолучитьСписокСтатусовТехПроекта();	
	КонецЕсли;
	
	МассивСтатусовДляАналитиков = Новый Массив;
	Для Каждого ЭлементСЗ Из СтатусыТехПроекта.ДоступныеЗначения Цикл
		Если ЭлементСЗ.Значение = Перечисления.ЭП_Подстатусы.ВРазработке ИЛИ ЭлементСЗ.Значение = Перечисления.ЭП_Подстатусы.ДоработкаПоЗамечаниям Тогда
			Продолжить;	
		КонецЕсли;    
		МассивСтатусовДляАналитиков.Добавить(ЭлементСЗ.Значение);
	КонецЦикла;
	
	Если Объект.Ответственный = ТекущийПользователь Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТекущийСотрудник.Департамент = Константы.ЭП_ДепартаментРазработки.Получить() И ПодстатусыДоступныеРазработчикам.Найти(ПредыдущийПодстатус) <> Неопределено И Объект.Статус = Перечисления.СтатусыТехническихПроектов.Активен Тогда
		Возврат Истина;		
	КонецЕсли;
	
	Если ТекущийСотрудник.Департамент <> Константы.ЭП_ДепартаментРазработки.Получить() 
		И ((ПредыдущийПодстатус <> Перечисления.ЭП_Подстатусы.ВРазработке И ПредыдущийПодстатус <> Перечисления.ЭП_Подстатусы.ДоработкаПоЗамечаниям) Или(Объект.Статус <> Перечисления.СтатусыТехническихПроектов.Активен) ) Тогда
		Возврат Истина;		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПолучитьПодстатус(ТехПроектСсылка)
	Запрос = Новый Запрос(ТекстЗапросаПолучитьПодстатус());
	Запрос.УстановитьПараметр("Ссылка",ТехПроектСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Подстатус;
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаДанныхПоПроектуДерево_Код_Сппр()

	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ТехническиеПроекты.Ссылка КАК ТехническийПроект,
	        |	ТехническиеПроекты.Версия КАК Версия,
	        |	ТехническиеПроекты.Владелец КАК Проект,
	        |	ТехническиеПроекты.ЭП_ЗафиксированнаяДатаИзменения КАК ЭП_ЗафиксированнаяДатаИзменения,
	        |	ТехническиеПроекты.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ТехническиеПроекты.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
	        |	ТехническиеПроекты.Статус КАК Статус,
	        |	ТехническиеПроекты.РазделПроекта КАК ЭтапПроекта,
	        |	ТехническиеПроекты.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
	        |	ТехническиеПроекты.Наименование КАК Наименование,
	        |	ТехническиеПроекты.Ответственный КАК Ответственный,
	        |	ТехническиеПроекты.Заметки КАК Заметки,
	        |	ТехническиеПроекты.ЦелиПроекта КАК ЦелиПроекта,
	        |	ТехническиеПроекты.Родитель КАК Раздел,
	        |	ТехническиеПроекты.Очередность КАК Очередность,
	        |	ТехническиеПроекты.Код КАК Код
	        |ПОМЕСТИТЬ ВТ_ТехПроектыРазрешенные
	        |ИЗ
	        |	Справочник.ТехническиеПроекты КАК ТехническиеПроекты
	        |ГДЕ
	        |	ТехническиеПроекты.Владелец = &Проект
	        |	И НЕ ТехническиеПроекты.ПометкаУдаления
	        |	И НЕ ТехническиеПроекты.ЭтоГруппа
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВТ_ТехПроектыРазрешенные.ТехническийПроект КАК ТехническийПроект,
	        |	ЭП_ТегиПоТехническимПроектам.Тег КАК Тег,
	        |	ВТ_ТехПроектыРазрешенные.Проект КАК Проект
	        |ПОМЕСТИТЬ ВТ_ТегиПоТехПроектам
	        |ИЗ
	        |	ВТ_ТехПроектыРазрешенные КАК ВТ_ТехПроектыРазрешенные
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_ТегиПоТехническимПроектам КАК ЭП_ТегиПоТехническимПроектам
	        |		ПО ВТ_ТехПроектыРазрешенные.ТехническийПроект = ЭП_ТегиПоТехническимПроектам.ТехническийПроект
	        |			И ВТ_ТехПроектыРазрешенные.Проект = ЭП_ТегиПоТехническимПроектам.Проект
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТехПроектыРазрешенные.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ТехПроектыРазрешенные.Версия КАК Версия,
	        |	ВТ_ТехПроектыРазрешенные.Проект КАК Проект,
	        |	ВТ_ТехПроектыРазрешенные.ЭП_ЗафиксированнаяДатаИзменения КАК ЭП_ЗафиксированнаяДатаИзменения,
	        |	ВТ_ТехПроектыРазрешенные.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ВТ_ТехПроектыРазрешенные.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
	        |	ВТ_ТехПроектыРазрешенные.Статус КАК Статус,
	        |	ВТ_ТехПроектыРазрешенные.ЭтапПроекта КАК ЭтапПроекта,
	        |	ВТ_ТехПроектыРазрешенные.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
	        |	ВТ_ТехПроектыРазрешенные.Наименование КАК Наименование,
	        |	ВТ_ТехПроектыРазрешенные.Ответственный КАК Ответственный,
	        |	ВТ_ТехПроектыРазрешенные.Заметки КАК Заметки,
	        |	ВТ_ТехПроектыРазрешенные.ЦелиПроекта КАК ЦелиПроекта,
	        |	ВТ_ТехПроектыРазрешенные.Раздел КАК Раздел,
	        |	ВТ_ТехПроектыРазрешенные.Очередность КАК Очередность,
	        |	ВТ_ТехПроектыРазрешенные.Код КАК Код,
	        |	ЭП_ПодстатусыТехническихПроектовСрезПоследних.Период КАК ДатаИзмененияПодстатуса,
	        |	ВЫБОР
	        |		КОГДА ВТ_ТехПроектыРазрешенные.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыТехническихПроектов.Активен)
	        |			ТОГДА NULL
	        |		ИНАЧЕ ЭП_ПодстатусыТехническихПроектовСрезПоследних.Подстатус
	        |	КОНЕЦ КАК Подстатус
	        |ПОМЕСТИТЬ ВТ_ТехПроектыСПодстатусом
	        |ИЗ
	        |	ВТ_ТехПроектыРазрешенные КАК ВТ_ТехПроектыРазрешенные
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_ПодстатусыТехническихПроектов.СрезПоследних(
	        |				&Дата,
	        |				ТехПроект В
	        |					(ВЫБРАТЬ
	        |						ВТ_ТехПроектыРазрешенные.ТехническийПроект КАК ТехническийПроект
	        |					ИЗ
	        |						ВТ_ТехПроектыРазрешенные КАК ВТ_ТехПроектыРазрешенные)) КАК ЭП_ПодстатусыТехническихПроектовСрезПоследних
	        |		ПО ВТ_ТехПроектыРазрешенные.ТехническийПроект = ЭП_ПодстатусыТехническихПроектовСрезПоследних.ТехПроект
	        |ГДЕ
	        |	ВТ_ТехПроектыРазрешенные.ТехническийПроект В
	        |			(ВЫБРАТЬ
	        |				ВТ_ТегиПоТехПроектам.ТехническийПроект КАК ТехническийПроект
	        |			ИЗ
	        |				ВТ_ТегиПоТехПроектам КАК ВТ_ТегиПоТехПроектам)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТехПроектыСПодстатусом.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ТехПроектыСПодстатусом.Версия КАК Версия,
	        |	ВТ_ТехПроектыСПодстатусом.Проект КАК Проект,
	        |	ВТ_ТехПроектыСПодстатусом.ЭП_ЗафиксированнаяДатаИзменения КАК ЭП_ЗафиксированнаяДатаИзменения,
	        |	ВТ_ТехПроектыСПодстатусом.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ВТ_ТехПроектыСПодстатусом.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
	        |	ВТ_ТехПроектыСПодстатусом.Статус КАК Статус,
	        |	ВТ_ТехПроектыСПодстатусом.ЭтапПроекта КАК ЭтапПроекта,
	        |	ВТ_ТехПроектыСПодстатусом.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
	        |	ВТ_ТехПроектыСПодстатусом.Наименование КАК Наименование,
	        |	ВТ_ТехПроектыСПодстатусом.Ответственный КАК Ответственный,
	        |	ВТ_ТехПроектыСПодстатусом.Заметки КАК Заметки,
	        |	ВТ_ТехПроектыСПодстатусом.ЦелиПроекта КАК ЦелиПроекта,
	        |	ВТ_ТехПроектыСПодстатусом.Раздел КАК Раздел,
	        |	ВТ_ТехПроектыСПодстатусом.Очередность КАК Очередность,
	        |	ВТ_ТехПроектыСПодстатусом.Код КАК Код,
	        |	ВТ_ТехПроектыСПодстатусом.ДатаИзмененияПодстатуса КАК ДатаИзмененияПодстатуса,
	        |	ВТ_ТехПроектыСПодстатусом.Подстатус КАК Подстатус
	        |ПОМЕСТИТЬ ВТ_ТехПроекты
	        |ИЗ
	        |	ВТ_ТехПроектыСПодстатусом КАК ВТ_ТехПроектыСПодстатусом
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &Очередность = 0
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_ТехПроектыСПодстатусом.Очередность = &Очередность
	        |		КОНЕЦ
	        |	И ВЫБОР
	        |			КОГДА &Этап = ЗНАЧЕНИЕ(Справочник.РазделыПроекта.ПустаяСсылка)
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_ТехПроектыСПодстатусом.ЭтапПроекта = &Этап
	        |		КОНЕЦ
	        |	И ВЫБОР
	        |			КОГДА &ИсполнительПоТехПроекту = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_ТехПроектыСПодстатусом.Ответственный = &ИсполнительПоТехПроекту
	        |		КОНЕЦ
	        |	И ВЫБОР
	        |			КОГДА &СтатусПроверка
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_ТехПроектыСПодстатусом.Статус В (&СтатусТехПроекта)
	        |						И ВТ_ТехПроектыСПодстатусом.Подстатус ЕСТЬ NULL
	        |					ИЛИ ВТ_ТехПроектыСПодстатусом.Подстатус В (&СтатусТехПроекта)
	        |						И ВТ_ТехПроектыСПодстатусом.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыТехническихПроектов.Активен)
	        |		КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ЗадачиПроцесса.Ссылка КАК Ссылка,
	        |	ЗадачиПроцесса.Исполнитель КАК Исполнитель,
	        |	ЗадачиПроцесса.Контролирующий КАК Контролирующий,
	        |	ЗадачиПроцесса.ИсполнительПорученияПоЗадаче КАК Направлена,
	        |	ЗадачиПроцесса.Предмет КАК ТехническийПроект,
	        |	ЗадачиПроцесса.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ЗадачиПроцесса.ФактическаяДатаНачала КАК ФактическаяДатаНачала,
	        |	ЗадачиПроцесса.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
	        |	ЗадачиПроцесса.Код КАК Код,
	        |	ЗадачиПроцесса.Наименование КАК Наименование,
	        |	ЗадачиПроцесса.Статус КАК Статус,
	        |	ЗадачиПроцесса.Родитель КАК РодительЗадачи,
	        |	ЗадачиПроцесса.КрайняяДатаОкончания КАК КрайняяДатаОкончания,
	        |	ЗадачиПроцесса.Предмет.Версия КАК Версия,
	        |	ЗадачиПроцесса.Предмет.Владелец КАК Проект,
	        |	ЗадачиПроцесса.Предмет.РазделПроекта КАК ПредметРазделПроекта,
	        |	ЗадачиПроцесса.Предмет.Родитель КАК ПредметРодитель,
	        |	ЗадачиПроцесса.Предмет.Очередность КАК ПредметОчередность,
	        |	ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент = &Департамент КАК ЭтоЗадачаДепартаментаРазработки,
	        |	ВЫБОР
	        |		КОГДА ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент = &Департамент
	        |				И ЗадачиПроцесса.ФактическаяДатаНачала <> """"
	        |				И ЗадачиПроцесса.ФактическаяДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА ЗадачиПроцесса.ФактическаяДатаНачала
	        |		ИНАЧЕ ДАТАВРЕМЯ(3099, 1, 1)
	        |	КОНЕЦ КАК ФактическаяДатаНачалаРазработки,
	        |	ВЫБОР
	        |		КОГДА ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент = &Департамент
	        |			ТОГДА ЗадачиПроцесса.ФактическаяДатаОкончания
	        |		ИНАЧЕ """"
	        |	КОНЕЦ КАК ФактическаяДатаОкончанияРазработки,
	        |	ВЫБОР
	        |		КОГДА ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент <> &Департамент
	        |				И ЗадачиПроцесса.ФактическаяДатаНачала <> """"
	        |				И ЗадачиПроцесса.ФактическаяДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА ЗадачиПроцесса.ФактическаяДатаНачала
	        |		ИНАЧЕ ДАТАВРЕМЯ(3099, 1, 1)
	        |	КОНЕЦ КАК ФактическаяДатаНачалаАналитики,
	        |	ВЫБОР
	        |		КОГДА ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент <> &Департамент
	        |			ТОГДА ЗадачиПроцесса.ФактическаяДатаОкончания
	        |		ИНАЧЕ """"
	        |	КОНЕЦ КАК ФактическаяДатаОкончанияАналитики,
	        |	ВЫБОР
	        |		КОГДА (ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПринятаКВыполнению)
	        |				ИЛИ ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Запланирована))
	        |				И ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент = &Департамент
	        |			ТОГДА ЗадачиПроцесса.Контролирующий
	        |	КОНЕЦ КАК КонтролирующийРазработка,
	        |	ВЫБОР
	        |		КОГДА (ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПринятаКВыполнению)
	        |				ИЛИ ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Запланирована))
	        |				И ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент = &Департамент
	        |			ТОГДА ЗадачиПроцесса.ИсполнительПорученияПоЗадаче
	        |	КОНЕЦ КАК НаправленоРазработка,
	        |	ВЫБОР
	        |		КОГДА (ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПринятаКВыполнению)
	        |				ИЛИ ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Запланирована))
	        |				И ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент <> &Департамент
	        |			ТОГДА ЗадачиПроцесса.Контролирующий
	        |	КОНЕЦ КАК КонтролирующийАналитика,
	        |	ВЫБОР
	        |		КОГДА (ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПринятаКВыполнению)
	        |				ИЛИ ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Запланирована))
	        |				И ЗадачиПроцесса.Исполнитель.ЭП_Сотрудник.Департамент <> &Департамент
	        |			ТОГДА ЗадачиПроцесса.ИсполнительПорученияПоЗадаче
	        |	КОНЕЦ КАК НаправленоАналитика
	        |ПОМЕСТИТЬ ВТ_ЗадачиРазрешенные
	        |ИЗ
	        |	Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
	        |ГДЕ
	        |	ЗадачиПроцесса.Предмет ССЫЛКА Справочник.ТехническиеПроекты
	        |	И ЗадачиПроцесса.Предмет В
	        |			(ВЫБРАТЬ
	        |				ВТ_ТехПроекты.ТехническийПроект КАК Ссылка
	        |			ИЗ
	        |				ВТ_ТехПроекты КАК ВТ_ТехПроекты)
	        |	И НЕ ЗадачиПроцесса.ПометкаУдаления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЗадачиРазрешенные.Ссылка КАК Ссылка,
	        |	ВТ_ЗадачиРазрешенные.Исполнитель КАК Исполнитель,
	        |	ВТ_ЗадачиРазрешенные.Контролирующий КАК Контролирующий,
	        |	ВТ_ЗадачиРазрешенные.Направлена КАК Направлена,
	        |	ВТ_ЗадачиРазрешенные.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ЗадачиРазрешенные.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ВТ_ЗадачиРазрешенные.ФактическаяДатаНачала КАК ФактическаяДатаНачала,
	        |	ВТ_ЗадачиРазрешенные.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
	        |	ВТ_ЗадачиРазрешенные.Код КАК Код,
	        |	ВТ_ЗадачиРазрешенные.Наименование КАК Наименование,
	        |	ВТ_ЗадачиРазрешенные.Статус КАК Статус,
	        |	ВТ_ЗадачиРазрешенные.РодительЗадачи КАК РодительЗадачи,
	        |	ВТ_ЗадачиРазрешенные.КрайняяДатаОкончания КАК КрайняяДатаОкончания,
	        |	ВТ_ЗадачиРазрешенные.Версия КАК Версия,
	        |	ВТ_ЗадачиРазрешенные.Проект КАК Проект,
	        |	ВТ_ЗадачиРазрешенные.ПредметРазделПроекта КАК ПредметРазделПроекта,
	        |	ВТ_ЗадачиРазрешенные.ПредметРодитель КАК ПредметРодитель,
	        |	ВТ_ЗадачиРазрешенные.ПредметОчередность КАК ПредметОчередность,
	        |	ВТ_ЗадачиРазрешенные.ЭтоЗадачаДепартаментаРазработки КАК ЭтоЗадачаДепартаментаРазработки,
	        |	ВТ_ЗадачиРазрешенные.ФактическаяДатаНачалаРазработки КАК ФактическаяДатаНачалаРазработки,
	        |	ВТ_ЗадачиРазрешенные.ФактическаяДатаОкончанияРазработки КАК ФактическаяДатаОкончанияРазработки,
	        |	ВТ_ЗадачиРазрешенные.ФактическаяДатаНачалаАналитики КАК ФактическаяДатаНачалаАналитики,
	        |	ВТ_ЗадачиРазрешенные.ФактическаяДатаОкончанияАналитики КАК ФактическаяДатаОкончанияАналитики,
	        |	ВТ_ЗадачиРазрешенные.КонтролирующийРазработка КАК КонтролирующийРазработка,
	        |	ВТ_ЗадачиРазрешенные.НаправленоРазработка КАК НаправленоРазработка,
	        |	ВТ_ЗадачиРазрешенные.КонтролирующийАналитика КАК КонтролирующийАналитика,
	        |	ВТ_ЗадачиРазрешенные.НаправленоАналитика КАК НаправленоАналитика
	        |ПОМЕСТИТЬ ВТ_ДоступныеЗадачи
	        |ИЗ
	        |	ВТ_ЗадачиРазрешенные КАК ВТ_ЗадачиРазрешенные
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_ЗадачиРазрешенные.Исполнитель = &Исполнитель
	        |		КОНЕЦ
	        |	И ВЫБОР
	        |			КОГДА &Направлено = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_ЗадачиРазрешенные.Направлена = &Направлено
	        |		КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТехПроекты.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ТехПроекты.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ВТ_ТехПроекты.Код КАК Код,
	        |	ВТ_ТехПроекты.Ответственный КАК Исполнитель,
	        |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Контролирующий,
	        |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Направлена,
	        |	ДАТАВРЕМЯ(1, 1, 1) КАК ФактическаяДатаНачала,
	        |	ДАТАВРЕМЯ(1, 1, 1) КАК ФактическаяДатаОкончания,
	        |	ВТ_ТехПроекты.Версия КАК Версия,
	        |	ВТ_ТехПроекты.Проект КАК Проект,
	        |	ВТ_ТехПроекты.ЭП_ЗафиксированнаяДатаИзменения КАК ЭП_ЗафиксированнаяДатаИзменения,
	        |	ВТ_ТехПроекты.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
	        |	ВТ_ТехПроекты.Статус КАК Статус,
	        |	ВТ_ТехПроекты.ЭтапПроекта КАК ЭтапПроекта,
	        |	ВТ_ТехПроекты.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
	        |	ВТ_ТехПроекты.ТехническийПроект КАК Наименование,
	        |	ВТ_ТехПроекты.Заметки КАК Заметки,
	        |	ВТ_ТехПроекты.ЦелиПроекта КАК ЦелиПроекта,
	        |	ВТ_ТехПроекты.Раздел КАК Раздел,
	        |	ИСТИНА КАК ЭтоТехПроект,
	        |	ВТ_ТехПроекты.Очередность КАК Очередность,
	        |	NULL КАК РодительЗадачи,
	        |	NULL КАК Задача,
	        |	NULL КАК ЭтоЗадачаДепартаментаРазработки,
	        |	NULL КАК ФактическаяДатаНачалаРазработки,
	        |	NULL КАК ФактическаяДатаОкончанияРазработки,
	        |	NULL КАК ФактическаяДатаНачалаАналитики,
	        |	NULL КАК ФактическаяДатаОкончанияАналитики,
	        |	NULL КАК КонтролирующийРазработка,
	        |	NULL КАК НаправленоРазработка,
	        |	NULL КАК КонтролирующийАналитика,
	        |	NULL КАК НаправленоАналитика,
	        |	ВТ_ТехПроекты.Подстатус КАК Подстатус,
	        |	ВТ_ТехПроекты.ДатаИзмененияПодстатуса КАК ДатаИзмененияПодстатуса,
	        |	ВТ_ТехПроекты.Наименование КАК НаименованиеДляСорт
	        |ПОМЕСТИТЬ ВТ_ВсеТехПроектыСЗадачами
	        |ИЗ
	        |	ВТ_ТехПроекты КАК ВТ_ТехПроекты
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ДоступныеЗадачи.ТехническийПроект,
	        |	ВТ_ДоступныеЗадачи.ПлановаяДатаНачала,
	        |	ВТ_ДоступныеЗадачи.Код,
	        |	ВТ_ДоступныеЗадачи.Исполнитель,
	        |	ВТ_ДоступныеЗадачи.Контролирующий,
	        |	ВТ_ДоступныеЗадачи.Направлена,
	        |	ВТ_ДоступныеЗадачи.ФактическаяДатаНачала,
	        |	ВТ_ДоступныеЗадачи.ФактическаяДатаОкончания,
	        |	ВТ_ДоступныеЗадачи.Версия,
	        |	ВТ_ДоступныеЗадачи.Проект,
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	ВТ_ДоступныеЗадачи.КрайняяДатаОкончания,
	        |	ВТ_ДоступныеЗадачи.Статус,
	        |	ВТ_ДоступныеЗадачи.ПредметРазделПроекта,
	        |	ДАТАВРЕМЯ(1, 1, 1),
	        |	ВТ_ДоступныеЗадачи.Ссылка,
	        |	"""",
	        |	"""",
	        |	ВТ_ДоступныеЗадачи.ПредметРодитель,
	        |	ЛОЖЬ,
	        |	ВТ_ДоступныеЗадачи.ПредметОчередность,
	        |	ВТ_ДоступныеЗадачи.РодительЗадачи,
	        |	ВТ_ДоступныеЗадачи.Ссылка,
	        |	ВТ_ДоступныеЗадачи.ЭтоЗадачаДепартаментаРазработки,
	        |	ВТ_ДоступныеЗадачи.ФактическаяДатаНачалаРазработки,
	        |	ВТ_ДоступныеЗадачи.ФактическаяДатаОкончанияРазработки,
	        |	ВТ_ДоступныеЗадачи.ФактическаяДатаНачалаАналитики,
	        |	ВТ_ДоступныеЗадачи.ФактическаяДатаОкончанияАналитики,
	        |	ВТ_ДоступныеЗадачи.КонтролирующийРазработка,
	        |	ВТ_ДоступныеЗадачи.НаправленоРазработка,
	        |	ВТ_ДоступныеЗадачи.КонтролирующийАналитика,
	        |	ВТ_ДоступныеЗадачи.НаправленоАналитика,
	        |	NULL,
	        |	NULL,
	        |	NULL
	        |ИЗ
	        |	ВТ_ДоступныеЗадачи КАК ВТ_ДоступныеЗадачи
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ВсеТехПроектыСЗадачами.Код КАК КодСппр,
	        |	ВТ_ВсеТехПроектыСЗадачами.Раздел КАК Раздел,
	        |	ВТ_ВсеТехПроектыСЗадачами.ЭтапПроекта КАК Этап,
	        |	ВТ_ВсеТехПроектыСЗадачами.Наименование КАК Наименование,
	        |	ВТ_ВсеТехПроектыСЗадачами.Версия КАК Версия,
	        |	ВТ_ВсеТехПроектыСЗадачами.Статус КАК Статус,
	        |	ВТ_ВсеТехПроектыСЗадачами.ЭП_ЗафиксированнаяДатаИзменения КАК ДатаТехПроекта,
	        |	ВТ_ВсеТехПроектыСЗадачами.Исполнитель КАК Исполнитель,
	        |	ВТ_ВсеТехПроектыСЗадачами.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ВТ_ВсеТехПроектыСЗадачами.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
	        |	ВТ_ВсеТехПроектыСЗадачами.ФактическаяДатаНачала КАК ФактическаяДатаНачала,
	        |	ВТ_ВсеТехПроектыСЗадачами.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
	        |	ВТ_ВсеТехПроектыСЗадачами.Направлена КАК Направлена,
	        |	ВТ_ВсеТехПроектыСЗадачами.Контролирующий КАК Контролирующий,
	        |	ВТ_ВсеТехПроектыСЗадачами.ЦелиПроекта КАК Цели,
	        |	ВТ_ВсеТехПроектыСЗадачами.Заметки КАК Заметки,
	        |	ВТ_ВсеТехПроектыСЗадачами.Проект КАК Проект,
	        |	ВТ_ВсеТехПроектыСЗадачами.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
	        |	ВТ_ВсеТехПроектыСЗадачами.ЭтоТехПроект КАК ЭтоТехПроект,
	        |	ВТ_ВсеТехПроектыСЗадачами.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ВсеТехПроектыСЗадачами.РодительЗадачи КАК РодительЗадачи,
	        |	ВТ_ВсеТехПроектыСЗадачами.Задача КАК Задача,
	        |	ВТ_ВсеТехПроектыСЗадачами.Очередность КАК Очередность,
	        |	ВТ_ВсеТехПроектыСЗадачами.ЭтоЗадачаДепартаментаРазработки КАК ЭтоЗадачаДепартаментаРазработки,
	        |	ВТ_ВсеТехПроектыСЗадачами.ФактическаяДатаНачалаРазработки КАК ФактическаяДатаНачалаРазработки,
	        |	ВТ_ВсеТехПроектыСЗадачами.ФактическаяДатаОкончанияРазработки КАК ФактическаяДатаОкончанияРазработки,
	        |	ВТ_ВсеТехПроектыСЗадачами.ФактическаяДатаНачалаАналитики КАК ФактическаяДатаНачалаАналитики,
	        |	ВТ_ВсеТехПроектыСЗадачами.ФактическаяДатаОкончанияАналитики КАК ФактическаяДатаОкончанияАналитики,
	        |	ВТ_ВсеТехПроектыСЗадачами.КонтролирующийРазработка КАК КонтролирующийРазработка,
	        |	ВТ_ВсеТехПроектыСЗадачами.НаправленоРазработка КАК НаправленоРазработка,
	        |	ВТ_ВсеТехПроектыСЗадачами.КонтролирующийАналитика КАК КонтролирующийАналитика,
	        |	ВТ_ВсеТехПроектыСЗадачами.НаправленоАналитика КАК НаправленоАналитика,
	        |	ВТ_ВсеТехПроектыСЗадачами.Подстатус КАК Подстатус,
	        |	ВТ_ВсеТехПроектыСЗадачами.ДатаИзмененияПодстатуса КАК ДатаИзмененияПодстатуса,
	        |	ВТ_ВсеТехПроектыСЗадачами.НаименованиеДляСорт КАК НаименованиеДляСорт
	        |ПОМЕСТИТЬ ВТ_Иерархия
	        |ИЗ
	        |	ВТ_ВсеТехПроектыСЗадачами КАК ВТ_ВсеТехПроектыСЗадачами
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВТ_Иерархия.Задача КАК Задача
	        |ПОМЕСТИТЬ ВТ_РодительскиеЗадачи
	        |ИЗ
	        |	ВТ_Иерархия КАК ВТ_Иерархия
	        |ГДЕ
	        |	ВТ_Иерархия.Задача В
	        |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |				ВТ_Иерархия.РодительЗадачи КАК РодительЗадачи
	        |			ИЗ
	        |				ВТ_Иерархия КАК ВТ_Иерархия
	        |			ГДЕ
	        |				НЕ ВТ_Иерархия.РодительЗадачи = ЗНАЧЕНИЕ(Справочник.ЗадачиПроцесса.ПустаяСсылка)
	        |			СГРУППИРОВАТЬ ПО
	        |				ВТ_Иерархия.РодительЗадачи)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Иерархия.Задача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Иерархия.КодСппр КАК КодСппр,
	        |	ВТ_Иерархия.Раздел КАК Раздел,
	        |	ВТ_Иерархия.Этап КАК Этап,
	        |	ВТ_Иерархия.Наименование КАК Наименование,
	        |	ВТ_Иерархия.Версия КАК Версия,
	        |	ВТ_Иерархия.Статус КАК Статус,
	        |	ВТ_Иерархия.ДатаТехПроекта КАК ДатаТехПроекта,
	        |	ВТ_Иерархия.Исполнитель КАК Исполнитель,
	        |	ВТ_Иерархия.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
	        |	ВТ_Иерархия.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
	        |	ВТ_Иерархия.ФактическаяДатаНачала КАК ФактическаяДатаНачала,
	        |	ВТ_Иерархия.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
	        |	ВТ_Иерархия.Направлена КАК Направлена,
	        |	ВТ_Иерархия.Контролирующий КАК Контролирующий,
	        |	ВТ_Иерархия.Цели КАК Цели,
	        |	ВТ_Иерархия.Заметки КАК Заметки,
	        |	ВТ_Иерархия.Проект КАК Проект,
	        |	ВТ_Иерархия.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
	        |	ВТ_Иерархия.ЭтоТехПроект КАК ЭтоТехПроект,
	        |	ВТ_Иерархия.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_Иерархия.РодительЗадачи КАК РодительЗадачи,
	        |	ВТ_Иерархия.Задача КАК Задача,
	        |	ВТ_Иерархия.Очередность КАК Очередность,
	        |	ВТ_Иерархия.ФактическаяДатаОкончания КАК ФактическаяДатаОкончанияМин,
	        |	ВТ_Иерархия.ЭтоЗадачаДепартаментаРазработки КАК ЭтоЗадачаДепартаментаРазработки,
	        |	ВТ_Иерархия.ФактическаяДатаНачалаРазработки КАК ФактическаяДатаНачалаРазработки,
	        |	ВТ_Иерархия.ФактическаяДатаОкончанияРазработки КАК ФактическаяДатаОкончанияРазработки,
	        |	ВТ_Иерархия.ФактическаяДатаНачалаАналитики КАК ФактическаяДатаНачалаАналитики,
	        |	ВТ_Иерархия.ФактическаяДатаОкончанияАналитики КАК ФактическаяДатаОкончанияАналитики,
	        |	ВТ_Иерархия.КонтролирующийРазработка КАК КонтролирующийРазработка,
	        |	ВТ_Иерархия.НаправленоРазработка КАК НаправленоРазработка,
	        |	ВТ_Иерархия.КонтролирующийАналитика КАК КонтролирующийАналитика,
	        |	ВТ_Иерархия.НаправленоАналитика КАК НаправленоАналитика,
	        |	ВТ_Иерархия.Подстатус КАК Подстатус,
	        |	ВТ_Иерархия.ДатаИзмененияПодстатуса КАК ДатаИзмененияПодстатуса,
	        |	ВТ_Иерархия.НаименованиеДляСорт КАК НаименованиеДляСорт,
	        |	ВЫБОР
	        |		КОГДА ВТ_РодительскиеЗадачи.Задача ЕСТЬ NULL
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК РодительскаяЗадача
	        |ИЗ
	        |	ВТ_Иерархия КАК ВТ_Иерархия
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РодительскиеЗадачи КАК ВТ_РодительскиеЗадачи
	        |		ПО ВТ_Иерархия.Задача = ВТ_РодительскиеЗадачи.Задача
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ИсполнительПроверка
	        |				ТОГДА ВТ_Иерархия.ТехническийПроект В
	        |						(ВЫБРАТЬ
	        |							ВТ_ДоступныеЗадачи.ТехническийПроект
	        |						ИЗ
	        |							ВТ_ДоступныеЗадачи КАК ВТ_ДоступныеЗадачи
	        |						ГДЕ
	        |							ВТ_ДоступныеЗадачи.Исполнитель = &Исполнитель)
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
	        |	И ВЫБОР
	        |			КОГДА &ФлагНаправлено
	        |				ТОГДА ВТ_Иерархия.ТехническийПроект В
	        |						(ВЫБРАТЬ
	        |							ВТ_ДоступныеЗадачи.ТехническийПроект
	        |						ИЗ
	        |							ВТ_ДоступныеЗадачи КАК ВТ_ДоступныеЗадачи
	        |						ГДЕ
	        |							ВТ_ДоступныеЗадачи.Направлена = &Направлено)
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
	        |	И ВЫБОР
	        |			КОГДА &Раздел = ЗНАЧЕНИЕ(Справочник.ТехническиеПроекты.ПустаяСсылка)
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ВТ_Иерархия.Раздел В ИЕРАРХИИ (&Раздел)
	        |		КОНЕЦ
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ВТ_Иерархия.Раздел.Наименование,
	        |	ЭтоТехПроект УБЫВ,
	        |	НаименованиеДляСорт,
	        |	Очередность,
	        |	РодительЗадачи
	        |ИТОГИ
	        |	МИНИМУМ(ФактическаяДатаНачалаРазработки),
	        |	ВЫБОР
	        |		КОГДА МИНИМУМ(ФактическаяДатаОкончанияРазработки) = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА """"
	        |		ИНАЧЕ МАКСИМУМ(ФактическаяДатаОкончанияРазработки)
	        |	КОНЕЦ КАК ФактическаяДатаОкончанияРазработки,
	        |	МИНИМУМ(ФактическаяДатаНачалаАналитики),
	        |	ВЫБОР
	        |		КОГДА МИНИМУМ(ФактическаяДатаОкончанияАналитики) = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА """"
	        |		ИНАЧЕ МАКСИМУМ(ФактическаяДатаОкончанияАналитики)
	        |	КОНЕЦ КАК ФактическаяДатаОкончанияАналитики
	        |ПО
	        |	ТехническийПроект
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВТ_Иерархия.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ТегиПоТехПроектам.Тег КАК Тег
	        |ИЗ
	        |	ВТ_Иерархия КАК ВТ_Иерархия
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТегиПоТехПроектам КАК ВТ_ТегиПоТехПроектам
	        |		ПО ВТ_Иерархия.ТехническийПроект = ВТ_ТегиПоТехПроектам.ТехническийПроект
	        |			И ВТ_Иерархия.Проект = ВТ_ТегиПоТехПроектам.Проект
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ТегиЗаполнены
	        |				ТОГДА ВТ_ТегиПоТехПроектам.Тег В (&МассивТегов)
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТегиПоТехПроектам.ТехническийПроект КАК ТехническийПроект,
	        |	ВТ_ТегиПоТехПроектам.Тег КАК Тег
	        |ИЗ
	        |	ВТ_ТегиПоТехПроектам КАК ВТ_ТегиПоТехПроектам
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ТехническиеПроектыОбъектыМетаданных.ОбъектМетаданных КАК ОбъектМетаданных,
	        |	ТехническиеПроектыОбъектыМетаданных.Ссылка КАК ТехническийПроект
	        |ИЗ
	        |	ВТ_ВсеТехПроектыСЗадачами КАК ВТ_ВсеТехПроектыСЗадачами
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехническиеПроекты.ОбъектыМетаданных КАК ТехническиеПроектыОбъектыМетаданных
	        |		ПО ВТ_ВсеТехПроектыСЗадачами.ТехническийПроект = ТехническиеПроектыОбъектыМетаданных.Ссылка";		
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаДанныхПоКлючевымСотрудникамПроекта()
	Возврат "ВЫБРАТЬ
	         |	ПроектыЭП_КлючевыеСотрудники.Сотрудник КАК Сотрудник
	         |ИЗ
	         |	Справочник.Проекты.ЭП_КлючевыеСотрудники КАК ПроектыЭП_КлючевыеСотрудники
	         |ГДЕ
	         |	ПроектыЭП_КлючевыеСотрудники.Ссылка = &Проект";
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаПолучитьПодстатус()
	Возврат "ВЫБРАТЬ
	        |	ЭП_ПодстатусыТехническихПроектовСрезПоследних.Подстатус КАК Подстатус
	        |ИЗ
	        |	РегистрСведений.ЭП_ПодстатусыТехническихПроектов.СрезПоследних(, ТехПроект = &Ссылка) КАК ЭП_ПодстатусыТехническихПроектовСрезПоследних";
КонецФункции

&НаСервере
Функция ПроверкаНаКлючевогоСотрудника()
		
	Запрос = Новый Запрос( ТекстЗапросаДанныхПоКлючевымСотрудникамПроекта());
	Запрос.УстановитьПараметр("Проект",Отчет.Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Сотрудник = ТекущийСотрудник Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
    Возврат Ложь;

КонецФункции

&НаКлиенте
Процедура ЭП_ТегиЗаполнениеНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("Проект, ТехническийПроект", Отчет.Проект, Отчет.ТехПроект);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыПоискаТегов", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ЭП_ФормаПоискаТегов", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияФормыПоискаТегов(Результат, Параметры)  Экспорт

	Если ТипЗнч(Результат) = Тип("Неопределено") Тогда
		Возврат;
	КонецЕсли;
	Теги.ЗагрузитьЗначения(Результат);
	
	Если Результат.Количество() = 0 Тогда
		Элементы.ЭП_ТегиЗаполнение.Заголовок = "Теги не заданы";
		Возврат;
	КонецЕсли; 
	
	ТегиЗаполнение = "Теги: ";
	Для каждого СтрокаМассива Из Результат Цикл
	
		ТегиЗаполнение = ТегиЗаполнение + СтрокаМассива + "; ";	
	
	КонецЦикла;
				
	ТегиЗаполнение = Лев(ТегиЗаполнение, СтрДлина(ТегиЗаполнение) - 2); 
	Элементы.ЭП_ТегиЗаполнение.Заголовок = ТегиЗаполнение; 
	Элементы.ЭП_ТегиЗаполнение.Подсказка = ТегиЗаполнение;
	
КонецПроцедуры
