Процедура ПередЗаписью(Отказ, Замещение)
	
	ТекПоказатели = ЭтотОбъект.ВыгрузитьКолонку("Показатель");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭП_ДатыЗакрытияРедактированияПроектныхПоказателейСрезПоследних.Период КАК Период,
	               |	ЭП_ДатыЗакрытияРедактированияПроектныхПоказателейСрезПоследних.Показатель КАК Показатель
	               |ИЗ
	               |	РегистрСведений.ЭП_ДатыЗакрытияРедактированияПроектныхПоказателей.СрезПоследних(&Период, Показатель В (&МассивПоказателей)) КАК ЭП_ДатыЗакрытияРедактированияПроектныхПоказателейСрезПоследних
	               |ГДЕ
	               |	ЭП_ДатыЗакрытияРедактированияПроектныхПоказателейСрезПоследних.Период = &Период";
	Запрос.УстановитьПараметр("МассивПоказателей", ТекПоказатели); 
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Отбор.ПериодОценивания.Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
			
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "По следующим проектным показателям закрыт период редактирования: ";        
		Сообщение.Сообщить();
		Пока Выборка.Следующий() Цикл
		
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ""+Выборка.Показатель;        
			Сообщение.Сообщить();
		
		КонецЦикла;
		Возврат;
	
	КонецЕсли;
	
КонецПроцедуры
