#Область ПрограммныйИнтерфейс
// Устанавливает значение свойства элементов формы.
// Применяется в тех случаях, когда элемента формы может не быть на форме 
// из-за отсутствия прав у пользователя на объект, реквизит объекта или команду.
//
// Параметры:
//  ЭлементыФормы  - ФормаКлиентскогоПриложения, ВсеЭлементыФормы, ЭлементыФормы - коллекция элементов управляемой формы.
//  ИменаЭлементов - Строка, Массив - имя элемента формы.
//  ИмяСвойства    - Строка         - имя устанавливаемого свойства элементов формы.
//  Значение       - Произвольный   - новое значение элементов.
// 
Процедура УстановитьСвойствоЭлементовФормы(Знач ЭлементыФормы, Знач ИменаЭлементов, ИмяСвойства, Значение) Экспорт
	
	Если ТипЗнч(ЭлементыФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
		ЭлементыФормы = ЭлементыФормы.Элементы;
	КонецЕсли;
	
	Если ТипЗнч(ИменаЭлементов) = Тип("Строка") Тогда
		ИменаЭлементов = РазделитьИменаСвойств(ИменаЭлементов);
	КонецЕсли;	
	
	Для Каждого ИмяЭлемента Из ИменаЭлементов Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства, Значение);
	КонецЦикла;	
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Разделяет строку с именами свойств на части по разделителю-запятой.
//
// Параметры:
//	СписокСвойств - Строка - имена свойств,  разделенные запятыми. 
//
// Возвращаемое значение:
//	Булево - Массив, строки, которые получились в результате разделения списка свойств.
// 
Функция РазделитьИменаСвойств(СписокСвойств)
	ИменаСвойств = Новый Массив;
	Для Каждого Свойство Из Новый Структура(СписокСвойств) Цикл
	    ИменаСвойств.Добавить(Свойство.Ключ)
	КонецЦикла;	
	Возврат ИменаСвойств
КонецФункции

#КонецОбласти


