
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Ответственный.Ссылка.Пустая() ИЛИ НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если (ЗначениеЗаполнено(ДатаПолучен) и ДатаПолучен < ДатаАкта ) Тогда
		Сообщить("Дата получения не может быть меньше даты документа");
		Отказ = Истина;
	КонецЕсли;
	Если (ЗначениеЗаполнено(ДатаОплаты) и ДатаОплаты < ДатаАкта ) Тогда
		Сообщить("Дата получения не может быть меньше даты документа");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЭП_РеализацияУслуг.Представление КАК Представление
	                      |ИЗ
	                      |	Документ.ЭП_РеализацияУслуг КАК ЭП_РеализацияУслуг
	                      |ГДЕ
	                      |	ЭП_РеализацияУслуг.Этап = &Этап
	                      |	И ЭП_РеализацияУслуг.Проведен
	                      |	И ЭП_РеализацияУслуг.Ссылка <> &Ссылка"); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Этап", Этап);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Сообщить(СтрШаблон("Для указанного этапа уже проведен документ: %1", Выборка.Представление));
		Возврат;
	КонецЕсли;
	
	// регистр ЭП_РезультатыАктирования 
	Движения.ЭП_Реализация.Записывать = Истина;
	Движение = Движения.ЭП_Реализация.Добавить();
	Движение.Период = ДатаАкта;
	Движение.Проект = Проект;
	Движение.Этап = Этап;
	Движение.Сумма = СуммаАкта;
	Движение.ДатаОплачен = ДатаОплаты;
	Движение.ДатаПолучен = ДатаПолучен;
	Движение.ДатаАкта = ДатаАкта;
	

КонецПроцедуры

