&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ЭП_Проект) И ЗначениеЗаполнено(Параметры.РазделПроекта) 
		И ЗначениеЗаполнено(Параметры.Предмет) Тогда 
		
		СписокЗадач.Параметры.УстановитьЗначениеПараметра("ЭП_Проект", Параметры.ЭП_Проект);
		СписокЗадач.Параметры.УстановитьЗначениеПараметра("РазделПроекта", Параметры.РазделПроекта); 
		СписокЗадач.Параметры.УстановитьЗначениеПараметра("Предмет", Параметры.Предмет); 
						
		Если ЗначениеЗаполнено(Параметры.Сотрудник) Тогда 			
			Исполнитель = ПолучитьПользователя(Параметры.Сотрудник);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗадач,"Исполнитель", Исполнитель,
			ВидСравненияКомпоновкиДанных.Равно, ,Истина);			
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗадач,"Исполнитель", ,
			ВидСравненияКомпоновкиДанных.Равно, ,Ложь);	
		КонецЕсли;
		
	Иначе
		СписокЗадач.Параметры.УстановитьЗначениеПараметра("ЭП_Проект", Null);
		СписокЗадач.Параметры.УстановитьЗначениеПараметра("РазделПроекта", Null); 
		СписокЗадач.Параметры.УстановитьЗначениеПараметра("Предмет", Null);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(Элементы.СписокЗадач.ТекущиеДанные);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Функция ПолучитьПользователя(Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ЭП_Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл			
			Возврат Выборка.Ссылка;			
		КонецЦикла;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗадач,"Исполнитель", Исполнитель,
	ВидСравненияКомпоновкиДанных.Равно, ,ЗначениеЗаполнено(Исполнитель));
	
КонецПроцедуры
