
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Замещение = Ложь Тогда 
		
		Для каждого ТекЗапись Из ЭтотОбъект Цикл
			
			ТекПроект 		= ТекЗапись.ТехПроект;
			ТекПериод 		= ТекЗапись.Период;
			ТекПодстатус 	= ТекЗапись.Подстатус;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭП_ПодстатусыТехническихПроектовСрезПоследних.Подстатус КАК Подстатус
			|ИЗ
			|	РегистрСведений.ЭП_ПодстатусыТехническихПроектов.СрезПоследних(&Дата, ТехПроект = &ТехПроект) КАК ЭП_ПодстатусыТехническихПроектовСрезПоследних";
			
			Запрос.УстановитьПараметр("Дата", ТекПериод);
			Запрос.УстановитьПараметр("ТехПроект", ТекПроект);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда 
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Выборка.Следующий();
				
				ПоследнийПодстатус = Выборка.Подстатус;
				
				Если ПоследнийПодстатус = ТекПодстатус Тогда 				
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = 	СтрШаблон("Предыдущий подстатус имеет такое же значение: ""%1"", необходимо добавить новое значение",
					Выборка.Подстатус);
					Сообщение.Сообщить(); 
					
					Отказ = Истина;
					
				КонецЕсли;	
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого ТекЗапись Из ЭтотОбъект Цикл
		
		Статус = ТекЗапись.Подстатус;
		
		Если Статус = Перечисления.ЭП_Подстатусы.НаписаниеПостановки 
			ИЛИ Статус = Перечисления.ЭП_Подстатусы.ДоработкаПостановки 
			ИЛИ Статус = Перечисления.ЭП_Подстатусы.ВРазработке 
			ИЛИ Статус = Перечисления.ЭП_Подстатусы.ДоработкаПоЗамечаниям
			ИЛИ Статус = Перечисления.ЭП_Подстатусы.ВТестировании
			ИЛИ Статус = Перечисления.ЭП_Подстатусы.ПринятоПостановщиком
			ИЛИ Статус = Перечисления.ЭП_Подстатусы.ПринятоФЗ Тогда 
			
			ОбъектТП = ТекЗапись.ТехПроект.ПолучитьОбъект();
			
			Если НЕ ОбъектТП.Статус = Перечисления.СтатусыТехническихПроектов.Активен И НЕ Отказ Тогда
				
				ОбъектТП.Статус = Перечисления.СтатусыТехническихПроектов.Активен;
				ОбъектТП.Записать();
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
