#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭП_РеализацияОтгуловДокСотрудники.ДатаОтгула КАК ДатаОтгула
		|ПОМЕСТИТЬ ВТ_ДатыОтгула
		|ИЗ
		|	Документ.ЭП_РеализацияОтгуловДок.Сотрудники КАК ЭП_РеализацияОтгуловДокСотрудники
		|ГДЕ
		|	ЭП_РеализацияОтгуловДокСотрудники.Ссылка.Проведен
		|	И ЭП_РеализацияОтгуловДокСотрудники.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних.Период КАК Период,
		|	ВТ_ДатыОтгула.ДатаОтгула КАК ДатаОтгула
		|ИЗ
		|	ВТ_ДатыОтгула КАК ВТ_ДатыОтгула
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_ДатыЗакрытияРедактированияПоказателей.СрезПоследних КАК ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних
		|		ПО (ВТ_ДатыОтгула.ДатаОтгула <= КОНЕЦПЕРИОДА(ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних.Период, МЕСЯЦ))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних.Период УБЫВ"; 
		
		Запрос.УстановитьПараметр("Ссылка",Параметры.Ключ);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСотрудники

&НаКлиенте
Процедура СотрудникиДатаОтгулаПриИзменении(Элемент)
	
	ИндексСтроки = Элементы.Сотрудники.ТекущаяСтрока;
	СтрокаТЧ = Объект.Сотрудники.НайтиПоИдентификатору(ИндексСтроки);
    ДеньНеделиДляПроверки = ДеньНедели(СтрокаТЧ.ДатаОтгула);
	
	Если ДеньНеделиДляПроверки = 6 ИЛИ ДеньНеделиДляПроверки = 7 Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нелья добавить отгул на выходной день");
		СтрокаТЧ.ДатаОтгула = Дата(1,1,1);
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) Тогда
		
		 СотрудникиСотрудникПриИзмененииНаСервере(СтрокаТЧ.ДатаОтгула, СтрокаТЧ.Сотрудник, ИндексСтроки)
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиСотрудникПриИзмененииНаСервере(ДатаОтгула, Сотрудник, ИндексСтроки)

	СтруктураДаты = Новый Структура(); 
	СтруктураДаты.Вставить("ДатаОтгула", ДатаОтгула); 
	СтруктураДаты.Вставить("Сотрудник", Сотрудник);
	
	Если Объект.Сотрудники.Количество() > 1 И ЗначениеЗаполнено(ДатаОтгула) Тогда

	НайденныеДаты = Объект.Сотрудники.НайтиСтроки(СтруктураДаты);
	
		Если НайденныеДаты.Количество() > 1 Тогда
			
			ОбщегоНазначения.СообщитьПользователю("По сотруднику " + Сотрудник + " на дату "
			+ Формат(ДатаОтгула, "ДЛФ=D") + " уже есть запись в строке " + НайденныеДаты[0].НомерСтроки);			
			Объект.Сотрудники.Удалить(ИндексСтроки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент) 
	
	ИндексСтроки = Элементы.Сотрудники.ТекущаяСтрока;
	СтрокаТЧ = Объект.Сотрудники.НайтиПоИдентификатору(ИндексСтроки);
	
	Если Объект.Сотрудники.Количество() > 1 Тогда
		СотрудникиСотрудникПриИзмененииНаСервере(СтрокаТЧ.ДатаОтгула, СтрокаТЧ.Сотрудник, ИндексСтроки); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если НЕ Объект.Проект.Пустая() И ЗначениеЗаполнено(Элементы.Сотрудники.ТекущиеДанные.Департамент) И ЗначениеЗаполнено(Объект.Проект) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;                                                   
		ПараметрыФормы.Вставить("Проект",Объект.Проект);
		ПараметрыФормы.Вставить("Департамент", Элементы.Сотрудники.ТекущиеДанные.Департамент);
		ОткрытьФорму("Справочник.ЭП_Сотрудники.Форма.ФормаВыбораПереработки", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 	
	Иначе
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(,"Не заполнен проект или поле табличной части департамент, работа подбора не возможна",,"Предупреждение"); 
		Возврат; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Справочник.ЭП_Сотрудники.Форма.ФормаВыбораПереработки" Тогда
		ДобавитьЗапись(ВыбранноеЗначение.Сотрудник, Элементы.Сотрудники.ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗапись(Выбор, ИндексСтроки)
	
	Если ТипЗнч(Выбор) = Тип("СправочникСсылка.ЭП_Сотрудники") Тогда 
		СтрокаТЧ = Объект.Сотрудники.НайтиПоИдентификатору(ИндексСтроки);
		СтрокаТЧ.Сотрудник = Выбор;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_РеализацияОтгуловСотрудники.Сотрудник КАК Сотрудник,
		|	ЭП_РеализацияОтгуловСотрудники.ДатаОтгула КАК ДатаОтгула,
		|	ЭП_РеализацияОтгуловСотрудники.Сотрудник.Представление КАК СотрудникПредставление
		|ИЗ
		|	Документ.ЭП_РеализацияОтгуловДок.Сотрудники КАК ЭП_РеализацияОтгуловСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭП_РеализацияОтгуловДок КАК ЭП_РеализацияОтгулов
		|		ПО ЭП_РеализацияОтгуловСотрудники.Ссылка = ЭП_РеализацияОтгулов.Ссылка
		|ГДЕ
		|	ЭП_РеализацияОтгуловСотрудники.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();   
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого СтрокаТЧ Из Объект.Сотрудники Цикл
			
			Если СтрокаТЧ.ДатаОтгула = Выборка.ДатаОтгула И СтрокаТЧ.Сотрудник = Выборка.Сотрудник Тогда
				
				Отказ = Истина;
				СтрокаСообщения = СтрШаблон("По сотруднику %1 на дату %2 уже зарегистрирован отгул", Выборка.СотрудникПредставление, Выборка.ДатаОтгула);
				ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения);  
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти
