&НаКлиенте
Процедура ОткрытьОтчетЗагруженностьСотрудниковМеньшеНеобходимого(Команда)
	ОткрытьФорму("Отчет.ЭП_ПроцентнаяЗагруженностьСотрудников.Форма");	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОтсутствиеРасчетногоПрофиляУСотрудника(Команда)
	ОткрытьФорму("Отчет.ЭП_ОтсутствиеРасчетныхПрофилейУСторудников.Форма");
КонецПроцедуры 

&НаСервере
Процедура ОбновитьДанныеВиджета() 
	  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники.РасчетныеПрофили КАК ЭП_СотрудникиРасчетныеПрофили
		|		ПО (ЭП_СотрудникиРасчетныеПрофили.Ссылка = ЭП_Сотрудники.Ссылка)
		|ГДЕ
		|	ЭП_СотрудникиРасчетныеПрофили.Ссылка ЕСТЬ NULL
		|	И НЕ ЭП_Сотрудники.СтатусСотрудника = &СтатусСотрудника
		|	И НЕ ЭП_Сотрудники.ДоговорГПХ"; 
	Запрос.УстановитьПараметр("СтатусСотрудника", Перечисления.ЭП_СтатусыСотрудников.Уволен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	КоличествоСотрудниковБезПрофилей = 0;
	КоличествоСотрудниковБезПрофилей = ВыборкаДетальныеЗаписи.Количество();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_ЗагруженностьСотрудников.Сотрудник КАК Сотрудник,
		|	СУММА(ЭП_ЗагруженностьСотрудников.ПроцентЗагрузки) КАК ПроцентЗагрузки
		|ИЗ
		|	РегистрСведений.ЭП_ЗагруженностьСотрудников КАК ЭП_ЗагруженностьСотрудников
		|ГДЕ
		|	ЭП_ЗагруженностьСотрудников.Период МЕЖДУ &ПериодНач И &ПериодКон
		|
		|СГРУППИРОВАТЬ ПО
		|	ЭП_ЗагруженностьСотрудников.Сотрудник
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЭП_ЗагруженностьСотрудников.ПроцентЗагрузки) < 100";  
	
	ТекущаяДата = ТекущаяДатаСеанса();
	Запрос.УстановитьПараметр("ПериодНач", НачалоМесяца(ТекущаяДата));
	Запрос.УстановитьПараметр("ПериодКон", КонецМесяца(ТекущаяДата));

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	КоличествоНеЗагруженныхСторудников = 0;
	КоличествоНеЗагруженныхСторудников = ВыборкаДетальныеЗаписи.Количество();      
	СтрокаЗагруженности = "У " + КоличествоНеЗагруженныхСторудников + " сотрудников загрузка меньше 100%";
	СтрокаПрофилей = "У " + КоличествоСотрудниковБезПрофилей + " сотрудников отсутствует расчетный профиль";
		
	Элементы.ГруппаКоманд.ПодчиненныеЭлементы.ЗагруженностьСотрудниковМеньшеНеобходимого.Заголовок = СтрЗаменить(
						Элементы.ГруппаКоманд.ПодчиненныеЭлементы.ЗагруженностьСотрудниковМеньшеНеобходимого.Заголовок,
						Элементы.ГруппаКоманд.ПодчиненныеЭлементы.ЗагруженностьСотрудниковМеньшеНеобходимого.Заголовок,
						СтрокаЗагруженности);
		
	Элементы.ГруппаКоманд.ПодчиненныеЭлементы.ОтсутствиеРасчетногоПрофиляУСотрудника.Заголовок = СтрЗаменить(
						Элементы.ГруппаКоманд.ПодчиненныеЭлементы.ОтсутствиеРасчетногоПрофиляУСотрудника.Заголовок,
						Элементы.ГруппаКоманд.ПодчиненныеЭлементы.ОтсутствиеРасчетногоПрофиляУСотрудника.Заголовок,
						СтрокаПрофилей);
						
КонецПроцедуры  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДанныеВиджета();
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДанныеВиджета();	
КонецПроцедуры

