
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Файлы") Тогда
		
		СтандартнаяОбработка = Ложь;
		Если Не ЗначениеЗаполнено(Расшифровка) Тогда                                  
			Возврат;
		КонецЕсли;
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(Расшифровка, Неопределено, УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла); 
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("Строка") Тогда 
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(Расшифровка) Тогда		
			
			ПерейтиПоНавигационнойСсылке(Расшифровка);			
		
		КонецЕсли;                                
	КонецЕсли;
	
КонецПроцедуры
